[Killed] Block removal mutation
Absents/Commands/CreateAbsent/CreateAbsentCommand.cs:16:13
             public int UserId { get; set; }
             public CreateAbsentCommandBody Body { get; set; }
             public CreateAbsentCommand(int id, CreateAbsentCommandBody body)
-            {
-                UserId = id;
-                Body = body;
-            }
+            {}
 
         }
