[NoCoverage] Block removal mutation
repos/miguel-pvs/employee_api/Program.cs:19:1
 var builder = WebApplication.CreateBuilder(args);
 
 void setJsonOptions(JsonSerializerOptions serializerOptions)
-{
-    serializerOptions.Converters.Add(new NullableTimeSpanJsonConverter());
-    serializerOptions.Converters.Add(new TimeSpanJsonConverter());
-}
+{}
 
 builder.Services.AddDbContext<AppDbContext>

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:20:5
 
 void setJsonOptions(JsonSerializerOptions serializerOptions)
 {
-    serializerOptions.Converters.Add(new NullableTimeSpanJsonConverter());
+    ;
     serializerOptions.Converters.Add(new TimeSpanJsonConverter());
 }

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:21:5
 void setJsonOptions(JsonSerializerOptions serializerOptions)
 {
     serializerOptions.Converters.Add(new NullableTimeSpanJsonConverter());
-    serializerOptions.Converters.Add(new TimeSpanJsonConverter());
+    ;
 }
 

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:24:1
     serializerOptions.Converters.Add(new TimeSpanJsonConverter());
 }
 
-builder.Services.AddDbContext<AppDbContext>
-    (options => options.UseSqlite(@"Data Source=DB.db"));
+;
 
 builder.Services.AddControllers()

[NoCoverage] String mutation
repos/miguel-pvs/employee_api/Program.cs:25:35
 }
 
 builder.Services.AddDbContext<AppDbContext>
-    (options => options.UseSqlite(@"Data Source=DB.db"));
+    (options => options.UseSqlite(""));
 
 builder.Services.AddControllers()

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:27:1
 builder.Services.AddDbContext<AppDbContext>
     (options => options.UseSqlite(@"Data Source=DB.db"));
 
-builder.Services.AddControllers()
-    .AddJsonOptions(options =>
-    {
-        setJsonOptions(options.JsonSerializerOptions);
-    });
+;
 
 builder.Services.AddEndpointsApiExplorer();

[NoCoverage] Block removal mutation
repos/miguel-pvs/employee_api/Program.cs:29:5
 
 builder.Services.AddControllers()
     .AddJsonOptions(options =>
-    {
-        setJsonOptions(options.JsonSerializerOptions);
-    });
+    {});
 
 builder.Services.AddEndpointsApiExplorer();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:30:9
 builder.Services.AddControllers()
     .AddJsonOptions(options =>
     {
-        setJsonOptions(options.JsonSerializerOptions);
+        ;
     });
 

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:36:1
 builder.Services.AddEndpointsApiExplorer();
 builder.Services.AddSwaggerGen();
 
-builder.Services.AddMediatR(typeof(CreateApplicationUserCommand));
+;
 builder.Services.AddValidatorsFromAssemblies(new Assembly[] { typeof(CreateApplicationUserCommandValidator).Assembly });
 

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:37:1
 builder.Services.AddSwaggerGen();
 
 builder.Services.AddMediatR(typeof(CreateApplicationUserCommand));
-builder.Services.AddValidatorsFromAssemblies(new Assembly[] { typeof(CreateApplicationUserCommandValidator).Assembly });
+;
 
 builder.Services.AddTransient(typeof(IPipelineBehavior<,>), typeof(RequestValidationBehaviour<,>));

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:39:1
 builder.Services.AddMediatR(typeof(CreateApplicationUserCommand));
 builder.Services.AddValidatorsFromAssemblies(new Assembly[] { typeof(CreateApplicationUserCommandValidator).Assembly });
 
-builder.Services.AddTransient(typeof(IPipelineBehavior<,>), typeof(RequestValidationBehaviour<,>));
+;
 
 builder.Services.AddTransient<IApplicationUsersRepository, ApplicationUserRepository>();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:41:1
 
 builder.Services.AddTransient(typeof(IPipelineBehavior<,>), typeof(RequestValidationBehaviour<,>));
 
-builder.Services.AddTransient<IApplicationUsersRepository, ApplicationUserRepository>();
+;
 builder.Services.AddSingleton<IUnsService, UnsService>();
 builder.Services.AddSingleton<IMqttService, MqttService>();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:42:1
 builder.Services.AddTransient(typeof(IPipelineBehavior<,>), typeof(RequestValidationBehaviour<,>));
 
 builder.Services.AddTransient<IApplicationUsersRepository, ApplicationUserRepository>();
-builder.Services.AddSingleton<IUnsService, UnsService>();
+;
 builder.Services.AddSingleton<IMqttService, MqttService>();
 builder.Services.AddSingleton<ITimerService, TimerService>();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:43:1
 
 builder.Services.AddTransient<IApplicationUsersRepository, ApplicationUserRepository>();
 builder.Services.AddSingleton<IUnsService, UnsService>();
-builder.Services.AddSingleton<IMqttService, MqttService>();
+;
 builder.Services.AddSingleton<ITimerService, TimerService>();
 builder.Services.AddTransient<IWorkPatternRepository, WorkPatternRepository>();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:44:1
 builder.Services.AddTransient<IApplicationUsersRepository, ApplicationUserRepository>();
 builder.Services.AddSingleton<IUnsService, UnsService>();
 builder.Services.AddSingleton<IMqttService, MqttService>();
-builder.Services.AddSingleton<ITimerService, TimerService>();
+;
 builder.Services.AddTransient<IWorkPatternRepository, WorkPatternRepository>();
 builder.Services.AddTransient<IAbsentRepository, AbsentRepository>();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:45:1
 builder.Services.AddSingleton<IUnsService, UnsService>();
 builder.Services.AddSingleton<IMqttService, MqttService>();
 builder.Services.AddSingleton<ITimerService, TimerService>();
-builder.Services.AddTransient<IWorkPatternRepository, WorkPatternRepository>();
+;
 builder.Services.AddTransient<IAbsentRepository, AbsentRepository>();
 builder.Services.AddHostedService<UnsWorker>();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:46:1
 builder.Services.AddSingleton<IMqttService, MqttService>();
 builder.Services.AddSingleton<ITimerService, TimerService>();
 builder.Services.AddTransient<IWorkPatternRepository, WorkPatternRepository>();
-builder.Services.AddTransient<IAbsentRepository, AbsentRepository>();
+;
 builder.Services.AddHostedService<UnsWorker>();
 

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:47:1
 builder.Services.AddSingleton<ITimerService, TimerService>();
 builder.Services.AddTransient<IWorkPatternRepository, WorkPatternRepository>();
 builder.Services.AddTransient<IAbsentRepository, AbsentRepository>();
-builder.Services.AddHostedService<UnsWorker>();
+;
 
 var app = builder.Build();

[NoCoverage] Block removal mutation
repos/miguel-pvs/employee_api/Program.cs:52:1
 var app = builder.Build();
 
 if (app.Environment.IsDevelopment())
-{
-    app.UseSwagger();
-    app.UseSwaggerUI();
-}
+{}
 
 app.UseHttpsRedirection();

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/Program.cs:63:1
 
 app.MapControllers();
 
-app.UseMiddleware<ApiExceptionsMiddleware>();
+;
 
 app.Run();
