[Killed] Block removal mutation
Absents/Commands/CreateAbsent/CreateAbsentCommandBodyValidator.cs:8:9
     public class CreateAbsentCommandBodyValidator : AbstractValidator<CreateAbsentCommandBody>
     {
         public CreateAbsentCommandBodyValidator()
-        {
-
-            RuleFor(x => x.StartDate).NotEmpty();
-            RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
-        }
+        {}
     }
 }

[Killed] Statement mutation
Absents/Commands/CreateAbsent/CreateAbsentCommandBodyValidator.cs:10:13
         public CreateAbsentCommandBodyValidator()
         {
 
-            RuleFor(x => x.StartDate).NotEmpty();
+            ;
             RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
         }

[Killed] Statement mutation
Absents/Commands/CreateAbsent/CreateAbsentCommandBodyValidator.cs:11:13
         {
 
             RuleFor(x => x.StartDate).NotEmpty();
-            RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
+            ;
         }
     }
