[Killed] Block removal mutation
Absents/Commands/CreateAbsent/CreateAbsentCommandValidator.cs:8:9
     public class CreateAbsentCommandValidator : AbstractValidator<CreateAbsentCommand>
     {
         public CreateAbsentCommandValidator()
-        {
-            RuleFor(x => x.UserId).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new CreateAbsentCommandBodyValidator());
-        }
+        {}
     }
 }

[Killed] Statement mutation
Absents/Commands/CreateAbsent/CreateAbsentCommandValidator.cs:9:13
     {
         public CreateAbsentCommandValidator()
         {
-            RuleFor(x => x.UserId).GreaterThan(0);
+            ;
             RuleFor(x => x.Body).SetValidator(new CreateAbsentCommandBodyValidator());
         }

[Killed] Statement mutation
Absents/Commands/CreateAbsent/CreateAbsentCommandValidator.cs:10:13
         public CreateAbsentCommandValidator()
         {
             RuleFor(x => x.UserId).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new CreateAbsentCommandBodyValidator());
+            ;
         }
     }
