[Killed] Block removal mutation
Absents/Commands/CreateAbsent/CreateAbsentHandler.cs:20:9
         /// <param name="mediator"></param>
         public CreateAbsentHandler(IAbsentRepository repository,
             IMediator mediator)
-        {
-            _repository = repository;
-            _mediator = mediator;
-
-        }
+        {}
         /// <summary>
         /// Handle create absent command

[Killed] Block removal mutation
Absents/Commands/CreateAbsent/CreateAbsentHandler.cs:33:9
         /// <returns></returns>
         /// <exception cref="ArgumentNullException"></exception>
         public async Task<CreateAbsentResponse> Handle(CreateAbsentCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var absent = new Models.Absent
-            {
-                UserId = command.UserId,
-                StartDate = command.Body.StartDate,
-                EndDate = command.Body.EndDate,
-            };
-
-            Models.Absent createdAbsent = await _repository
-                .CreateAbsentAsync(absent, cancellationToken);
-
-            var eventPublishAbsent = new AbsentLogicEvent(createdAbsent);
-            await _mediator.Publish(eventPublishAbsent, cancellationToken);
-
-            return new CreateAbsentResponse
-            {
-                Absent = absent
-            };
-        }
+        {}
     }
 }

[Killed] Block removal mutation
Absents/Commands/CreateAbsent/CreateAbsentHandler.cs:35:13
         public async Task<CreateAbsentResponse> Handle(CreateAbsentCommand command, CancellationToken cancellationToken)
         {
             if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
+            {}
 
             var absent = new Models.Absent

[Killed] Statement mutation
Absents/Commands/CreateAbsent/CreateAbsentHandler.cs:36:17
         {
             if (command is null)
             {
-                throw new ArgumentNullException(nameof(command));
+                ;
             }
 

[Survived] Object initializer mutation
Absents/Commands/CreateAbsent/CreateAbsentHandler.cs:39:26
                 throw new ArgumentNullException(nameof(command));
             }
 
-            var absent = new Models.Absent
-            {
-                UserId = command.UserId,
-                StartDate = command.Body.StartDate,
-                EndDate = command.Body.EndDate,
-            };
+            var absent = new Models.Absent
+{};
 
             Models.Absent createdAbsent = await _repository

[Killed] Statement mutation
Absents/Commands/CreateAbsent/CreateAbsentHandler.cs:50:13
                 .CreateAbsentAsync(absent, cancellationToken);
 
             var eventPublishAbsent = new AbsentLogicEvent(createdAbsent);
-            await _mediator.Publish(eventPublishAbsent, cancellationToken);
+            ;
 
             return new CreateAbsentResponse

[Killed] Object initializer mutation
Absents/Commands/CreateAbsent/CreateAbsentHandler.cs:52:20
             var eventPublishAbsent = new AbsentLogicEvent(createdAbsent);
             await _mediator.Publish(eventPublishAbsent, cancellationToken);
 
-            return new CreateAbsentResponse
-            {
-                Absent = absent
-            };
+            return new CreateAbsentResponse
+{};
         }
     }
