[Killed] Block removal mutation
Absents/Commands/DeleteAbsent/DeleteAbsentCommand.cs:11:9
         public Guid Id { get; set; }
 
         public DeleteAbsentCommand(Guid id)
-        {
-            Id = id;
-        }
+        {}
 
     }
