[Killed] Block removal mutation
Absents/Commands/DeleteAbsent/DeleteAbsentCommandValidator.cs:9:9
     public class DeleteAbsentCommandValidator : AbstractValidator<DeleteAbsentCommand>
     {
         public DeleteAbsentCommandValidator()
-        {
-            RuleFor(x => x.Id).NotEmpty();
-        }
+        {}
     }
 }

[Killed] Statement mutation
Absents/Commands/DeleteAbsent/DeleteAbsentCommandValidator.cs:10:13
     {
         public DeleteAbsentCommandValidator()
         {
-            RuleFor(x => x.Id).NotEmpty();
+            ;
         }
     }
