[Killed] Block removal mutation
Absents/Commands/DeleteAbsent/DeleteAbsentHandler.cs:28:9
         }
 
         public async Task<DeleteAbsentResponse> Handle(DeleteAbsentCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var id = command.Id;
-            var deletedAbsent = await _repository.DeleteAbsentAsync(id, cancellationToken);
-
-            var eventPublishAbsent = new AbsentLogicEvent(deletedAbsent);
-            await _mediator.Publish(eventPublishAbsent, cancellationToken);
-
-
-            return new DeleteAbsentResponse
-            {
-                Absent = deletedAbsent
-            };
-        }
+        {}
     }
 }

[Killed] Statement mutation
Absents/Commands/DeleteAbsent/DeleteAbsentHandler.cs:38:13
             var deletedAbsent = await _repository.DeleteAbsentAsync(id, cancellationToken);
 
             var eventPublishAbsent = new AbsentLogicEvent(deletedAbsent);
-            await _mediator.Publish(eventPublishAbsent, cancellationToken);
+            ;
 
 
