[Killed] Block removal mutation
Absents/Commands/EditAbsent/EditAbsentCommand.cs:11:9
         public Guid Id { get; set; }
         public EditAbsentCommandBody Body { get; set; }
         public EditAbsentCommand(Guid id, EditAbsentCommandBody body)
-        {
-            Id = id;
-            Body = body;
-        }
+        {}
     }
 }
