[Killed] Block removal mutation
Absents/Commands/EditAbsent/EditAbsentCommandBodyValidator.cs:9:9
     public class EditAbsentCommandBodyValidator : AbstractValidator<EditAbsentCommandBody>
     {
         public EditAbsentCommandBodyValidator()
-        {
-
-            RuleFor(x => x.StartDate).NotEmpty();
-            RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
-        }
+        {}
     }
 }
