[Killed] Block removal mutation
Absents/Commands/EditAbsent/EditAbsentCommandValidator.cs:9:9
     public class EditAbsentCommandValidator : AbstractValidator<EditAbsentCommand>
     {
         public EditAbsentCommandValidator()
-        {
-            RuleFor(x => x.Id).NotEmpty();
-            RuleFor(x => x.Body).SetValidator(new EditAbsentCommandBodyValidator());
-        }
+        {}
     }
 }

[Killed] Statement mutation
Absents/Commands/EditAbsent/EditAbsentCommandValidator.cs:11:13
         public EditAbsentCommandValidator()
         {
             RuleFor(x => x.Id).NotEmpty();
-            RuleFor(x => x.Body).SetValidator(new EditAbsentCommandBodyValidator());
+            ;
         }
     }
