[Killed] Block removal mutation
Absents/Commands/EditAbsent/EditAbsentHandler.cs:20:9
 
         public EditAbsentHandler(IAbsentRepository repository,
             IMediator mediator)
-        {
-            _repository = repository;
-            _mediator = mediator;
-        }
+        {}
 
         public async Task<EditAbsentResponse> Handle(EditAbsentCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
Absents/Commands/EditAbsent/EditAbsentHandler.cs:26:9
         }
 
         public async Task<EditAbsentResponse> Handle(EditAbsentCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var absent = new Models.Absent
-            {
-                Id = command.Id,
-                StartDate = command.Body.StartDate,
-                EndDate = command.Body.EndDate,
-            };
-
-            var updatedAbsent = await _repository.UpdateAbsentAsync(absent, cancellationToken);
-            var eventPublishAbsent = new AbsentLogicEvent(updatedAbsent);
-            await _mediator.Publish(eventPublishAbsent, cancellationToken);
-
-
-            return new EditAbsentResponse
-            {
-                Absent = updatedAbsent
-            };
-        }
+        {}
     }
 }

[Killed] Statement mutation
Absents/Commands/EditAbsent/EditAbsentHandler.cs:41:13
 
             var updatedAbsent = await _repository.UpdateAbsentAsync(absent, cancellationToken);
             var eventPublishAbsent = new AbsentLogicEvent(updatedAbsent);
-            await _mediator.Publish(eventPublishAbsent, cancellationToken);
+            ;
 
 
