[Killed] Block removal mutation
Absents/Queries/GetAbsentById/GetAbsentByIdCommand.cs:10:9
         public int UserId { get; set; }
 
         public GetAbsentByIdCommand(int userId)
-        {
-            UserId = userId;
-        }
+        {}
     }
 }
