[Killed] Block removal mutation
Absents/Queries/GetAbsentById/GetAbsentByIdCommandValidator.cs:8:9
     public class GetAbsentByIdCommandValidator : AbstractValidator<GetAbsentByIdCommand>
     {
         public GetAbsentByIdCommandValidator()
-        {
-            RuleFor(x => x.UserId).GreaterThan(0);
-        }
+        {}
     }
 }
