[Killed] Block removal mutation
Absents/Queries/GetAbsentById/GetAbsentByIdHandler.cs:11:9
         private readonly IAbsentRepository _repository;
 
         public GetAbsentByIdHandler(IAbsentRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<GetAbsentByIdResponse> Handle(GetAbsentByIdCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
Absents/Queries/GetAbsentById/GetAbsentByIdHandler.cs:16:9
         }
 
         public async Task<GetAbsentByIdResponse> Handle(GetAbsentByIdCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var id = command.UserId;
-            var gotListAbsent = await _repository.GetAbsentByIdAsync(id, cancellationToken);
-
-            return new GetAbsentByIdResponse
-            {
-                ListAbsent = gotListAbsent
-            };
-        }
+        {}
     }
 }
