[Killed] Block removal mutation
Absents/Queries/GetAbsent/GetAbsentCommand.cs:9:9
     {
         public Guid Id { get; set; }
         public GetAbsentCommand(Guid id)
-        {
-            Id = id;
-        }
+        {}
     }
 }
