[Killed] Block removal mutation
Absents/Queries/GetAbsent/GetAbsentCommandValidator.cs:8:9
     public class GetAbsentCommandValidator : AbstractValidator<GetAbsentCommand>
     {
         public GetAbsentCommandValidator()
-        {
-            RuleFor(x => x.Id).NotEmpty();
-        }
+        {}
     }
 }
