[Killed] Block removal mutation
Absents/Queries/GetAbsent/GetAbsentHandler.cs:14:9
         private readonly IAbsentRepository _repository;
 
         public GetAbsentHandler(IAbsentRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<GetAbsentResponse> Handle(GetAbsentCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
Absents/Queries/GetAbsent/GetAbsentHandler.cs:19:9
         }
 
         public async Task<GetAbsentResponse> Handle(GetAbsentCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var id = command.Id;
-            var gotAbsent = await _repository.GetAbsentAsync(id, cancellationToken);
-
-            return new GetAbsentResponse
-            {
-                Absent = gotAbsent
-            };
-        }
+        {}
     }
 }

[Killed] Object initializer mutation
Absents/Queries/GetAbsent/GetAbsentHandler.cs:28:20
             var id = command.Id;
             var gotAbsent = await _repository.GetAbsentAsync(id, cancellationToken);
 
-            return new GetAbsentResponse
-            {
-                Absent = gotAbsent
-            };
+            return new GetAbsentResponse
+{};
         }
     }
