[Killed] Block removal mutation
Absents/Queries/GetAllAbsent/GetAllAbsentHandler.cs:13:9
         private readonly IAbsentRepository _repository;
 
         public GetAllAbsentHandler(IAbsentRepository repository)
-        {
-            _repository = repository;
-
-        }
+        {}
 
         public async Task<GetAllAbsentResponse> Handle(GetAllAbsentCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
Absents/Queries/GetAllAbsent/GetAllAbsentHandler.cs:19:9
         }
 
         public async Task<GetAllAbsentResponse> Handle(GetAllAbsentCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var gotAbsent = await _repository.GetAllAbsentAsync(cancellationToken);
-
-            return new GetAllAbsentResponse
-            {
-                ListAbsent = gotAbsent
-            };
-        }
+        {}
     }
 }
