[Killed] Block removal mutation
ApplicationUsers/Commands/CheckInApplicationUser/CheckInApplicationUserCommand.cs:10:9
         public int Id { get; set; }
 
         public CheckInApplicationUserCommand(int id)
-        {
-            Id = id;
-        }
+        {}
     }
 }
