[Killed] Block removal mutation
ApplicationUsers/Commands/CheckInApplicationUser/CheckInApplicationUserCommandValidator.cs:8:9
     public class CheckInApplicationUserCommandValidator : AbstractValidator<CheckInApplicationUserCommand>
     {
         public CheckInApplicationUserCommandValidator()
-        {
-            RuleFor(x => x.Id).NotEmpty();
-        }
+        {}
     }
 }
