[Killed] Block removal mutation
ApplicationUsers/Commands/CheckInApplicationUser/CheckInApplicationUserHandler.cs:23:9
         }
 
         public async Task<CheckInApplicationUserResponse> Handle(CheckInApplicationUserCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            int id = command.Id;
-            var checkInUser = await _repository.CheckInApplicationUserAsync(id, cancellationToken);
-            var eventSendCheckIn = new PublishCheckInEvent(checkInUser);
-            await _mediator.Publish(eventSendCheckIn, cancellationToken);
-
-            return new CheckInApplicationUserResponse
-            {
-                ApplicationUser = checkInUser
-            };
-        }
+        {}
     }
 }

[Killed] Statement mutation
ApplicationUsers/Commands/CheckInApplicationUser/CheckInApplicationUserHandler.cs:32:13
             int id = command.Id;
             var checkInUser = await _repository.CheckInApplicationUserAsync(id, cancellationToken);
             var eventSendCheckIn = new PublishCheckInEvent(checkInUser);
-            await _mediator.Publish(eventSendCheckIn, cancellationToken);
+            ;
 
             return new CheckInApplicationUserResponse
