[Killed] Block removal mutation
ApplicationUsers/Commands/CheckOutApplicationUser/CheckOutApplicationUserCommand.cs:9:9
     {
         public int Id { get; set; }
         public CheckOutApplicationUserCommand(int id)
-        {
-            Id = id;
-        }
+        {}
     }
 }
