[Killed] Block removal mutation
ApplicationUsers/Commands/CheckOutApplicationUser/CheckOutApplicationUserCommandValidator.cs:8:9
     public class CheckOutApplicationUserCommandValidator : AbstractValidator<CheckOutApplicationUserCommand>
     {
         public CheckOutApplicationUserCommandValidator()
-        {
-            RuleFor(x => x.Id).GreaterThan(0);
-        }
+        {}
     }
 }

[Killed] Statement mutation
ApplicationUsers/Commands/CheckOutApplicationUser/CheckOutApplicationUserCommandValidator.cs:9:13
     {
         public CheckOutApplicationUserCommandValidator()
         {
-            RuleFor(x => x.Id).GreaterThan(0);
+            ;
         }
     }
