[Killed] Block removal mutation
ApplicationUsers/Commands/CheckOutApplicationUser/CheckOutApplicationUserHandler.cs:20:9
         }
 
         public async Task<CheckOutApplicationUserResponse> Handle(CheckOutApplicationUserCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-            
-            int id = command.Id;
-            var checkOutUser = await _repository.CheckOutApplicationUserAsync(id, cancellationToken);
-
-            var eventSendCheckIn = new PublishCheckInEvent(checkOutUser);
-            await _mediator.Publish(eventSendCheckIn, cancellationToken);
-
-            return new CheckOutApplicationUserResponse
-            {
-                ApplicationUser = checkOutUser
-            };
-        }
+        {}
     }
 }

[Killed] Statement mutation
ApplicationUsers/Commands/CheckOutApplicationUser/CheckOutApplicationUserHandler.cs:30:13
             var checkOutUser = await _repository.CheckOutApplicationUserAsync(id, cancellationToken);
 
             var eventSendCheckIn = new PublishCheckInEvent(checkOutUser);
-            await _mediator.Publish(eventSendCheckIn, cancellationToken);
+            ;
 
             return new CheckOutApplicationUserResponse
