[Killed] Block removal mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserCommand.cs:10:9
         public int Id { get; set; }
         public CreateApplicationUserCommandBody Body { get; set; }
         public CreateApplicationUserCommand(int id, CreateApplicationUserCommandBody body)
-        {
-            Id = id;
-            Body = body;
-        }
+        {}
     }
 }
