[Killed] Block removal mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserCommandBodyValidator.cs:9:5
 public class CreateApplicationUserCommandBodyValidator : AbstractValidator<CreateApplicationUserCommandBody>
 {
     public CreateApplicationUserCommandBodyValidator()
-    {
-
-        RuleFor(x => x.FirstName).NotEmpty();
-        RuleFor(x => x.OfficeLocation).GreaterThan(0);
-    }
+    {}
 }
 

[Killed] Statement mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserCommandBodyValidator.cs:11:9
     public CreateApplicationUserCommandBodyValidator()
     {
 
-        RuleFor(x => x.FirstName).NotEmpty();
+        ;
         RuleFor(x => x.OfficeLocation).GreaterThan(0);
     }

[Killed] Statement mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserCommandBodyValidator.cs:12:9
     {
 
         RuleFor(x => x.FirstName).NotEmpty();
-        RuleFor(x => x.OfficeLocation).GreaterThan(0);
+        ;
     }
 }
