[Killed] Block removal mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserCommandValidator.cs:10:9
     public class CreateApplicationUserCommandValidator : AbstractValidator<CreateApplicationUserCommand>
     {
         public CreateApplicationUserCommandValidator()
-        {
-            RuleFor(x => x.Id).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new CreateApplicationUserCommandBodyValidator());
-        }
+        {}
     }
 }

[Killed] Statement mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserCommandValidator.cs:12:13
         public CreateApplicationUserCommandValidator()
         {
             RuleFor(x => x.Id).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new CreateApplicationUserCommandBodyValidator());
+            ;
         }
     }
