[Killed] Block removal mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserHandler.cs:20:9
         }
 
         public async Task<CreateApplicationUserResponse> Handle(CreateApplicationUserCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var user = new Models.ApplicationUser
-            {
-                Id = command.Id,
-                FirstName = command.Body.FirstName,
-                OfficeLocation = command.Body.OfficeLocation
-            };
-
-            var createdUser = await _repository.CreateApplicationUserAsync(user, cancellationToken);
-
-            var eventUnsLogic = new CreateApplicationUserLogicEvent(createdUser);
-            await _mediator.Publish(eventUnsLogic, cancellationToken);
-
-            return new CreateApplicationUserResponse
-            {
-                ApplicationUser = createdUser
-            };
-        }
+        {}
     }
 }

[Killed] Statement mutation
ApplicationUsers/Commands/CreateApplicationUser/CreateApplicationUserHandler.cs:36:13
             var createdUser = await _repository.CreateApplicationUserAsync(user, cancellationToken);
 
             var eventUnsLogic = new CreateApplicationUserLogicEvent(createdUser);
-            await _mediator.Publish(eventUnsLogic, cancellationToken);
+            ;
 
             return new CreateApplicationUserResponse
