[Killed] Block removal mutation
ApplicationUsers/Commands/DeleteApplicationUser/DeleteApplicationUserCommand.cs:10:9
         public int Id { get; set; }
 
         public DeleteApplicationUserCommand(int id)
-        {
-            Id = id;
-        }
+        {}
     }
 }
