[Killed] Block removal mutation
ApplicationUsers/Commands/DeleteApplicationUser/DeleteApplicationUserCommandValidator.cs:8:9
     public class DeleteApplicationUserCommandValidator : AbstractValidator<DeleteApplicationUserCommand>
     {
         public DeleteApplicationUserCommandValidator()
-        {
-            RuleFor(x => x.Id).GreaterThan(0);
-        }
+        {}
     }
 }
