[Killed] Statement mutation
ApplicationUsers/Commands/DeleteApplicationUser/DeleteApplicationUserHandler.cs:44:13
             var usersEachLocation = responseGetOfficeLocation.UserEachLocation;
 
             var eventUnsLogic = new DeleteApplicationUserLogicEvent(deletedUser,usersEachLocation);
-            await _mediator.Publish(eventUnsLogic, cancellationToken);
+            ;
 
             return new DeleteApplicationUserResponse
