[Killed] Block removal mutation
ApplicationUsers/Commands/EditApplicationUser/EditApplicationUserCommand.cs:10:9
         public int Id { get; set; }
         public EditApplicationUserCommandBody Body { get; set; }
         public EditApplicationUserCommand(int id, EditApplicationUserCommandBody body)
-        {
-            Id = id;
-            Body = body;
-        }
+        {}
     }
 }
