[Killed] Block removal mutation
ApplicationUsers/Commands/EditApplicationUser/EditApplicationUserCommandBodyValidator.cs:9:5
 public class EditApplicationUserCommandBodyValidator : AbstractValidator<EditApplicationUserCommandBody>
 {
     public EditApplicationUserCommandBodyValidator()
-    {
-
-        RuleFor(x => x.FirstName).NotEmpty();
-        RuleFor(x => x.OfficeLocation).GreaterThan(0);
-    }
+    {}
 }
 
