[Killed] Block removal mutation
ApplicationUsers/Commands/EditApplicationUser/EditApplicationUserCommandValidator.cs:9:9
     public class EditApplicationUserCommandValidator : AbstractValidator<EditApplicationUserCommand>
     {
         public EditApplicationUserCommandValidator()
-        {
-            RuleFor(x => x.Id).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new EditApplicationUserCommandBodyValidator());
-        }
+        {}
     }
 }

[Killed] Statement mutation
ApplicationUsers/Commands/EditApplicationUser/EditApplicationUserCommandValidator.cs:11:13
         public EditApplicationUserCommandValidator()
         {
             RuleFor(x => x.Id).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new EditApplicationUserCommandBodyValidator());
+            ;
         }
     }
