[Killed] Block removal mutation
ApplicationUsers/Commands/EditApplicationUser/EditApplicationUserHandler.cs:27:9
         }
 
         public async Task<EditApplicationUserResponse> Handle(EditApplicationUserCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var user = new Models.ApplicationUser
-            {
-                Id = command.Id,
-                FirstName = command.Body.FirstName,
-                OfficeLocation = command.Body.OfficeLocation
-            };
-
-            //False: Track reference
-            var oldUser = await _repository.GetApplicationUserAsync(user.Id, false, cancellationToken);
-            var newUser = await _repository.UpdateApplicationUserAsync(user, cancellationToken);
-
-            var eventUnsLogic = new EditApplicationUserLogicEvent(newUser,oldUser);
-            await _mediator.Publish(eventUnsLogic, cancellationToken);
-
-            return new EditApplicationUserResponse
-            {
-                ApplicationUser = newUser
-            };
-        }
+        {}
     }
 }

[Killed] Boolean mutation
ApplicationUsers/Commands/EditApplicationUser/EditApplicationUserHandler.cs:41:78
             };
 
             //False: Track reference
-            var oldUser = await _repository.GetApplicationUserAsync(user.Id, false, cancellationToken);
+            var oldUser = await _repository.GetApplicationUserAsync(user.Id, true, cancellationToken);
             var newUser = await _repository.UpdateApplicationUserAsync(user, cancellationToken);
 

[Killed] Statement mutation
ApplicationUsers/Commands/EditApplicationUser/EditApplicationUserHandler.cs:45:13
             var newUser = await _repository.UpdateApplicationUserAsync(user, cancellationToken);
 
             var eventUnsLogic = new EditApplicationUserLogicEvent(newUser,oldUser);
-            await _mediator.Publish(eventUnsLogic, cancellationToken);
+            ;
 
             return new EditApplicationUserResponse
