[Killed] Block removal mutation
ApplicationUsers/Queries/GetAllApplicationUser/GetAllApplicationUserHandler.cs:13:9
         private readonly IApplicationUsersRepository _repository;
 
         public GetAllApplicationUserHandler(IApplicationUsersRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<GetAllApplicationUserResponse> Handle(GetAllApplicationUserCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
ApplicationUsers/Queries/GetAllApplicationUser/GetAllApplicationUserHandler.cs:18:9
         }
 
         public async Task<GetAllApplicationUserResponse> Handle(GetAllApplicationUserCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var gotUsers = await _repository.GetAllApplicationUserAsync(cancellationToken);
-
-            return new GetAllApplicationUserResponse
-            {
-                listApplicationUser = gotUsers
-            };
-        }
+        {}
     }
 }
