[Killed] Block removal mutation
ApplicationUsers/Queries/GetAllLocation/GetAllLocationHandler.cs:13:9
         private readonly IApplicationUsersRepository _repository;
 
         public GetAllLocationHandler(IApplicationUsersRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<GetAllLocationResponse> Handle(GetAllLocationCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
ApplicationUsers/Queries/GetAllLocation/GetAllLocationHandler.cs:18:9
         }
 
         public async Task<GetAllLocationResponse> Handle(GetAllLocationCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-            var listUsersEachLocation = await _repository.GetAllLocationsAsync(cancellationToken);
-
-            return new GetAllLocationResponse
-            {
-                ListUserEachLocation = listUsersEachLocation
-            };
-        }
+        {}
     }
 }
