[Killed] Block removal mutation
ApplicationUsers/Queries/GetApplicationUser/GetApplicationUserCommand.cs:10:9
         public int Id { get; set; }
 
         public GetApplicationUserCommand(int id)
-        {
-            Id = id;
-        }
+        {}
     }
 }
