[Killed] Block removal mutation
ApplicationUsers/Queries/GetApplicationUser/GetApplicationUserCommandValidator.cs:8:9
     public class GetApplicationUserCommandValidator : AbstractValidator<GetApplicationUserCommand>
     {
         public GetApplicationUserCommandValidator()
-        {
-            RuleFor(x => x.Id).GreaterThan(0);
-        }
+        {}
     }
 }
