[Killed] Block removal mutation
ApplicationUsers/Queries/GetApplicationUser/GetApplicationUserHandler.cs:13:9
         private readonly IApplicationUsersRepository _repository;
 
         public GetApplicationUserHandler(IApplicationUsersRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<GetApplicationUserResponse> Handle(GetApplicationUserCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
ApplicationUsers/Queries/GetApplicationUser/GetApplicationUserHandler.cs:18:9
         }
 
         public async Task<GetApplicationUserResponse> Handle(GetApplicationUserCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            int id = command.Id;
-            var getUser = await _repository.GetApplicationUserAsync(id, cancellationToken);
-
-            return new GetApplicationUserResponse
-            {
-                ApplicationUser = getUser
-            };
-        }
+        {}
     }
 }
