[Killed] Block removal mutation
ApplicationUsers/Queries/GetLocation/GetLocationCommand.cs:9:9
     {
         public int OfficeLocation { get; set; }
         public GetLocationCommand(int officeLocation)
-        {
-            OfficeLocation = officeLocation;
-        }
+        {}
     }
 }
