[Survived] Block removal mutation
ApplicationUsers/Queries/GetLocation/GetLocationCommandValidator.cs:8:9
     public class GetLocationCommandValidator : AbstractValidator<GetLocationCommand>
     {
         public GetLocationCommandValidator()
-        {
-            RuleFor(x => x.OfficeLocation).GreaterThan(0);
-        }
+        {}
     }
 }

[Survived] Statement mutation
ApplicationUsers/Queries/GetLocation/GetLocationCommandValidator.cs:9:13
     {
         public GetLocationCommandValidator()
         {
-            RuleFor(x => x.OfficeLocation).GreaterThan(0);
+            ;
         }
     }
