[Killed] Block removal mutation
ApplicationUsers/Queries/GetLocation/GetLocationHandler.cs:13:9
         private readonly IApplicationUsersRepository _repository;
 
         public GetLocationHandler(IApplicationUsersRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<GetLocationResponse> Handle(GetLocationCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
ApplicationUsers/Queries/GetLocation/GetLocationHandler.cs:18:9
         }
 
         public async Task<GetLocationResponse> Handle(GetLocationCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            int officeLocation = command.OfficeLocation;
-            UsersEachLocation usersEachLocation = await _repository.GetLocationAsync(officeLocation, cancellationToken);
-
-            return new GetLocationResponse
-            {
-                UserEachLocation = usersEachLocation
-            };
-        }
+        {}
     }
 }
