[Killed] Block removal mutation
Application/EventHandlers/AbsentLogic/AbsentLogicEventHandler.cs:20:9
         public AbsentLogicEventHandler(IUnsService unsService
             , IMediator mediator
             , ITimerService timerService)
-        {
-            _unsService = unsService;
-            _mediator = mediator;
-            _timerService = timerService;
-        }
+        {}
 
         public async Task Handle(AbsentLogicEvent notification, CancellationToken cancellationToken)

[Killed] Block removal mutation
Application/EventHandlers/AbsentLogic/AbsentLogicEventHandler.cs:27:9
         }
 
         public async Task Handle(AbsentLogicEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            Models.Absent absent = notification.Absent;
-
-            var commandGetApplicationUser = new GetApplicationUserCommand(absent.UserId);
-            var gotApplicationUser = await _mediator.Send(commandGetApplicationUser, cancellationToken);
-
-            var commandGetAllAbsent = new GetAllAbsentCommand();
-            var gotAllAbsentUsers = await _mediator.Send(commandGetAllAbsent, cancellationToken);
-
-            await _unsService.CheckTodayAbsentsAsync(gotAllAbsentUsers.ListAbsent, cancellationToken);
-
-            var eventPublishWorkPattern = new PublishWorkPatternEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
-
-            await _timerService.ReinitializeTimersAsync(gotApplicationUser.ApplicationUser, cancellationToken);
-
-        }
+        {}
     }
 }

[Killed] Block removal mutation
Application/EventHandlers/AbsentLogic/AbsentLogicEventHandler.cs:29:13
         public async Task Handle(AbsentLogicEvent notification, CancellationToken cancellationToken)
         {
             if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
+            {}
 
             Models.Absent absent = notification.Absent;

[Killed] Statement mutation
Application/EventHandlers/AbsentLogic/AbsentLogicEventHandler.cs:30:17
         {
             if (notification is null)
             {
-                throw new ArgumentNullException(nameof(notification));
+                ;
             }
 

[Killed] Statement mutation
Application/EventHandlers/AbsentLogic/AbsentLogicEventHandler.cs:41:13
             var commandGetAllAbsent = new GetAllAbsentCommand();
             var gotAllAbsentUsers = await _mediator.Send(commandGetAllAbsent, cancellationToken);
 
-            await _unsService.CheckTodayAbsentsAsync(gotAllAbsentUsers.ListAbsent, cancellationToken);
+            ;
 
             var eventPublishWorkPattern = new PublishWorkPatternEvent(gotApplicationUser.ApplicationUser);

[Killed] Statement mutation
Application/EventHandlers/AbsentLogic/AbsentLogicEventHandler.cs:44:13
             await _unsService.CheckTodayAbsentsAsync(gotAllAbsentUsers.ListAbsent, cancellationToken);
 
             var eventPublishWorkPattern = new PublishWorkPatternEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
+            ;
 
             await _timerService.ReinitializeTimersAsync(gotApplicationUser.ApplicationUser, cancellationToken);

[Killed] Statement mutation
Application/EventHandlers/AbsentLogic/AbsentLogicEventHandler.cs:46:13
             var eventPublishWorkPattern = new PublishWorkPatternEvent(gotApplicationUser.ApplicationUser);
             await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
 
-            await _timerService.ReinitializeTimersAsync(gotApplicationUser.ApplicationUser, cancellationToken);
+            ;
 
         }
