[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/DeleteTopicApplicationUserEventHandler.cs:13:9
     {
         private readonly IUnsService _unsService;
         public DeleteTopicApplicationUserEventHandler(IUnsService unsService)
-        {
-            _unsService = unsService;
-        }
+        {}
         public async Task Handle(DeleteTopicApplicationUserEvent notification, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/DeleteTopicApplicationUserEventHandler.cs:17:9
             _unsService = unsService;
         }
         public async Task Handle(DeleteTopicApplicationUserEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _unsService.DeleteTopicApplicationUserAsync(applicationUser, cancellationToken);
-        }
+        {}
     }
 }

[Killed] Statement mutation
Application/EventHandlers/UnsEventHandlers/DeleteTopicApplicationUserEventHandler.cs:24:13
             }
 
             Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _unsService.DeleteTopicApplicationUserAsync(applicationUser, cancellationToken);
+            ;
         }
     }
