[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/PublishCheckInEventHandler.cs:20:9
         private readonly IUnsService _unsService;
 
         public PublishCheckInEventHandler(IUnsService unsService)
-        {
-            _unsService = unsService;
-        }
+        {}
 
         public async Task Handle(PublishCheckInEvent notification, CancellationToken cancellationToken)

[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/PublishCheckInEventHandler.cs:25:9
         }
 
         public async Task Handle(PublishCheckInEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            var now = DateTime.UtcNow;
-            Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _unsService.PublishCheckInAsync(applicationUser,now, cancellationToken);
-        }
+        {}
 
 

[Killed] Statement mutation
Application/EventHandlers/UnsEventHandlers/PublishCheckInEventHandler.cs:33:13
 
             var now = DateTime.UtcNow;
             Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _unsService.PublishCheckInAsync(applicationUser,now, cancellationToken);
+            ;
         }
 
