[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/PublishLocationEventHandler.cs:19:9
         private readonly IUnsService _unsService;
 
         public PublishLocationEventHandler(IUnsService unsService)
-        {
-            _unsService = unsService;
-        }
+        {}
 
         public async Task Handle(PublishLocationEvent notification, CancellationToken cancellationToken)

[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/PublishLocationEventHandler.cs:24:9
         }
 
         public async Task Handle(PublishLocationEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            UsersEachLocation usersEachLocation = notification.UsersEachLocation;
-            int officeLocation = notification.OfficeLocation;
-
-
-            await _unsService.PublishLocationAsync(usersEachLocation, officeLocation, cancellationToken);
-        }
+        {}
 
 

[Killed] Statement mutation
Application/EventHandlers/UnsEventHandlers/PublishLocationEventHandler.cs:34:13
             int officeLocation = notification.OfficeLocation;
 
 
-            await _unsService.PublishLocationAsync(usersEachLocation, officeLocation, cancellationToken);
+            ;
         }
 
