[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/PublishWorkPatternEventHandler.cs:13:13
             private readonly IUnsService _unsService;
 
             public PublishWorkPatternEventHandler(IUnsService unsService)
-            {
-                _unsService = unsService;
-            }
+            {}
 
             public async Task Handle(PublishWorkPatternEvent notification, CancellationToken cancellationToken)

[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/PublishWorkPatternEventHandler.cs:18:13
             }
 
             public async Task Handle(PublishWorkPatternEvent notification, CancellationToken cancellationToken)
-            {
-                if (notification is null)
-                {
-                    throw new ArgumentNullException(nameof(notification));
-                }
-
-                Models.ApplicationUser applicationUser = notification.ApplicationUser;
-                await _unsService.CallListWorkPatternAsync(applicationUser, cancellationToken);
-            }
+            {}
     }
 }

[Killed] Statement mutation
Application/EventHandlers/UnsEventHandlers/PublishWorkPatternEventHandler.cs:25:17
                 }
 
                 Models.ApplicationUser applicationUser = notification.ApplicationUser;
-                await _unsService.CallListWorkPatternAsync(applicationUser, cancellationToken);
+                ;
             }
     }
