[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/StopTimerEventHandler.cs:12:9
     {
         private readonly ITimerService _timerService;
         public StopTimerEventHandler(ITimerService timerService)
-        {
-            _timerService = timerService;
-        }
+        {}
         public async Task Handle(StopTimerEvent notification, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/StopTimerEventHandler.cs:16:9
             _timerService = timerService;
         }
         public async Task Handle(StopTimerEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _timerService.ReinitializeTimersAsync(applicationUser, cancellationToken);
-        }
+        {}
     }
 }

[Killed] Statement mutation
Application/EventHandlers/UnsEventHandlers/StopTimerEventHandler.cs:23:13
             }
 
             Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _timerService.ReinitializeTimersAsync(applicationUser, cancellationToken);
+            ;
         }
     }
