[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/UpdateTimerEvendHander.cs:12:9
     {
         private readonly ITimerService _timerService;
         public UpdateTimerEventHandler(ITimerService timerService)
-        {
-            _timerService = timerService;
-        }
+        {}
         public async Task Handle(UpdateTimerEvent notification, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
Application/EventHandlers/UnsEventHandlers/UpdateTimerEvendHander.cs:16:9
             _timerService = timerService;
         }
         public async Task Handle(UpdateTimerEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _timerService.CalculateDelayAsync(applicationUser,cancellationToken);
-        }
+        {}
 
 

[Killed] Statement mutation
Application/EventHandlers/UnsEventHandlers/UpdateTimerEvendHander.cs:23:13
             }
 
             Models.ApplicationUser applicationUser = notification.ApplicationUser;
-            await _timerService.CalculateDelayAsync(applicationUser,cancellationToken);
+            ;
         }
 
