[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateApplicationUserUnsLogicEventHandler.cs:12:9
     {
         private readonly IMediator _mediator;
         public CreateApplicationUserUnsLogicEventHandler(IMediator mediator)
-        {
-            _mediator = mediator;
-        }
+        {}
         public async Task Handle(CreateApplicationUserLogicEvent notification, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateApplicationUserUnsLogicEventHandler.cs:16:9
             _mediator = mediator;
         }
         public async Task Handle(CreateApplicationUserLogicEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            Models.ApplicationUser createdUser = notification.ApplicationUser;
-
-            var eventSendCheckIn = new PublishCheckInEvent(createdUser);
-            await _mediator.Publish(eventSendCheckIn, cancellationToken);
-
-            var eventPublishWorkPattern = new PublishWorkPatternEvent(createdUser);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
-
-            var commandGetOfficeLocation = new GetLocationCommand(createdUser.OfficeLocation);
-            var responseGetOfficeLocation = await _mediator.Send(commandGetOfficeLocation, cancellationToken);
-
-            var eventPublishLocation = new PublishLocationEvent(responseGetOfficeLocation.UserEachLocation, responseGetOfficeLocation.UserEachLocation.OfficeLocation);
-            await _mediator.Publish(eventPublishLocation, cancellationToken);
-
-            var eventStopTimer = new StopTimerEvent(createdUser);
-            await _mediator.Publish(eventStopTimer, cancellationToken);
-        }
+        {}
     }
 }

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateApplicationUserUnsLogicEventHandler.cs:25:13
             Models.ApplicationUser createdUser = notification.ApplicationUser;
 
             var eventSendCheckIn = new PublishCheckInEvent(createdUser);
-            await _mediator.Publish(eventSendCheckIn, cancellationToken);
+            ;
 
             var eventPublishWorkPattern = new PublishWorkPatternEvent(createdUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateApplicationUserUnsLogicEventHandler.cs:28:13
             await _mediator.Publish(eventSendCheckIn, cancellationToken);
 
             var eventPublishWorkPattern = new PublishWorkPatternEvent(createdUser);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
+            ;
 
             var commandGetOfficeLocation = new GetLocationCommand(createdUser.OfficeLocation);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateApplicationUserUnsLogicEventHandler.cs:34:13
             var responseGetOfficeLocation = await _mediator.Send(commandGetOfficeLocation, cancellationToken);
 
             var eventPublishLocation = new PublishLocationEvent(responseGetOfficeLocation.UserEachLocation, responseGetOfficeLocation.UserEachLocation.OfficeLocation);
-            await _mediator.Publish(eventPublishLocation, cancellationToken);
+            ;
 
             var eventStopTimer = new StopTimerEvent(createdUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateApplicationUserUnsLogicEventHandler.cs:37:13
             await _mediator.Publish(eventPublishLocation, cancellationToken);
 
             var eventStopTimer = new StopTimerEvent(createdUser);
-            await _mediator.Publish(eventStopTimer, cancellationToken);
+            ;
         }
     }
