[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateWorkPatternUnsLogicEventHandler.cs:14:9
     {
         private readonly IMediator _mediator;
         public CreateWorkPatternUnsLogicEventHandler(IMediator mediator)
-        {
-            _mediator = mediator;
-        }
+        {}
         public async Task Handle(CreateWorkPatternLogicEvent notification, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateWorkPatternUnsLogicEventHandler.cs:18:9
             _mediator = mediator;
         }
         public async Task Handle(CreateWorkPatternLogicEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            WorkPattern createdWorkPattern = notification.WorkPattern;
-
-            var commandGetApplicationUser = new GetApplicationUserCommand(createdWorkPattern.UserId);
-            var gotApplicationUser = await _mediator.Send(commandGetApplicationUser, cancellationToken);
-
-            var eventPublishWorkPattern = new PublishWorkPatternEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
-
-            var eventStopTimer = new StopTimerEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventStopTimer, cancellationToken);
-        }      
+        {}      
 
     }

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/CreateWorkPatternUnsLogicEventHandler.cs:33:13
             await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
 
             var eventStopTimer = new StopTimerEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventStopTimer, cancellationToken);
+            ;
         }      
 
