[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteApplicationUserUnsLogicEventHandler .cs:14:9
     {
         private readonly IMediator _mediator;
         public DeleteApplicationUserUnsLogicEventHandler(IMediator mediator)
-        {
-            _mediator = mediator;
-        }
+        {}
         public async Task Handle(DeleteApplicationUserLogicEvent notification, CancellationToken cancellationToken)
         {

[Killed] Equality mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteApplicationUserUnsLogicEventHandler .cs:27:17
             Models.ApplicationUser deletedUser = notification.ApplicationUser;
             UsersEachLocation usersEachLocation = notification.UsersEachLocation;
 
-            if (deletedUser != null)
+            if (deletedUser == null)
             {
 

[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteApplicationUserUnsLogicEventHandler .cs:28:13
             UsersEachLocation usersEachLocation = notification.UsersEachLocation;
 
             if (deletedUser != null)
-            {
-
-                var eventDeleteTopicApplicationUser = new DeleteTopicApplicationUserEvent(deletedUser);
-                await _mediator.Publish(eventDeleteTopicApplicationUser, cancellationToken);
-
-                if (usersEachLocation is not null)
-                {
-                    var officeLocation= usersEachLocation.OfficeLocation;
-
-                    var eventPublishLocation = new PublishLocationEvent(usersEachLocation, officeLocation);
-                    await _mediator.Publish(eventPublishLocation, cancellationToken);
-                }
-
-                var eventDeleteTimer = new RemoveTimerEvent(deletedUser);
-                await _mediator.Publish(eventDeleteTimer, cancellationToken);
-            }
+            {}
         }
 

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteApplicationUserUnsLogicEventHandler .cs:31:17
             {
 
                 var eventDeleteTopicApplicationUser = new DeleteTopicApplicationUserEvent(deletedUser);
-                await _mediator.Publish(eventDeleteTopicApplicationUser, cancellationToken);
+                ;
 
                 if (usersEachLocation is not null)

[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteApplicationUserUnsLogicEventHandler .cs:34:17
                 await _mediator.Publish(eventDeleteTopicApplicationUser, cancellationToken);
 
                 if (usersEachLocation is not null)
-                {
-                    var officeLocation= usersEachLocation.OfficeLocation;
-
-                    var eventPublishLocation = new PublishLocationEvent(usersEachLocation, officeLocation);
-                    await _mediator.Publish(eventPublishLocation, cancellationToken);
-                }
+                {}
 
                 var eventDeleteTimer = new RemoveTimerEvent(deletedUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteApplicationUserUnsLogicEventHandler .cs:38:21
                     var officeLocation= usersEachLocation.OfficeLocation;
 
                     var eventPublishLocation = new PublishLocationEvent(usersEachLocation, officeLocation);
-                    await _mediator.Publish(eventPublishLocation, cancellationToken);
+                    ;
                 }
 

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteApplicationUserUnsLogicEventHandler .cs:42:17
                 }
 
                 var eventDeleteTimer = new RemoveTimerEvent(deletedUser);
-                await _mediator.Publish(eventDeleteTimer, cancellationToken);
+                ;
             }
         }
