[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteWorkPatternUnsLogicEventHandler.cs:13:9
     {
         private readonly IMediator _mediator;
         public DeleteWorkPatternUnsLogicEventHandler(IMediator mediator)
-        {
-            _mediator = mediator;
-        }
+        {}
         public async Task Handle(DeleteWorkPatternLogicEvent notification, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/DeleteWorkPatternUnsLogicEventHandler.cs:17:9
             _mediator = mediator;
         }
         public async Task Handle(DeleteWorkPatternLogicEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            WorkPattern deletedWorkPattern = notification.WorkPattern;
-
-            var commandGetApplicationUser = new GetApplicationUserCommand(deletedWorkPattern.UserId);
-            var gotApplicationUser = await _mediator.Send(commandGetApplicationUser, cancellationToken);
-
-            var eventPublishWorkPattern = new PublishWorkPatternEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
-
-            var eventStopTimer = new StopTimerEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventStopTimer, cancellationToken);
-        }
+        {}
 
         
