[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:14:9
     {
         private readonly IMediator _mediator;
         public EditApplicationUserUnsLogicEventHandler(IMediator mediator)
-        {
-            _mediator = mediator;
-        }
+        {}
         public async Task Handle(EditApplicationUserLogicEvent notification, CancellationToken cancellationToken)
         {

[Killed] Equality mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:28:17
             Models.ApplicationUser oldUser = notification.OldApplicationUser;
             var oldOfficeLocation = oldUser.OfficeLocation;
 
-            if (newUser != null)
+            if (newUser == null)
             {
                 var eventDeleteOldTopic = new DeleteTopicApplicationUserEvent(oldUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:31:17
             if (newUser != null)
             {
                 var eventDeleteOldTopic = new DeleteTopicApplicationUserEvent(oldUser);
-                await _mediator.Publish(eventDeleteOldTopic, cancellationToken);
+                ;
 
                 var commandGetOldOfficeLocation = new GetLocationCommand(oldOfficeLocation);

[Killed] Equality mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:36:21
                 var commandGetOldOfficeLocation = new GetLocationCommand(oldOfficeLocation);
                 var responseGetOldOfficeLocation = await _mediator.Send(commandGetOldOfficeLocation, cancellationToken);
 
-                if (responseGetOldOfficeLocation.UserEachLocation != null)
+                if (responseGetOldOfficeLocation.UserEachLocation == null)
                 {
                     var eventPublishOldLocation = new PublishLocationEvent(responseGetOldOfficeLocation.UserEachLocation, oldOfficeLocation);

[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:37:17
                 var responseGetOldOfficeLocation = await _mediator.Send(commandGetOldOfficeLocation, cancellationToken);
 
                 if (responseGetOldOfficeLocation.UserEachLocation != null)
-                {
-                    var eventPublishOldLocation = new PublishLocationEvent(responseGetOldOfficeLocation.UserEachLocation, oldOfficeLocation);
-                    await _mediator.Publish(eventPublishOldLocation, cancellationToken);
-                }
+                {}
 
                 var eventDeleteNewTopic = new DeleteTopicApplicationUserEvent(newUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:39:21
                 if (responseGetOldOfficeLocation.UserEachLocation != null)
                 {
                     var eventPublishOldLocation = new PublishLocationEvent(responseGetOldOfficeLocation.UserEachLocation, oldOfficeLocation);
-                    await _mediator.Publish(eventPublishOldLocation, cancellationToken);
+                    ;
                 }
 

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:43:17
                 }
 
                 var eventDeleteNewTopic = new DeleteTopicApplicationUserEvent(newUser);
-                await _mediator.Publish(eventDeleteNewTopic, cancellationToken);
+                ;
 
                 var commandGetNewOfficeLocation = new GetLocationCommand(newUser.OfficeLocation);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:48:17
                 var commandGetNewOfficeLocation = new GetLocationCommand(newUser.OfficeLocation);
                 var responseGetNewOfficeLocation = await _mediator.Send(commandGetNewOfficeLocation, cancellationToken);
                 var eventPublishNewLocation = new PublishLocationEvent(responseGetNewOfficeLocation.UserEachLocation, responseGetNewOfficeLocation.UserEachLocation.OfficeLocation);
-                await _mediator.Publish(eventPublishNewLocation, cancellationToken);
+                ;
 
                 var eventSendCheckIn = new PublishCheckInEvent(newUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:51:17
                 await _mediator.Publish(eventPublishNewLocation, cancellationToken);
 
                 var eventSendCheckIn = new PublishCheckInEvent(newUser);
-                await _mediator.Publish(eventSendCheckIn, cancellationToken);
+                ;
 
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(newUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:54:17
                 await _mediator.Publish(eventSendCheckIn, cancellationToken);
 
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(newUser);
-                await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
+                ;
 
                 var eventStopTimer = new StopTimerEvent(newUser);

[Killed] Statement mutation
Application/EventHandlers/UnsLogicEventHandlers/EditApplicationUserUnsLogicEventHandler.cs:57:17
                 await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
 
                 var eventStopTimer = new StopTimerEvent(newUser);
-                await _mediator.Publish(eventStopTimer, cancellationToken);
+                ;
 
             }
