[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/EditWorkPatternUnsLogicEventHandler.cs:14:9
     {
         private readonly IMediator _mediator;
         public EditWorkPatternUnsLogicEventHandler(IMediator mediator)
-        {
-            _mediator = mediator;
-        }
+        {}
         public async Task Handle(EditWorkPatternLogicEvent notification, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
Application/EventHandlers/UnsLogicEventHandlers/EditWorkPatternUnsLogicEventHandler.cs:18:9
             _mediator = mediator;
         }
         public async Task Handle(EditWorkPatternLogicEvent notification, CancellationToken cancellationToken)
-        {
-            if (notification is null)
-            {
-                throw new ArgumentNullException(nameof(notification));
-            }
-
-            WorkPattern updatedWorkPattern = notification.WorkPattern;
-
-            var commandGetApplicationUser= new GetApplicationUserCommand(updatedWorkPattern.UserId);
-            var gotApplicationUser = await _mediator.Send(commandGetApplicationUser, cancellationToken);
-
-            var eventPublishWorkPattern = new PublishWorkPatternEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
-
-            var eventStopTimer = new StopTimerEvent(gotApplicationUser.ApplicationUser);
-            await _mediator.Publish(eventStopTimer, cancellationToken);
-        }
+        {}
 
         
