[Killed] Block removal mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommand.cs:16:13
             public int UserId { get; set; }
             public CreateWorkPatternCommandBody Body { get; set; }
             public CreateWorkPatternCommand(int id, CreateWorkPatternCommandBody body)
-            {
-                UserId = id;
-                Body = body;
-            }
+            {}
 
         }
