[Killed] Block removal mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:9:5
 public class CreateWorkPatternCommandBodyValidator : AbstractValidator<CreateWorkPatternCommandBody>
 {
     public CreateWorkPatternCommandBodyValidator()
-    {
-
-        RuleFor(x => x.StartDate).NotEmpty();
-        RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
-        RuleFor(x => x.Parts).NotEmpty();
-        RuleForEach(x => x.Parts)
-            .SetValidator(new WorkPatternPartValidator());
-    }   
+    {}   
 }
 public class WorkPatternPartValidator : AbstractValidator<WorkPatternPart>

[Survived] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:13:9
 
         RuleFor(x => x.StartDate).NotEmpty();
         RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
-        RuleFor(x => x.Parts).NotEmpty();
+        ;
         RuleForEach(x => x.Parts)
             .SetValidator(new WorkPatternPartValidator());

[Survived] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:14:9
         RuleFor(x => x.StartDate).NotEmpty();
         RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
         RuleFor(x => x.Parts).NotEmpty();
-        RuleForEach(x => x.Parts)
-            .SetValidator(new WorkPatternPartValidator());
+        ;
     }   
 }

[Killed] Block removal mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:21:5
 public class WorkPatternPartValidator : AbstractValidator<WorkPatternPart>
 {
     public WorkPatternPartValidator()
-    {
-        RuleFor(x => x.StartTime).GreaterThanOrEqualTo(TimeSpan.Zero);
-        RuleFor(x => x.EndTime).GreaterThan(x => x.StartTime);
-        RuleFor(x => x.EndTime).LessThan(TimeSpan.FromDays(1));
-        RuleFor(x => x.Day).NotEmpty();
-    }
+    {}
 }

[Killed] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:22:9
 {
     public WorkPatternPartValidator()
     {
-        RuleFor(x => x.StartTime).GreaterThanOrEqualTo(TimeSpan.Zero);
+        ;
         RuleFor(x => x.EndTime).GreaterThan(x => x.StartTime);
         RuleFor(x => x.EndTime).LessThan(TimeSpan.FromDays(1));

[Killed] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:23:9
     public WorkPatternPartValidator()
     {
         RuleFor(x => x.StartTime).GreaterThanOrEqualTo(TimeSpan.Zero);
-        RuleFor(x => x.EndTime).GreaterThan(x => x.StartTime);
+        ;
         RuleFor(x => x.EndTime).LessThan(TimeSpan.FromDays(1));
         RuleFor(x => x.Day).NotEmpty();

[Killed] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:24:9
     {
         RuleFor(x => x.StartTime).GreaterThanOrEqualTo(TimeSpan.Zero);
         RuleFor(x => x.EndTime).GreaterThan(x => x.StartTime);
-        RuleFor(x => x.EndTime).LessThan(TimeSpan.FromDays(1));
+        ;
         RuleFor(x => x.Day).NotEmpty();
     }

[Killed] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandBodyValidator.cs:25:9
         RuleFor(x => x.StartTime).GreaterThanOrEqualTo(TimeSpan.Zero);
         RuleFor(x => x.EndTime).GreaterThan(x => x.StartTime);
         RuleFor(x => x.EndTime).LessThan(TimeSpan.FromDays(1));
-        RuleFor(x => x.Day).NotEmpty();
+        ;
     }
 }
