[Killed] Block removal mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandValidator.cs:8:9
     public class CreateWorkPatternCommandValidator : AbstractValidator<CreateWorkPatternCommand>
     {
         public CreateWorkPatternCommandValidator()
-        {
-            RuleFor(x => x.UserId).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new CreateWorkPatternCommandBodyValidator());
-        }
+        {}
     }
 }

[Killed] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternCommandValidator.cs:10:13
         public CreateWorkPatternCommandValidator()
         {
             RuleFor(x => x.UserId).GreaterThan(0);
-            RuleFor(x => x.Body).SetValidator(new CreateWorkPatternCommandBodyValidator());
+            ;
         }
     }
