[Killed] Block removal mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternHandler.cs:19:9
         public CreateWorkPatternHandler(IWorkPatternRepository repository,
             IMediator mediator,
             IUnsService unsService)
-        {
-            _repository = repository;
-            _mediator = mediator;
-
-        }
+        {}
 
         public async Task<CreateWorkPatternResponse> Handle(CreateWorkPatternCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternHandler.cs:26:9
         }
 
         public async Task<CreateWorkPatternResponse> Handle(CreateWorkPatternCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var workPattern = new WorkPattern
-            {
-                UserId = command.UserId,
-                StartDate = command.Body.StartDate,
-                EndDate = command.Body.EndDate,
-                Parts = command.Body.Parts
-            };
-
-            var createdWorkPattern = await _repository.CreateWorkPatternAsync(workPattern, cancellationToken);
-            var eventPublishWorkPattern = new CreateWorkPatternLogicEvent(createdWorkPattern);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
-
-            return new CreateWorkPatternResponse
-            {
-                WorkPattern = workPattern
-            };
-        }
+        {}
     }
 }

[Killed] Statement mutation
WorkPatterns/Commands/CreateWorkPattern/CreateWorkPatternHandler.cs:42:13
 
             var createdWorkPattern = await _repository.CreateWorkPatternAsync(workPattern, cancellationToken);
             var eventPublishWorkPattern = new CreateWorkPatternLogicEvent(createdWorkPattern);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
+            ;
 
             return new CreateWorkPatternResponse
