[Survived] Block removal mutation
WorkPatterns/Commands/DeleteWorkPattern/DeleteWorkPatternCommand.cs:11:9
         public Guid Id { get; set; }
 
         public DeleteWorkPatternCommand(Guid id)
-        {
-            Id = id;
-        }
+        {}
     }
 }
