[Killed] Block removal mutation
WorkPatterns/Commands/DeleteWorkPattern/DeleteWorkPatternCommandValidator.cs:8:9
     public class DeleteWorkPatternCommandValidator : AbstractValidator<DeleteWorkPatternCommand>
     {
         public DeleteWorkPatternCommandValidator()
-        {
-            RuleFor(x => x.Id).NotEmpty();
-        }
+        {}
     }
 }
