[Killed] Block removal mutation
WorkPatterns/Commands/DeleteWorkPattern/DeleteWorkPatternHandler.cs:27:9
         }
 
         public async Task<DeleteWorkPatternResponse> Handle(DeleteWorkPatternCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var id = command.Id;
-            var deletedWorkPattern = await _repository.DeleteWorkPatternAsync(id, cancellationToken);
-            var eventPublishWorkPattern = new DeleteWorkPatternLogicEvent(deletedWorkPattern);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
-
-
-            return new DeleteWorkPatternResponse
-            {
-                WorkPattern = deletedWorkPattern
-            };
-        }
+        {}
     }
 }

[Killed] Statement mutation
WorkPatterns/Commands/DeleteWorkPattern/DeleteWorkPatternHandler.cs:36:13
             var id = command.Id;
             var deletedWorkPattern = await _repository.DeleteWorkPatternAsync(id, cancellationToken);
             var eventPublishWorkPattern = new DeleteWorkPatternLogicEvent(deletedWorkPattern);
-            await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
+            ;
 
 

[Killed] Object initializer mutation
WorkPatterns/Commands/DeleteWorkPattern/DeleteWorkPatternHandler.cs:39:20
             await _mediator.Publish(eventPublishWorkPattern, cancellationToken);
 
 
-            return new DeleteWorkPatternResponse
-            {
-                WorkPattern = deletedWorkPattern
-            };
+            return new DeleteWorkPatternResponse
+{};
         }
     }
