[Killed] Block removal mutation
WorkPatterns/Commands/EditWorkPattern/EditWorkPatternCommand.cs:11:9
         public Guid Id { get; set; }
         public EditWorkPatternCommandBody Body { get; set; }
         public EditWorkPatternCommand(Guid id, EditWorkPatternCommandBody body)
-        {
-            Id = id;
-            Body = body;
-        }
+        {}
     }
 }
