[Killed] Block removal mutation
WorkPatterns/Commands/EditWorkPattern/EditWorkPatternCommandBodyValidator.cs:10:5
 public class EditWorkPatternCommandBodyValidator : AbstractValidator<EditWorkPatternCommandBody>
 {
     public EditWorkPatternCommandBodyValidator()
-    {
-
-        RuleFor(x => x.StartDate).NotEmpty();
-        RuleFor(x => x.EndDate).GreaterThan(x => x.StartDate);
-        RuleFor(x => x.Parts).NotEmpty();
-        RuleForEach(x => x.Parts)
-            .SetValidator(new WorkPatternPartValidator());
-    }
+    {}
 }
 public class WorkPatternPartValidator : AbstractValidator<WorkPatternPart>
