[Killed] Block removal mutation
WorkPatterns/Commands/EditWorkPattern/EditWorkPatternCommandValidator.cs:9:9
     public class EditWorkPatternCommandValidator : AbstractValidator<EditWorkPatternCommand>
     {
         public EditWorkPatternCommandValidator()
-        {
-            RuleFor(x => x.Id).NotEmpty();
-            RuleFor(x => x.Body).SetValidator(new EditWorkPatternCommandBodyValidator());
-        }
+        {}
     }
 }

[Killed] Statement mutation
WorkPatterns/Commands/EditWorkPattern/EditWorkPatternCommandValidator.cs:11:13
         public EditWorkPatternCommandValidator()
         {
             RuleFor(x => x.Id).NotEmpty();
-            RuleFor(x => x.Body).SetValidator(new EditWorkPatternCommandBodyValidator());
+            ;
         }
     }
