[Survived] Object initializer mutation
WorkPatterns/Commands/EditWorkPattern/EditWorkPatternHandler.cs:31:31
                 throw new ArgumentNullException(nameof(command));
             }
 
-            var workPattern = new WorkPattern
-            {
-                Id = command.Id,
-                StartDate = command.Body.StartDate,
-                EndDate = command.Body.EndDate,
-                Parts = command.Body.Parts
-            };
+            var workPattern = new WorkPattern
+{};
 
             var updatedWP = await _repository.UpdateWorkPatternAsync(workPattern, cancellationToken);
