[Killed] Block removal mutation
WorkPatterns/Queries/GetAllWorkPattern/GetAllWorkPatternHandler.cs:13:9
         private readonly IWorkPatternRepository _repository;
 
         public GetAllWorkPatternHandler(IWorkPatternRepository repository)
-        {
-            _repository = repository;
-
-        }
+        {}
 
         public async Task<GetAllWorkPatternResponse> Handle(GetAllWorkPatternCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
WorkPatterns/Queries/GetAllWorkPattern/GetAllWorkPatternHandler.cs:19:9
         }
 
         public async Task<GetAllWorkPatternResponse> Handle(GetAllWorkPatternCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var gotWP = await _repository.GetAllWorkPatternsAsync(cancellationToken);
-
-            return new GetAllWorkPatternResponse
-            {
-                listWorkPattern = gotWP
-            };
-        }
+        {}
     }
 }

[Killed] Object initializer mutation
WorkPatterns/Queries/GetAllWorkPattern/GetAllWorkPatternHandler.cs:27:20
 
             var gotWP = await _repository.GetAllWorkPatternsAsync(cancellationToken);
 
-            return new GetAllWorkPatternResponse
-            {
-                listWorkPattern = gotWP
-            };
+            return new GetAllWorkPatternResponse
+{};
         }
     }
