[Killed] Block removal mutation
WorkPatterns/Queries/GetWorkPattern/GetWorkPatternCommand.cs:9:9
     {
         public Guid Id { get; set; }
         public GetWorkPatternCommand(Guid id)
-        {
-            Id = id;
-        }
+        {}
     }
 }
