[Killed] Block removal mutation
WorkPatterns/Queries/GetWorkPattern/GetWorkPatternCommandValidator.cs:8:9
     public class GetWorkPatternCommandValidator : AbstractValidator<GetWorkPatternCommand>
     {
         public GetWorkPatternCommandValidator()
-        {
-            RuleFor(x => x.Id).NotEmpty();
-        }
+        {}
     }
 }
