[Killed] Block removal mutation
WorkPatterns/Queries/GetWorkPattern/GetWorkPatternHandler.cs:14:9
         private readonly IWorkPatternRepository _repository;
 
         public GetWorkPatternHandler(IWorkPatternRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<GetWorkPatternResponse> Handle(GetWorkPatternCommand command, CancellationToken cancellationToken)

[Killed] Block removal mutation
WorkPatterns/Queries/GetWorkPattern/GetWorkPatternHandler.cs:19:9
         }
 
         public async Task<GetWorkPatternResponse> Handle(GetWorkPatternCommand command, CancellationToken cancellationToken)
-        {
-            if (command is null)
-            {
-                throw new ArgumentNullException(nameof(command));
-            }
-
-            var id = command.Id;
-            var gotWP = await _repository.GetWorkPatternAsync(id, cancellationToken);
-
-            return new GetWorkPatternResponse
-            {
-                WorkPattern = gotWP
-            };
-        }
+        {}
     }
 }
