[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:31:9
         private readonly IMediator _mediator;
 
         public AbsentController(IMediator mediator)
-        {
-            _mediator = mediator;
-        }
+        {}
 
         [HttpPost]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:37:9
 
         [HttpPost]
         public async Task<IActionResult> CreateAsync(int id, [FromBody] CreateAbsentCommandBody body, CancellationToken cancellationToken)
-        {
-            var command = new CreateAbsentCommand(id, body);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.Absent);
-            }
-            else
-            {
-                return BadRequest(response.Absent);
-            }
-        }
+        {}
 
         [HttpGet]

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:41:17
             var command = new CreateAbsentCommand(id, body);
             var response = await _mediator.Send(command, cancellationToken);
 
-            if (response != null)
+            if (response == null)
             {
                 return Ok(response.Absent);

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:42:13
             var response = await _mediator.Send(command, cancellationToken);
 
             if (response != null)
-            {
-                return Ok(response.Absent);
-            }
+            {}
             else
             {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:46:13
                 return Ok(response.Absent);
             }
             else
-            {
-                return BadRequest(response.Absent);
-            }
+            {}
         }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:53:9
 
         [HttpGet]
         public async Task<IActionResult> GetAllAbsentAsync(CancellationToken cancellationToken)
-        {
-            var command = new GetAllAbsentCommand();
-            var response = await _mediator.Send(command, cancellationToken);
-            if (response != null)
-            {
-                return Ok(response.ListAbsent);
-            }
-            else
-            {
-                return BadRequest();
-            }
-        }
+        {}
 
         [HttpPut("{id}")]

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:56:17
         {
             var command = new GetAllAbsentCommand();
             var response = await _mediator.Send(command, cancellationToken);
-            if (response != null)
+            if (response == null)
             {
                 return Ok(response.ListAbsent);

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:57:13
             var command = new GetAllAbsentCommand();
             var response = await _mediator.Send(command, cancellationToken);
             if (response != null)
-            {
-                return Ok(response.ListAbsent);
-            }
+            {}
             else
             {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:61:13
                 return Ok(response.ListAbsent);
             }
             else
-            {
-                return BadRequest();
-            }
+            {}
         }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:68:9
 
         [HttpPut("{id}")]
         public async Task<IActionResult> EditAsync(Guid id, [FromBody] EditAbsentCommandBody body, CancellationToken cancellationToken)
-        {
-            var command = new EditAbsentCommand(id, body);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.Absent);
-            }
-            else
-            {
-                return BadRequest(response.Absent);
-            }
-        }
+        {}
 
         [HttpGet("id")]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:84:9
 
         [HttpGet("id")]
         public async Task<IActionResult> GetAsync(Guid id, CancellationToken cancellationToken)
-        {
-            var command = new GetAbsentCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.Absent);
-            }
-            else
-            {
-                return BadRequest(response.Absent);
-            }
-        }
+        {}
 
         [HttpGet("userId")]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:100:9
 
         [HttpGet("userId")]
         public async Task<IActionResult> GetByIdAsync(int userId, CancellationToken cancellationToken)
-        {
-            var command = new GetAbsentByIdCommand(userId);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.ListAbsent);
-            }
-            else
-            {
-                return BadRequest(response.ListAbsent);
-            }
-        }
+        {}
 
         [HttpDelete("{id}")]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:109:13
                 return Ok(response.ListAbsent);
             }
             else
-            {
-                return BadRequest(response.ListAbsent);
-            }
+            {}
         }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/AbsentController.cs:116:9
 
         [HttpDelete("{id}")]
         public async Task<IActionResult> DeleteAsync(Guid id, CancellationToken cancellationToken)
-        {
-            var command = new DeleteAbsentCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.Absent);
-            }
-            else
-            {
-                return BadRequest(response.Absent);
-            }
-        }
+        {}
     }
 }
