[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:28:9
             IUnsService unsService, 
             IWorkPatternRepository workPatternRepository,
             IMediator mediator)
-        {
-            _repository = repository;
-            _unsService = unsService;
-            _workPatternRepository = workPatternRepository;
-            _mediator = mediator;
-        }
+        {}
 
         /// <summary>

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:43:9
         /// <returns></returns>
         [HttpPost]
         public async Task<IActionResult> CreateAsync(int id, [FromBody] CreateApplicationUserCommandBody body, CancellationToken cancellationToken)
-        {
-            var command = new CreateApplicationUserCommand(id, body);
-            var response = await _mediator.Send(command, cancellationToken);
-            if (response != null)
-            {
-                return Ok(response.ApplicationUser);
-            }
-            else
-            {
-                return BadRequest(response.ApplicationUser);
-            }
-        }
+        {}
         [HttpPut("{id}")]
         public async Task<IActionResult> EditAsync(int id, [FromBody]EditApplicationUserCommandBody body, CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:47:13
             var command = new CreateApplicationUserCommand(id, body);
             var response = await _mediator.Send(command, cancellationToken);
             if (response != null)
-            {
-                return Ok(response.ApplicationUser);
-            }
+            {}
             else
             {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:51:13
                 return Ok(response.ApplicationUser);
             }
             else
-            {
-                return BadRequest(response.ApplicationUser);
-            }
+            {}
         }
         [HttpPut("{id}")]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:57:9
         }
         [HttpPut("{id}")]
         public async Task<IActionResult> EditAsync(int id, [FromBody]EditApplicationUserCommandBody body, CancellationToken cancellationToken)
-        {
-            var command = new EditApplicationUserCommand(id, body);
-            var response = await _mediator.Send(command, cancellationToken);
-            if (response != null)
-            {
-                return Ok(response.ApplicationUser);
-            }
-            else
-            {
-                return BadRequest(response.ApplicationUser);
-            }
-        }
+        {}
         [HttpGet]
         public async Task<IActionResult> GetAllApplicationUserAsync(CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:71:9
         }
         [HttpGet]
         public async Task<IActionResult> GetAllApplicationUserAsync(CancellationToken cancellationToken)
-        {
-            var command = new GetAllApplicationUserCommand();
-            var response = await _mediator.Send(command, cancellationToken);
-            if (response != null)
-            {
-                return Ok(response.listApplicationUser);
-            }
-            else
-            {
-                return BadRequest();
-            }
-
-        }
+        {}
         [HttpGet("{id}")]
         public async Task<IActionResult> GetAsync(int id,CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:75:13
             var command = new GetAllApplicationUserCommand();
             var response = await _mediator.Send(command, cancellationToken);
             if (response != null)
-            {
-                return Ok(response.listApplicationUser);
-            }
+            {}
             else
             {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:86:9
         }
         [HttpGet("{id}")]
         public async Task<IActionResult> GetAsync(int id,CancellationToken cancellationToken)
-        {
-            var command = new GetApplicationUserCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.ApplicationUser);
-            }
-            else
-            {
-                return BadRequest(response.ApplicationUser);
-            }
-        }
+        {}
         [HttpDelete("{id}")]
         public async Task<IActionResult> DeleteAsync(int id, CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:101:9
         }
         [HttpDelete("{id}")]
         public async Task<IActionResult> DeleteAsync(int id, CancellationToken cancellationToken)
-        {
-            var command = new DeleteApplicationUserCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.ApplicationUser);
-            }
-            else
-            {
-                return BadRequest(response.ApplicationUser);
-            }
-        }
+        {}
         [HttpPost("{id}/check-in")]
         public async Task<IActionResult> CheckInAsync(int id, CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:116:9
         }
         [HttpPost("{id}/check-in")]
         public async Task<IActionResult> CheckInAsync(int id, CancellationToken cancellationToken)
-        {
-            var command = new CheckInApplicationUserCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.ApplicationUser);
-            }
-            else
-            {
-                return BadRequest(response.ApplicationUser);
-            }
-
-        }
+        {}
         [HttpPost("{id}/check-out")]
         public async Task<IActionResult> CheckOutAsync(int id, CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/ApplicationUserController.cs:132:9
         }
         [HttpPost("{id}/check-out")]
         public async Task<IActionResult> CheckOutAsync(int id, CancellationToken cancellationToken)
-        {
-            var command = new CheckOutApplicationUserCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.ApplicationUser);
-            }
-            else
-            {
-                return BadRequest(response.ApplicationUser);
-            }
-        }
+        {}
     }
 }
