[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:30:9
             IUnsService unsService,
             IMediator mediator,
             IApplicationUsersRepository workPatternRepository)
-        {
-            _context = context;
-            _repository = repository;
-            _unsService = unsService;
-            _mediator = mediator;
-            _workPatternRepository = workPatternRepository;
-        }
+        {}
 
         [HttpPost]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:40:9
 
         [HttpPost]
         public async Task<IActionResult> CreateAsync(int id, [FromBody] CreateWorkPatternCommandBody body, CancellationToken cancellationToken)
-        {
-
-            var command = new CreateWorkPatternCommand(id, body);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.WorkPattern);
-            }
-            else
-            {
-                return BadRequest(response.WorkPattern);
-            }
-        }
+        {}
 
         [HttpGet]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:46:13
             var response = await _mediator.Send(command, cancellationToken);
 
             if (response != null)
-            {
-                return Ok(response.WorkPattern);
-            }
+            {}
             else
             {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:50:13
                 return Ok(response.WorkPattern);
             }
             else
-            {
-                return BadRequest(response.WorkPattern);
-            }
+            {}
         }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:57:9
 
         [HttpGet]
         public async Task<IActionResult> GetAllWorkPatternsAsync(CancellationToken cancellationToken)
-        {
-            var command = new GetAllWorkPatternCommand();
-            var response = await _mediator.Send(command, cancellationToken);
-            if (response != null)
-            {
-                return Ok(response.listWorkPattern);
-            }
-            else
-            {
-                return BadRequest();
-            }
-        }
+        {}
 
         [HttpPut("{id}")]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:61:13
             var command = new GetAllWorkPatternCommand();
             var response = await _mediator.Send(command, cancellationToken);
             if (response != null)
-            {
-                return Ok(response.listWorkPattern);
-            }
+            {}
             else
             {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:72:9
 
         [HttpPut("{id}")]
         public async Task<IActionResult> EditAsync(Guid id, [FromBody] EditWorkPatternCommandBody body, CancellationToken cancellationToken)
-        {
-            var command = new EditWorkPatternCommand(id, body);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.WorkPattern);
-            }
-            else
-            {
-                return BadRequest(response.WorkPattern);
-            }
-        }
+        {}
 
         [HttpGet("id")]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:88:9
 
         [HttpGet("id")]
         public async Task<IActionResult> GetAsync(Guid id, CancellationToken cancellationToken)
-        {
-            var command = new GetWorkPatternCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.WorkPattern);
-            }
-            else
-            {
-                return BadRequest(response.WorkPattern);
-            }
-        }
+        {}
 
         [HttpDelete("{id}")]

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Controllers/WorkPatternController.cs:104:9
 
         [HttpDelete("{id}")]
         public async Task<IActionResult> DeleteAsync(Guid id, CancellationToken cancellationToken)
-        {
-            var command = new DeleteWorkPatternCommand(id);
-            var response = await _mediator.Send(command, cancellationToken);
-
-            if (response != null)
-            {
-                return Ok(response.WorkPattern);
-            }
-            else
-            {
-                return BadRequest(response.WorkPattern);
-            }
-        }
+        {}
     }
 }
