[Survived] Block removal mutation
miguel-pvs/employee_api/Data/AppDbContext.cs:22:9
             => options.UseSqlite(@"Data Source=DB.db");
 
         protected override void OnModelCreating(ModelBuilder modelBuilder)
-        {
-            modelBuilder.Entity<WorkPattern>()
-                .HasMany(s => s.Parts)
-                .WithOne()
-                .OnDelete(DeleteBehavior.Cascade);
-
-            modelBuilder.Entity<WorkPattern>()
-                .HasOne(x=>x.User)
-                .WithMany(x=>x.WorkPatterns)
-                .HasForeignKey(x=>x.UserId)
-                .OnDelete(DeleteBehavior.Cascade);
-
-        }
+        {}
 
     }

[Survived] Statement mutation
miguel-pvs/employee_api/Data/AppDbContext.cs:23:13
 
         protected override void OnModelCreating(ModelBuilder modelBuilder)
         {
-            modelBuilder.Entity<WorkPattern>()
-                .HasMany(s => s.Parts)
-                .WithOne()
-                .OnDelete(DeleteBehavior.Cascade);
+            ;
 
             modelBuilder.Entity<WorkPattern>()

[Survived] Statement mutation
miguel-pvs/employee_api/Data/AppDbContext.cs:28:13
                 .WithOne()
                 .OnDelete(DeleteBehavior.Cascade);
 
-            modelBuilder.Entity<WorkPattern>()
-                .HasOne(x=>x.User)
-                .WithMany(x=>x.WorkPatterns)
-                .HasForeignKey(x=>x.UserId)
-                .OnDelete(DeleteBehavior.Cascade);
+            ;
 
         }
