[Killed] Block removal mutation
employee_api/Events/AbsentLogicEvents/AbsentLogicEventHandler.cs:13:9
     {
         public Absent Absent { get; set; }
         public AbsentLogicEvent(Absent absent)
-        {
-            Absent = absent;
-        }
+        {}
     }
 }
