[Killed] Block removal mutation
employee_api/Events/UnsEvents/DeleteTopicApplicationUserEvent.Cs:10:9
     {
         public ApplicationUser ApplicationUser { get; set; }
         public DeleteTopicApplicationUserEvent(ApplicationUser applicationUser)
-        {
-            ApplicationUser = applicationUser;
-        }
+        {}
     }
 }
