[Killed] Block removal mutation
employee_api/Events/UnsEvents/PublishCheckInEvent.cs:10:9
     {
         public ApplicationUser ApplicationUser { get; set; }
         public PublishCheckInEvent(ApplicationUser applicationUser)
-        {
-            ApplicationUser = applicationUser;
-        }
+        {}
 
     }
