[Killed] Block removal mutation
employee_api/Events/UnsEvents/PublishLocationEvent.cs:11:9
         public UsersEachLocation UsersEachLocation { get; set; }
         public int OfficeLocation { get; set; }
         public PublishLocationEvent(UsersEachLocation usersEachLocation, int officeLocation)
-        {
-            UsersEachLocation = usersEachLocation;
-            OfficeLocation = officeLocation;
-        }
+        {}
     }
 }
