[Killed] Block removal mutation
employee_api/Events/UnsEvents/PublishWorkPattern.cs:11:9
     {
         public ApplicationUser ApplicationUser { get; set; }
         public PublishWorkPatternEvent(ApplicationUser applicationUser)
-        {
-            ApplicationUser = applicationUser;
-        }
+        {}
     }
 }
