[Killed] Block removal mutation
employee_api/Events/UnsEvents/RemoveTimerEvent.cs:10:9
     {
         public ApplicationUser ApplicationUser { get; set; }
         public RemoveTimerEvent(ApplicationUser applicationUser)
-        {
-            ApplicationUser = applicationUser;
-        }
+        {}
     }
 }
