[Killed] Block removal mutation
employee_api/Events/UnsLogicEvents/CreateApplicationUserLogicEvent.cs:10:9
     {
         public ApplicationUser ApplicationUser { get; set; }
         public CreateApplicationUserLogicEvent (ApplicationUser applicationUser)
-        {
-            ApplicationUser = applicationUser;
-        }
+        {}
     }
 }
