[Killed] Block removal mutation
employee_api/Events/UnsLogicEvents/DeleteApplicationUserLogicEvent.cs:11:9
         public ApplicationUser ApplicationUser { get; set; }
         public UsersEachLocation UsersEachLocation { get; set; }
         public DeleteApplicationUserLogicEvent (ApplicationUser applicationUser, UsersEachLocation usersEachLocation)
-        {
-            ApplicationUser = applicationUser;
-            UsersEachLocation = usersEachLocation;
-        }
+        {}
     }
 }
