[Killed] Block removal mutation
employee_api/Events/UnsLogicEvents/DeleteWorkPatternLogicEvent.cs:10:9
     {
         public WorkPattern WorkPattern { get; set; }
         public DeleteWorkPatternLogicEvent (WorkPattern workPattern)
-        {
-            WorkPattern = workPattern;
-        }
+        {}
     }
 }
