[Killed] Block removal mutation
employee_api/Events/UnsLogicEvents/EditApplicationUserLogicEvent.cs:11:9
         public ApplicationUser NewApplicationUser { get; set; }
         public ApplicationUser OldApplicationUser { get; set; }
         public EditApplicationUserLogicEvent (ApplicationUser newApplicationUser,ApplicationUser oldApplicationUser)
-        {
-            NewApplicationUser = newApplicationUser;
-            OldApplicationUser = oldApplicationUser;
-        }
+        {}
     }
 }
