[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:10:9
         private readonly RequestDelegate _next;
 
         public ApiExceptionsMiddleware(RequestDelegate next)
-        {
-            if (next is null)
-            {
-                throw new ArgumentNullException(nameof(next));
-            }
-
-            _next = next;
-        }
+        {}
 
         public async Task InvokeAsync(HttpContext httpContext)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:12:13
         public ApiExceptionsMiddleware(RequestDelegate next)
         {
             if (next is null)
-            {
-                throw new ArgumentNullException(nameof(next));
-            }
+            {}
 
             _next = next;

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:13:17
         {
             if (next is null)
             {
-                throw new ArgumentNullException(nameof(next));
+                ;
             }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:20:9
         }
 
         public async Task InvokeAsync(HttpContext httpContext)
-        {
-            if (httpContext is null)
-            {
-                throw new ArgumentNullException(nameof(httpContext));
-            }
-
-            try
-            {
-                await _next(httpContext);
-            }
-            catch (ValidationException e)
-            {
-                httpContext.Response.StatusCode = 400;
-                await httpContext.Response.WriteAsync("Validation failed for request: " + e.Message);
-                foreach (KeyValuePair<string, string[]> failure in e.Failures)
-                {
-                    foreach (var message in failure.Value)
-                    {
-                        await httpContext.Response.WriteAsync(Environment.NewLine + message);
-                    }
-                }
-            }
-        }
+        {}
     }
 }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:22:13
         public async Task InvokeAsync(HttpContext httpContext)
         {
             if (httpContext is null)
-            {
-                throw new ArgumentNullException(nameof(httpContext));
-            }
+            {}
 
             try

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:23:17
         {
             if (httpContext is null)
             {
-                throw new ArgumentNullException(nameof(httpContext));
+                ;
             }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:27:13
             }
 
             try
-            {
-                await _next(httpContext);
-            }
+            {}
             catch (ValidationException e)
             {

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:28:17
 
             try
             {
-                await _next(httpContext);
+                ;
             }
             catch (ValidationException e)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:31:13
                 await _next(httpContext);
             }
             catch (ValidationException e)
-            {
-                httpContext.Response.StatusCode = 400;
-                await httpContext.Response.WriteAsync("Validation failed for request: " + e.Message);
-                foreach (KeyValuePair<string, string[]> failure in e.Failures)
-                {
-                    foreach (var message in failure.Value)
-                    {
-                        await httpContext.Response.WriteAsync(Environment.NewLine + message);
-                    }
-                }
-            }
+            {}
         }
     }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:33:17
             catch (ValidationException e)
             {
                 httpContext.Response.StatusCode = 400;
-                await httpContext.Response.WriteAsync("Validation failed for request: " + e.Message);
+                ;
                 foreach (KeyValuePair<string, string[]> failure in e.Failures)
                 {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:35:17
                 httpContext.Response.StatusCode = 400;
                 await httpContext.Response.WriteAsync("Validation failed for request: " + e.Message);
                 foreach (KeyValuePair<string, string[]> failure in e.Failures)
-                {
-                    foreach (var message in failure.Value)
-                    {
-                        await httpContext.Response.WriteAsync(Environment.NewLine + message);
-                    }
-                }
+                {}
             }
         }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:37:21
                 foreach (KeyValuePair<string, string[]> failure in e.Failures)
                 {
                     foreach (var message in failure.Value)
-                    {
-                        await httpContext.Response.WriteAsync(Environment.NewLine + message);
-                    }
+                    {}
                 }
             }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Exceptions/ApiExceptionsMiddleware.cs:38:25
                 {
                     foreach (var message in failure.Value)
                     {
-                        await httpContext.Response.WriteAsync(Environment.NewLine + message);
+                        ;
                     }
                 }
