[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ValidationException.cs:9:9
     {
         public ValidationException()
             : base("One or more validation failures have occurred.")
-        {
-            Failures = new Dictionary<string, string[]>();
-        }
+        {}
         public ValidationException(List<ValidationFailure> failures)
             : this()

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ValidationException.cs:14:9
         }
         public ValidationException(List<ValidationFailure> failures)
             : this()
-        {
-            IEnumerable<string> propertyNames = failures
-                .Select(e => e.PropertyName)
-                .Distinct();
-            foreach (var propertyName in propertyNames)
-            {
-                var propertyFailures = failures
-                    .Where(e => e.PropertyName == propertyName)
-                    .Select(e => e.ErrorMessage)
-                    .ToArray();
-                Failures.Add(propertyName, propertyFailures);
-            }
-        }
+        {}
         public IDictionary<string, string[]> Failures { get; }
     }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Exceptions/ValidationException.cs:19:13
                 .Select(e => e.PropertyName)
                 .Distinct();
             foreach (var propertyName in propertyNames)
-            {
-                var propertyFailures = failures
-                    .Where(e => e.PropertyName == propertyName)
-                    .Select(e => e.ErrorMessage)
-                    .ToArray();
-                Failures.Add(propertyName, propertyFailures);
-            }
+            {}
         }
         public IDictionary<string, string[]> Failures { get; }

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Exceptions/ValidationException.cs:21:33
             foreach (var propertyName in propertyNames)
             {
                 var propertyFailures = failures
-                    .Where(e => e.PropertyName == propertyName)
+                    .Where(e => e.PropertyName != propertyName)
                     .Select(e => e.ErrorMessage)
                     .ToArray();

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Exceptions/ValidationException.cs:24:17
                     .Where(e => e.PropertyName == propertyName)
                     .Select(e => e.ErrorMessage)
                     .ToArray();
-                Failures.Add(propertyName, propertyFailures);
+                ;
             }
         }
