[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Infrastructure/MqttService.cs:10:9
     {
         public async Task PublishOnTopicAsync(string payLoad, string topic, CancellationToken cancellationToken)
 
-        {
-            var mqttFactory = new MqttFactory();
-            string ip = "127.0.0.1";
-
-            using (var mqttClient = mqttFactory.CreateMqttClient())
-            {
-                var mqttClientOptions = new MqttClientOptionsBuilder()
-                    .WithTcpServer(ip)
-                    .Build();
-
-                await mqttClient.ConnectAsync(mqttClientOptions, CancellationToken.None);
-
-                var applicationMessage = new MqttApplicationMessageBuilder()
-                    .WithTopic(topic)
-                    .WithPayload(payLoad)
-                    .Build();
-
-                await mqttClient.PublishAsync(applicationMessage, CancellationToken.None);
-            }
-
-        }
+        {}
     }
 }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Infrastructure/MqttService.cs:15:13
             string ip = "127.0.0.1";
 
             using (var mqttClient = mqttFactory.CreateMqttClient())
-            {
-                var mqttClientOptions = new MqttClientOptionsBuilder()
-                    .WithTcpServer(ip)
-                    .Build();
-
-                await mqttClient.ConnectAsync(mqttClientOptions, CancellationToken.None);
-
-                var applicationMessage = new MqttApplicationMessageBuilder()
-                    .WithTopic(topic)
-                    .WithPayload(payLoad)
-                    .Build();
-
-                await mqttClient.PublishAsync(applicationMessage, CancellationToken.None);
-            }
+            {}
 
         }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Infrastructure/MqttService.cs:20:17
                     .WithTcpServer(ip)
                     .Build();
 
-                await mqttClient.ConnectAsync(mqttClientOptions, CancellationToken.None);
+                ;
 
                 var applicationMessage = new MqttApplicationMessageBuilder()

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Infrastructure/MqttService.cs:27:17
                     .WithPayload(payLoad)
                     .Build();
 
-                await mqttClient.PublishAsync(applicationMessage, CancellationToken.None);
+                ;
             }
 
