[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:19:9
         private readonly IMqttService _mqttService;
 
         public UnsService(IMqttService mqttService)
-        {
-            _mqttService = mqttService;
-        }
+        {}
 
         public async Task CallEachCheckInAsync(List<ApplicationUser> allUsers,DateTime now, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:24:9
         }
 
         public async Task CallEachCheckInAsync(List<ApplicationUser> allUsers,DateTime now, CancellationToken cancellationToken)
-        {
-            foreach (var user in allUsers)
-            {
-                await PublishCheckInAsync(user,now,cancellationToken);
-            }
-        }
+        {}
         public async Task PublishCheckInAsync(ApplicationUser checkInUser,DateTime now, CancellationToken cancellationToken)
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:26:13
         public async Task CallEachCheckInAsync(List<ApplicationUser> allUsers,DateTime now, CancellationToken cancellationToken)
         {
             foreach (var user in allUsers)
-            {
-                await PublishCheckInAsync(user,now,cancellationToken);
-            }
+            {}
         }
         public async Task PublishCheckInAsync(ApplicationUser checkInUser,DateTime now, CancellationToken cancellationToken)

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:27:17
         {
             foreach (var user in allUsers)
             {
-                await PublishCheckInAsync(user,now,cancellationToken);
+                ;
             }
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:32:9
         }
         public async Task PublishCheckInAsync(ApplicationUser checkInUser,DateTime now, CancellationToken cancellationToken)
 
-        {
-            CheckInPayLoad messageJson = new CheckInPayLoad()
-            {
-                Value = checkInUser.CheckedIn,
-                Timestamp = now
-            };
-            string payLoad = JsonConvert.SerializeObject(messageJson);
-            string topic = $"users/{checkInUser.Id}/pvs/checked_in";
-            await PublishOnTopicAsync(payLoad, topic, cancellationToken);
-        }
+        {}
         public async Task DeleteTopicApplicationUserAsync(ApplicationUser deletedUser, CancellationToken cancellationToken)
 

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:40:13
             };
             string payLoad = JsonConvert.SerializeObject(messageJson);
             string topic = $"users/{checkInUser.Id}/pvs/checked_in";
-            await PublishOnTopicAsync(payLoad, topic, cancellationToken);
+            ;
         }
         public async Task DeleteTopicApplicationUserAsync(ApplicationUser deletedUser, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:44:9
         }
         public async Task DeleteTopicApplicationUserAsync(ApplicationUser deletedUser, CancellationToken cancellationToken)
 
-        {
-            string payLoad = null;
-            string userId = Convert.ToString(deletedUser.Id);
-            string userOfficeLocation = Convert.ToString(deletedUser.OfficeLocation);
-            List<string> listTopics = new List<string>();
-
-            listTopics.Add($"users/{userId}/pvs/checked_in");
-            listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
-            listTopics.Add($"users/{userId}/pvs/Schedule");
-            listTopics.Add($"users/{userId}/pvs/Schedule/today");
-
-            foreach (var topic in listTopics)
-            {
-                await PublishOnTopicAsync(payLoad, topic, cancellationToken);
-            }
-        }
+        {}
         public async Task CallEachApplicationUserAsync(List<ApplicationUser> listApplicationUsers, CancellationToken cancellationToken)
 

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:50:13
             string userOfficeLocation = Convert.ToString(deletedUser.OfficeLocation);
             List<string> listTopics = new List<string>();
 
-            listTopics.Add($"users/{userId}/pvs/checked_in");
+            ;
             listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
             listTopics.Add($"users/{userId}/pvs/Schedule");

[Killed] String mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:50:28
             string userOfficeLocation = Convert.ToString(deletedUser.OfficeLocation);
             List<string> listTopics = new List<string>();
 
-            listTopics.Add($"users/{userId}/pvs/checked_in");
+            listTopics.Add($"");
             listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
             listTopics.Add($"users/{userId}/pvs/Schedule");

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:51:13
             List<string> listTopics = new List<string>();
 
             listTopics.Add($"users/{userId}/pvs/checked_in");
-            listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
+            ;
             listTopics.Add($"users/{userId}/pvs/Schedule");
             listTopics.Add($"users/{userId}/pvs/Schedule/today");

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:52:13
 
             listTopics.Add($"users/{userId}/pvs/checked_in");
             listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
-            listTopics.Add($"users/{userId}/pvs/Schedule");
+            ;
             listTopics.Add($"users/{userId}/pvs/Schedule/today");
 

[Killed] String mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:52:28
 
             listTopics.Add($"users/{userId}/pvs/checked_in");
             listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
-            listTopics.Add($"users/{userId}/pvs/Schedule");
+            listTopics.Add($"");
             listTopics.Add($"users/{userId}/pvs/Schedule/today");
 

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:53:13
             listTopics.Add($"users/{userId}/pvs/checked_in");
             listTopics.Add($"locations/{userOfficeLocation}/pvs/mechanics");
             listTopics.Add($"users/{userId}/pvs/Schedule");
-            listTopics.Add($"users/{userId}/pvs/Schedule/today");
+            ;
 
             foreach (var topic in listTopics)

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:56:13
             listTopics.Add($"users/{userId}/pvs/Schedule/today");
 
             foreach (var topic in listTopics)
-            {
-                await PublishOnTopicAsync(payLoad, topic, cancellationToken);
-            }
+            {}
         }
         public async Task CallEachApplicationUserAsync(List<ApplicationUser> listApplicationUsers, CancellationToken cancellationToken)

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:57:17
 
             foreach (var topic in listTopics)
             {
-                await PublishOnTopicAsync(payLoad, topic, cancellationToken);
+                ;
             }
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:62:9
         }
         public async Task CallEachApplicationUserAsync(List<ApplicationUser> listApplicationUsers, CancellationToken cancellationToken)
 
-        {
-            try
-            {
-                foreach (var applicationUser in listApplicationUsers)
-                {
-                    await CallListWorkPatternAsync(applicationUser, cancellationToken);
-                }
-            }
-            catch (NullReferenceException except)
-            {
-            }
-        }
+        {}
         public async Task CallListWorkPatternAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:64:13
 
         {
             try
-            {
-                foreach (var applicationUser in listApplicationUsers)
-                {
-                    await CallListWorkPatternAsync(applicationUser, cancellationToken);
-                }
-            }
+            {}
             catch (NullReferenceException except)
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:66:17
             try
             {
                 foreach (var applicationUser in listApplicationUsers)
-                {
-                    await CallListWorkPatternAsync(applicationUser, cancellationToken);
-                }
+                {}
             }
             catch (NullReferenceException except)

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:67:21
             {
                 foreach (var applicationUser in listApplicationUsers)
                 {
-                    await CallListWorkPatternAsync(applicationUser, cancellationToken);
+                    ;
                 }
             }

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:79:13
         {
             List<WorkPattern> listWorkPatterns = applicationUser.WorkPatterns;
             try
-            {
-                _todayList = new List<TodaySchedule>();
-                _scheduleToWorkNow = false;
-
-                await CallEachWorkPatternAsync(listWorkPatterns, cancellationToken);
-
-                int id = applicationUser.Id;
-                bool varScheduleToWorkNow = _scheduleToWorkNow;
-
-                TodaySchedule previousToday = null;
-                List<TodaySchedule> newListTodayToAdd = new List<TodaySchedule>();
-                _todayList = _todayList.OrderBy(x => x.From).ToList();
-
-                foreach (var today in _todayList)
-                {
-                    (newListTodayToAdd, previousToday) = await OverLapTodayScheduleAsync(today,previousToday,newListTodayToAdd,cancellationToken);
-                }
-                await PublishTodayScheduleAsync(id, newListTodayToAdd, cancellationToken);
-                await PublishScheduleToWorkNowAsync(id, varScheduleToWorkNow, cancellationToken);
-            }
+            {}
             catch
             {

[Killed] Boolean mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:81:38
             try
             {
                 _todayList = new List<TodaySchedule>();
-                _scheduleToWorkNow = false;
+                _scheduleToWorkNow = true;
 
                 await CallEachWorkPatternAsync(listWorkPatterns, cancellationToken);

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:83:17
                 _todayList = new List<TodaySchedule>();
                 _scheduleToWorkNow = false;
 
-                await CallEachWorkPatternAsync(listWorkPatterns, cancellationToken);
+                ;
 
                 int id = applicationUser.Id;

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Infrastructure/UnsService.cs:90:30
 
                 TodaySchedule previousToday = null;
                 List<TodaySchedule> newListTodayToAdd = new List<TodaySchedule>();
-                _todayList = _todayList.OrderBy(x => x.From).ToList();
+                _todayList = _todayList.OrderByDescending(x => x.From).ToList();
 
                 foreach (var today in _todayList)

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:93:17
                 _todayList = _todayList.OrderBy(x => x.From).ToList();
 
                 foreach (var today in _todayList)
-                {
-                    (newListTodayToAdd, previousToday) = await OverLapTodayScheduleAsync(today,previousToday,newListTodayToAdd,cancellationToken);
-                }
+                {}
                 await PublishTodayScheduleAsync(id, newListTodayToAdd, cancellationToken);
                 await PublishScheduleToWorkNowAsync(id, varScheduleToWorkNow, cancellationToken);

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:96:17
                 {
                     (newListTodayToAdd, previousToday) = await OverLapTodayScheduleAsync(today,previousToday,newListTodayToAdd,cancellationToken);
                 }
-                await PublishTodayScheduleAsync(id, newListTodayToAdd, cancellationToken);
+                ;
                 await PublishScheduleToWorkNowAsync(id, varScheduleToWorkNow, cancellationToken);
             }

[Survived] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:97:17
                     (newListTodayToAdd, previousToday) = await OverLapTodayScheduleAsync(today,previousToday,newListTodayToAdd,cancellationToken);
                 }
                 await PublishTodayScheduleAsync(id, newListTodayToAdd, cancellationToken);
-                await PublishScheduleToWorkNowAsync(id, varScheduleToWorkNow, cancellationToken);
+                ;
             }
             catch

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:105:9
             }
         }
         public async Task CallEachWorkPatternAsync(List<WorkPattern> listWorkPatterns, CancellationToken cancellationToken)
-        {
-            try
-            {
-                foreach (var workPattern in listWorkPatterns)
-                {
-                    bool insideWorkPattern = await CheckIfInsideWorkPatternAsync(workPattern, cancellationToken);
-
-                    if (insideWorkPattern)
-                        await CallListWorkPatternPartAsync(workPattern, cancellationToken);
-                }
-
-            }
-            catch (NullReferenceException except)
-            {
-            }
-        }
+        {}
         public async Task CallListWorkPatternPartAsync(WorkPattern workPattern, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:107:13
         public async Task CallEachWorkPatternAsync(List<WorkPattern> listWorkPatterns, CancellationToken cancellationToken)
         {
             try
-            {
-                foreach (var workPattern in listWorkPatterns)
-                {
-                    bool insideWorkPattern = await CheckIfInsideWorkPatternAsync(workPattern, cancellationToken);
-
-                    if (insideWorkPattern)
-                        await CallListWorkPatternPartAsync(workPattern, cancellationToken);
-                }
-
-            }
+            {}
             catch (NullReferenceException except)
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:109:17
             try
             {
                 foreach (var workPattern in listWorkPatterns)
-                {
-                    bool insideWorkPattern = await CheckIfInsideWorkPatternAsync(workPattern, cancellationToken);
-
-                    if (insideWorkPattern)
-                        await CallListWorkPatternPartAsync(workPattern, cancellationToken);
-                }
+                {}
 
             }

[Killed] Negate expression
miguel-pvs/employee_api/Infrastructure/UnsService.cs:112:25
                 {
                     bool insideWorkPattern = await CheckIfInsideWorkPatternAsync(workPattern, cancellationToken);
 
-                    if (insideWorkPattern)
+                    if (!(insideWorkPattern))
                         await CallListWorkPatternPartAsync(workPattern, cancellationToken);
                 }

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:113:25
                     bool insideWorkPattern = await CheckIfInsideWorkPatternAsync(workPattern, cancellationToken);
 
                     if (insideWorkPattern)
-                        await CallListWorkPatternPartAsync(workPattern, cancellationToken);
+                        ;
                 }
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:122:9
             }
         }
         public async Task CallListWorkPatternPartAsync(WorkPattern workPattern, CancellationToken cancellationToken)
-        {
-            try
-            {
-                List<WorkPatternPart> listWorkPatternParts = workPattern.Parts;
-                List<WorkPatternPart> newListWorkPatternParts = listWorkPatternParts;
-                int userId = workPattern.UserId;
-                bool userAbsentToday = false;
-                if (_listAbsentEachDay != null)
-                {
-                    userAbsentToday = _listAbsentEachDay.ListIds.Contains(userId);
-                }
-
-                if (userAbsentToday)
-                {
-                    newListWorkPatternParts = await CheckIfPartSplitAsync(listWorkPatternParts, _listAllAbsents, userId, cancellationToken);
-                }
-                await CallEachWorkPatternPartAsync(newListWorkPatternParts, cancellationToken);
-            }
-            catch
-            {
-
-            }
-        }
+        {}
         public async Task CallEachWorkPatternPartAsync(List<WorkPatternPart> listWorkPatternParts, CancellationToken cancellationToken)
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:124:13
         public async Task CallListWorkPatternPartAsync(WorkPattern workPattern, CancellationToken cancellationToken)
         {
             try
-            {
-                List<WorkPatternPart> listWorkPatternParts = workPattern.Parts;
-                List<WorkPatternPart> newListWorkPatternParts = listWorkPatternParts;
-                int userId = workPattern.UserId;
-                bool userAbsentToday = false;
-                if (_listAbsentEachDay != null)
-                {
-                    userAbsentToday = _listAbsentEachDay.ListIds.Contains(userId);
-                }
-
-                if (userAbsentToday)
-                {
-                    newListWorkPatternParts = await CheckIfPartSplitAsync(listWorkPatternParts, _listAllAbsents, userId, cancellationToken);
-                }
-                await CallEachWorkPatternPartAsync(newListWorkPatternParts, cancellationToken);
-            }
+            {}
             catch
             {

[Killed] Boolean mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:128:40
                 List<WorkPatternPart> listWorkPatternParts = workPattern.Parts;
                 List<WorkPatternPart> newListWorkPatternParts = listWorkPatternParts;
                 int userId = workPattern.UserId;
-                bool userAbsentToday = false;
+                bool userAbsentToday = true;
                 if (_listAbsentEachDay != null)
                 {

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:129:21
                 List<WorkPatternPart> newListWorkPatternParts = listWorkPatternParts;
                 int userId = workPattern.UserId;
                 bool userAbsentToday = false;
-                if (_listAbsentEachDay != null)
+                if (_listAbsentEachDay == null)
                 {
                     userAbsentToday = _listAbsentEachDay.ListIds.Contains(userId);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:130:17
                 int userId = workPattern.UserId;
                 bool userAbsentToday = false;
                 if (_listAbsentEachDay != null)
-                {
-                    userAbsentToday = _listAbsentEachDay.ListIds.Contains(userId);
-                }
+                {}
 
                 if (userAbsentToday)

[Killed] Negate expression
miguel-pvs/employee_api/Infrastructure/UnsService.cs:134:21
                     userAbsentToday = _listAbsentEachDay.ListIds.Contains(userId);
                 }
 
-                if (userAbsentToday)
+                if (!(userAbsentToday))
                 {
                     newListWorkPatternParts = await CheckIfPartSplitAsync(listWorkPatternParts, _listAllAbsents, userId, cancellationToken);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:135:17
                 }
 
                 if (userAbsentToday)
-                {
-                    newListWorkPatternParts = await CheckIfPartSplitAsync(listWorkPatternParts, _listAllAbsents, userId, cancellationToken);
-                }
+                {}
                 await CallEachWorkPatternPartAsync(newListWorkPatternParts, cancellationToken);
             }

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:138:17
                 {
                     newListWorkPatternParts = await CheckIfPartSplitAsync(listWorkPatternParts, _listAllAbsents, userId, cancellationToken);
                 }
-                await CallEachWorkPatternPartAsync(newListWorkPatternParts, cancellationToken);
+                ;
             }
             catch

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:147:9
         }
         public async Task CallEachWorkPatternPartAsync(List<WorkPatternPart> listWorkPatternParts, CancellationToken cancellationToken)
 
-        {
-            try
-            {
-                foreach (var workPatternPart in listWorkPatternParts)
-                {
-                    await ScheduledTodayAsync(workPatternPart, cancellationToken);
-                    await ScheduledToWorkNowAsync(workPatternPart, cancellationToken);
-                }
-            }
-            catch
-            {
-
-            }
-        }
+        {}
         public async Task ScheduledToWorkNowAsync(WorkPatternPart workPatternPart, CancellationToken cancellationToken)
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:149:13
 
         {
             try
-            {
-                foreach (var workPatternPart in listWorkPatternParts)
-                {
-                    await ScheduledTodayAsync(workPatternPart, cancellationToken);
-                    await ScheduledToWorkNowAsync(workPatternPart, cancellationToken);
-                }
-            }
+            {}
             catch
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:151:17
             try
             {
                 foreach (var workPatternPart in listWorkPatternParts)
-                {
-                    await ScheduledTodayAsync(workPatternPart, cancellationToken);
-                    await ScheduledToWorkNowAsync(workPatternPart, cancellationToken);
-                }
+                {}
             }
             catch

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:152:21
             {
                 foreach (var workPatternPart in listWorkPatternParts)
                 {
-                    await ScheduledTodayAsync(workPatternPart, cancellationToken);
+                    ;
                     await ScheduledToWorkNowAsync(workPatternPart, cancellationToken);
                 }

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:153:21
                 foreach (var workPatternPart in listWorkPatternParts)
                 {
                     await ScheduledTodayAsync(workPatternPart, cancellationToken);
-                    await ScheduledToWorkNowAsync(workPatternPart, cancellationToken);
+                    ;
                 }
             }

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:163:9
         }
         public async Task ScheduledToWorkNowAsync(WorkPatternPart workPatternPart, CancellationToken cancellationToken)
 
-        {
-            TimeSpan startTime = workPatternPart.StartTime;
-            TimeSpan? endTime = workPatternPart.EndTime;
-            TimeSpan currentTime = DateTime.UtcNow.TimeOfDay;
-            DayOfWeek today = DateTime.UtcNow.DayOfWeek;
-
-
-            if (startTime <= currentTime & endTime >= currentTime & workPatternPart.Day == today)
-            {
-                _scheduleToWorkNow = true;
-            }
-        }
+        {}
         public async Task ScheduledTodayAsync(WorkPatternPart workPatternPart, CancellationToken cancellationToken)
 

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:170:17
             DayOfWeek today = DateTime.UtcNow.DayOfWeek;
 
 
-            if (startTime <= currentTime & endTime >= currentTime & workPatternPart.Day == today)
+            if (startTime > currentTime & endTime >= currentTime & workPatternPart.Day == today)
             {
                 _scheduleToWorkNow = true;

[Killed] Bitwise mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:170:17
             DayOfWeek today = DateTime.UtcNow.DayOfWeek;
 
 
-            if (startTime <= currentTime & endTime >= currentTime & workPatternPart.Day == today)
+            if (startTime <= currentTime & endTime >= currentTime | workPatternPart.Day == today)
             {
                 _scheduleToWorkNow = true;

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:171:13
 
 
             if (startTime <= currentTime & endTime >= currentTime & workPatternPart.Day == today)
-            {
-                _scheduleToWorkNow = true;
-            }
+            {}
         }
         public async Task ScheduledTodayAsync(WorkPatternPart workPatternPart, CancellationToken cancellationToken)

[Killed] Boolean mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:172:38
 
             if (startTime <= currentTime & endTime >= currentTime & workPatternPart.Day == today)
             {
-                _scheduleToWorkNow = true;
+                _scheduleToWorkNow = false;
             }
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:177:9
         }
         public async Task ScheduledTodayAsync(WorkPatternPart workPatternPart, CancellationToken cancellationToken)
 
-        {
-            DayOfWeek dayOfWeekToday = DateTime.Today.DayOfWeek;
-            TodaySchedule messageJson = new TodaySchedule()
-            {
-                From = TimeSpan.Zero,
-                Till = TimeSpan.Zero
-            };
-
-            if (workPatternPart.Day == dayOfWeekToday)
-            {
-                messageJson.From = workPatternPart.StartTime;
-                messageJson.Till = workPatternPart.EndTime;
-            }
-            else
-            {
-                messageJson = null;
-            }
-
-            if (messageJson != null)
-            {
-                _todayList.Add(messageJson);
-            }
-        }
+        {}
         private async Task<bool> CheckIfInsideWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
         {

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:185:17
                 Till = TimeSpan.Zero
             };
 
-            if (workPatternPart.Day == dayOfWeekToday)
+            if (workPatternPart.Day != dayOfWeekToday)
             {
                 messageJson.From = workPatternPart.StartTime;

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:186:13
             };
 
             if (workPatternPart.Day == dayOfWeekToday)
-            {
-                messageJson.From = workPatternPart.StartTime;
-                messageJson.Till = workPatternPart.EndTime;
-            }
+            {}
             else
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:191:13
                 messageJson.Till = workPatternPart.EndTime;
             }
             else
-            {
-                messageJson = null;
-            }
+            {}
 
             if (messageJson != null)

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:195:17
                 messageJson = null;
             }
 
-            if (messageJson != null)
+            if (messageJson == null)
             {
                 _todayList.Add(messageJson);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:196:13
             }
 
             if (messageJson != null)
-            {
-                _todayList.Add(messageJson);
-            }
+            {}
         }
         private async Task<bool> CheckIfInsideWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:197:17
 
             if (messageJson != null)
             {
-                _todayList.Add(messageJson);
+                ;
             }
         }

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:207:17
             DateTime? endWorkPattern = workPattern.EndDate;
             bool insideWorkPattern;
 
-            if (today >= beginWorkPattern & today <= endWorkPattern)
+            if (today < beginWorkPattern & today <= endWorkPattern)
             {
                 insideWorkPattern = true;

[Killed] Bitwise mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:207:17
             DateTime? endWorkPattern = workPattern.EndDate;
             bool insideWorkPattern;
 
-            if (today >= beginWorkPattern & today <= endWorkPattern)
+            if (today >= beginWorkPattern | today <= endWorkPattern)
             {
                 insideWorkPattern = true;
