[Killed] Boolean mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:209:37
 
             if (today >= beginWorkPattern & today <= endWorkPattern)
             {
-                insideWorkPattern = true;
+                insideWorkPattern = false;
             }
             else

[Killed] Boolean mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:213:37
             }
             else
             {
-                insideWorkPattern = false;
+                insideWorkPattern = true;
             }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:220:9
 
         }
         public async Task CheckTodayAbsentsAsync(List<Absent> listAllAbsents, CancellationToken cancellationToken)
-        {
-
-            int todayDayOfYear = DateTime.UtcNow.DayOfYear;
-            DayOfWeek todayDayOfWeek = DateTime.UtcNow.DayOfWeek;
-
-            List<AbsentEachDay> absentEachDay = listAllAbsents
-               .GroupBy(p => p.StartDate.DayOfYear)
-               .Select(g => new AbsentEachDay(g.Key, g.Select(x => x.UserId).ToList()))
-               .ToList();
-
-            _listAbsentEachDay = absentEachDay.FirstOrDefault(x => x.DayOfYear == todayDayOfYear);
-            _listAllAbsents = listAllAbsents;
-
-        }
+        {}
         public async Task<List<WorkPatternPart>> CheckIfPartSplitAsync(List<WorkPatternPart> listWorkPatternParts, List<Absent> absents, int userId, CancellationToken cancellationToken)
         {

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:230:68
                .Select(g => new AbsentEachDay(g.Key, g.Select(x => x.UserId).ToList()))
                .ToList();
 
-            _listAbsentEachDay = absentEachDay.FirstOrDefault(x => x.DayOfYear == todayDayOfYear);
+            _listAbsentEachDay = absentEachDay.FirstOrDefault(x => x.DayOfYear != todayDayOfYear);
             _listAllAbsents = listAllAbsents;
 

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
miguel-pvs/employee_api/Infrastructure/UnsService.cs:230:34
                .Select(g => new AbsentEachDay(g.Key, g.Select(x => x.UserId).ToList()))
                .ToList();
 
-            _listAbsentEachDay = absentEachDay.FirstOrDefault(x => x.DayOfYear == todayDayOfYear);
+            _listAbsentEachDay = absentEachDay.First(x => x.DayOfYear == todayDayOfYear);
             _listAllAbsents = listAllAbsents;
 

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:242:29
             var finalListWorkPatternParts = new List<WorkPatternPart>();
 
             List<Absent> listAbsentToday = absents
-                .Where(x => x.StartDate.Date == today)
+                .Where(x => x.StartDate.Date != today)
                 .Where(x => x.UserId == userId)
                 .ToList();

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:243:29
 
             List<Absent> listAbsentToday = absents
                 .Where(x => x.StartDate.Date == today)
-                .Where(x => x.UserId == userId)
+                .Where(x => x.UserId != userId)
                 .ToList();
 

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:255:17
                     StartTime = workPatternPart.StartTime,
                     EndTime = workPatternPart.EndTime,
                 };
-                newListWorkPatternPartsToAdd.Add(workPatternPartToAdd);
+                ;
                 newListWorkPatternPartsFOR.Add(workPatternPartToAdd);
 

[Survived] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:256:17
                     EndTime = workPatternPart.EndTime,
                 };
                 newListWorkPatternPartsToAdd.Add(workPatternPartToAdd);
-                newListWorkPatternPartsFOR.Add(workPatternPartToAdd);
+                ;
 
                 if (workPatternPart.Day == DateTime.Today.DayOfWeek)

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:258:21
                 newListWorkPatternPartsToAdd.Add(workPatternPartToAdd);
                 newListWorkPatternPartsFOR.Add(workPatternPartToAdd);
 
-                if (workPatternPart.Day == DateTime.Today.DayOfWeek)
+                if (workPatternPart.Day != DateTime.Today.DayOfWeek)
                 {
                     if (listAbsentToday.Any())

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:259:17
                 newListWorkPatternPartsFOR.Add(workPatternPartToAdd);
 
                 if (workPatternPart.Day == DateTime.Today.DayOfWeek)
-                {
-                    if (listAbsentToday.Any())
-                    {
-                        int indexTodaySchedule = 0;
-                        finalListWorkPatternParts = await BreakWorkPatternAsync(listAbsentToday, newListWorkPatternPartsToAdd, newListWorkPatternPartsFOR, indexTodaySchedule, cancellationToken);
-                    }
-                    else
-                    {
-                        return newListWorkPatternPartsToAdd;
-                    }
-                }
+                {}
                 else
                 {

[Killed] Negate expression
miguel-pvs/employee_api/Infrastructure/UnsService.cs:260:25
 
                 if (workPatternPart.Day == DateTime.Today.DayOfWeek)
                 {
-                    if (listAbsentToday.Any())
+                    if (!(listAbsentToday.Any()))
                     {
                         int indexTodaySchedule = 0;

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:261:21
                 if (workPatternPart.Day == DateTime.Today.DayOfWeek)
                 {
                     if (listAbsentToday.Any())
-                    {
-                        int indexTodaySchedule = 0;
-                        finalListWorkPatternParts = await BreakWorkPatternAsync(listAbsentToday, newListWorkPatternPartsToAdd, newListWorkPatternPartsFOR, indexTodaySchedule, cancellationToken);
-                    }
+                    {}
                     else
                     {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:266:21
                         finalListWorkPatternParts = await BreakWorkPatternAsync(listAbsentToday, newListWorkPatternPartsToAdd, newListWorkPatternPartsFOR, indexTodaySchedule, cancellationToken);
                     }
                     else
-                    {
-                        return newListWorkPatternPartsToAdd;
-                    }
+                    {}
                 }
                 else

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:287:13
             TimeSpan endAbsent = absent.EndDate.TimeOfDay;
  
 
-            newListWorkPatternPartFOR.Clear();
+            ;
             foreach (var part in newListWorkPatternPartToAdd)
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:289:13
 
             newListWorkPatternPartFOR.Clear();
             foreach (var part in newListWorkPatternPartToAdd)
-            {
-                newListWorkPatternPartFOR.Add(part);
-            }
+            {}
 
             foreach (var part in newListWorkPatternPartFOR)

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:290:17
             newListWorkPatternPartFOR.Clear();
             foreach (var part in newListWorkPatternPartToAdd)
             {
-                newListWorkPatternPartFOR.Add(part);
+                ;
             }
 

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:298:103
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart <= endAbsent) & (endPart < startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:298:76
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart > endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:299:17
                 TimeSpan endPart = part.EndTime;
 
                 if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
-                {
-                    newListWorkPatternPartToAdd.Remove(part);
-                    part.StartTime = endAbsent;
-                    newListWorkPatternPartToAdd.Add(part);
-                }
+                {}
                 else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
                 {

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:300:21
 
                 if ((startPart >= startAbsent) & (endPart >= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
                 {
-                    newListWorkPatternPartToAdd.Remove(part);
+                    ;
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:302:21
                 {
                     newListWorkPatternPartToAdd.Remove(part);
                     part.StartTime = endAbsent;
-                    newListWorkPatternPartToAdd.Add(part);
+                    ;
                 }
                 else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))

[Killed] Bitwise mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:304:26
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) | (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:304:81
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart > endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:305:17
                     newListWorkPatternPartToAdd.Add(part);
                 }
                 else if ((startPart <= startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
-                {
-                    newListWorkPatternPartToAdd.Remove(part);
-                    part.EndTime = startAbsent;
-                    newListWorkPatternPartToAdd.Add(part);
-                }
+                {}
                 else if ((startPart <= startAbsent) & (endPart >= endAbsent))
                 {

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:308:21
                 {
                     newListWorkPatternPartToAdd.Remove(part);
                     part.EndTime = startAbsent;
-                    newListWorkPatternPartToAdd.Add(part);
+                    ;
                 }
                 else if ((startPart <= startAbsent) & (endPart >= endAbsent))

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:310:56
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart <= startAbsent) & (endPart >= endAbsent))
+                else if ((startPart <= startAbsent) & (endPart < endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Bitwise mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:310:26
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart <= startAbsent) & (endPart >= endAbsent))
+                else if ((startPart <= startAbsent) | (endPart >= endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:311:17
                     newListWorkPatternPartToAdd.Add(part);
                 }
                 else if ((startPart <= startAbsent) & (endPart >= endAbsent))
-                {
-                    newListWorkPatternPartToAdd.Remove(part);
-
-                    var partSplit1 = new WorkPatternPart
-                    {
-                        Id = new Guid(),
-                        Day = part.Day,
-                        StartTime = startPart,
-                        EndTime = startAbsent,
-                    };
-
-                    var partSplit2 = new WorkPatternPart
-                    {
-                        Id = new Guid(),
-                        Day = part.Day,
-                        StartTime = endAbsent,
-                        EndTime = endPart,
-                     };
-                    newListWorkPatternPartToAdd.Add(partSplit1);
-                    newListWorkPatternPartToAdd.Add(partSplit2);
-                }
+                {}
                 else if ((startPart >= startAbsent) & (startPart <= endAbsent))
                 {

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:329:21
                         StartTime = endAbsent,
                         EndTime = endPart,
                      };
-                    newListWorkPatternPartToAdd.Add(partSplit1);
+                    ;
                     newListWorkPatternPartToAdd.Add(partSplit2);
                 }

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:330:21
                         EndTime = endPart,
                      };
                     newListWorkPatternPartToAdd.Add(partSplit1);
-                    newListWorkPatternPartToAdd.Add(partSplit2);
+                    ;
                 }
                 else if ((startPart >= startAbsent) & (startPart <= endAbsent))

[Killed] Bitwise mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:332:26
                     newListWorkPatternPartToAdd.Add(partSplit1);
                     newListWorkPatternPartToAdd.Add(partSplit2);
                 }
-                else if ((startPart >= startAbsent) & (startPart <= endAbsent))
+                else if ((startPart >= startAbsent) | (startPart <= endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:332:56
                     newListWorkPatternPartToAdd.Add(partSplit1);
                     newListWorkPatternPartToAdd.Add(partSplit2);
                 }
-                else if ((startPart >= startAbsent) & (startPart <= endAbsent))
+                else if ((startPart >= startAbsent) & (startPart > endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:333:17
                     newListWorkPatternPartToAdd.Add(partSplit2);
                 }
                 else if ((startPart >= startAbsent) & (startPart <= endAbsent))
-                {
-                    newListWorkPatternPartToAdd.Remove(part);
-                }
+                {}
             }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:338:13
                 }
             }
 
-            indexAbsent += 1;
+            indexAbsent -= 1;
             if (indexAbsent < numberAbsent)
             {

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:339:17
             }
 
             indexAbsent += 1;
-            if (indexAbsent < numberAbsent)
+            if (indexAbsent <= numberAbsent)
             {
                 newListWorkPatternPartFOR.Clear();

[Killed] Negate expression
miguel-pvs/employee_api/Infrastructure/UnsService.cs:339:17
             }
 
             indexAbsent += 1;
-            if (indexAbsent < numberAbsent)
+            if (!(indexAbsent < numberAbsent))
             {
                 newListWorkPatternPartFOR.Clear();

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:340:13
 
             indexAbsent += 1;
             if (indexAbsent < numberAbsent)
-            {
-                newListWorkPatternPartFOR.Clear();
-                foreach (var part in newListWorkPatternPartToAdd)
-                {
-                    newListWorkPatternPartFOR.Add(part);
-                }
-                newListWorkPatternPartToAdd = await BreakWorkPatternAsync(listAbsentToday, newListWorkPatternPartToAdd, newListWorkPatternPartFOR, indexAbsent, cancellationToken);
-                return newListWorkPatternPartToAdd;
-            }
+            {}
             else
             {

[Survived] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:341:17
             indexAbsent += 1;
             if (indexAbsent < numberAbsent)
             {
-                newListWorkPatternPartFOR.Clear();
+                ;
                 foreach (var part in newListWorkPatternPartToAdd)
                 {

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:350:13
                 return newListWorkPatternPartToAdd;
             }
             else
-            {
-                return newListWorkPatternPartToAdd;
-            }
+            {}
         }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:359:17
             var from = today.From;
             var till = today.Till;
 
-            if (!newListTodayToAdd.Any())
+            if (newListTodayToAdd.Any())
             {
                 newListTodayToAdd.Add(today);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:360:13
             var till = today.Till;
 
             if (!newListTodayToAdd.Any())
-            {
-                newListTodayToAdd.Add(today);
-                previousToday = today;
-                return (newListTodayToAdd, previousToday);
-            }
+            {}
 
             var fromPrevious = previousToday.From;

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:361:17
 
             if (!newListTodayToAdd.Any())
             {
-                newListTodayToAdd.Add(today);
+                ;
                 previousToday = today;
                 return (newListTodayToAdd, previousToday);

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Infrastructure/UnsService.cs:369:33
             var fromPrevious = previousToday.From;
             var tillPrevious = previousToday.Till;
 
-            newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.Till).ToList();
+            newListTodayToAdd = newListTodayToAdd.OrderByDescending(x => x.Till).ToList();
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.From).ToList();
 

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Infrastructure/UnsService.cs:370:33
             var tillPrevious = previousToday.Till;
 
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.Till).ToList();
-            newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.From).ToList();
+            newListTodayToAdd = newListTodayToAdd.OrderByDescending(x => x.From).ToList();
 
             if (from <= tillPrevious & till >= fromPrevious & till >= tillPrevious)

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:372:40
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.Till).ToList();
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.From).ToList();
 
-            if (from <= tillPrevious & till >= fromPrevious & till >= tillPrevious)
+            if (from <= tillPrevious & till < fromPrevious & till >= tillPrevious)
             {
                 newListTodayToAdd.Remove(previousToday);

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:372:17
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.Till).ToList();
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.From).ToList();
 
-            if (from <= tillPrevious & till >= fromPrevious & till >= tillPrevious)
+            if (from < tillPrevious & till >= fromPrevious & till >= tillPrevious)
             {
                 newListTodayToAdd.Remove(previousToday);

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:373:13
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.From).ToList();
 
             if (from <= tillPrevious & till >= fromPrevious & till >= tillPrevious)
-            {
-                newListTodayToAdd.Remove(previousToday);
-                previousToday.From = fromPrevious;
-                previousToday.Till = till;
-                newListTodayToAdd.Add(previousToday);
-            }
+            {}
             else if (till <= tillPrevious)
             {

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:374:17
 
             if (from <= tillPrevious & till >= fromPrevious & till >= tillPrevious)
             {
-                newListTodayToAdd.Remove(previousToday);
+                ;
                 previousToday.From = fromPrevious;
                 previousToday.Till = till;

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:377:17
                 newListTodayToAdd.Remove(previousToday);
                 previousToday.From = fromPrevious;
                 previousToday.Till = till;
-                newListTodayToAdd.Add(previousToday);
+                ;
             }
             else if (till <= tillPrevious)

[Killed] Negate expression
miguel-pvs/employee_api/Infrastructure/UnsService.cs:379:22
                 previousToday.Till = till;
                 newListTodayToAdd.Add(previousToday);
             }
-            else if (till <= tillPrevious)
+            else if (!(till <= tillPrevious))
             {
             }

[Killed] Equality mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:379:22
                 previousToday.Till = till;
                 newListTodayToAdd.Add(previousToday);
             }
-            else if (till <= tillPrevious)
+            else if (till > tillPrevious)
             {
             }

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:383:13
             {
             }
             else
-            {
-                newListTodayToAdd.Add(today);
-                previousToday = today;
-            }
+            {}
             return (newListTodayToAdd,previousToday);
         }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:390:9
             return (newListTodayToAdd,previousToday);
         }
         public async Task PostAllLocationAsync(List<UsersEachLocation> location, CancellationToken cancellationToken)
-        {
-            foreach (UsersEachLocation loc in location)
-                await PublishLocationAsync(loc, loc.OfficeLocation, cancellationToken);
-        }
+        {}
         public async Task PublishScheduleToWorkNowAsync(int id, bool varScheduleToWorkNow, CancellationToken cancellationToken)
         {

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:392:17
         public async Task PostAllLocationAsync(List<UsersEachLocation> location, CancellationToken cancellationToken)
         {
             foreach (UsersEachLocation loc in location)
-                await PublishLocationAsync(loc, loc.OfficeLocation, cancellationToken);
+                ;
         }
         public async Task PublishScheduleToWorkNowAsync(int id, bool varScheduleToWorkNow, CancellationToken cancellationToken)

[Survived] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:395:9
                 await PublishLocationAsync(loc, loc.OfficeLocation, cancellationToken);
         }
         public async Task PublishScheduleToWorkNowAsync(int id, bool varScheduleToWorkNow, CancellationToken cancellationToken)
-        {
-            SchedulePayLoad workNow = new SchedulePayLoad();
-            if (varScheduleToWorkNow is true)
-            {
-                workNow.Value = true;
-                workNow.Timestamp = DateTime.UtcNow;
-
-            }
-            else
-            {
-                workNow.Value = false;
-                workNow.Timestamp = DateTime.UtcNow;
-            }
-
-            string messageJson = JsonConvert.SerializeObject(workNow);
-            string topic = $"users/{Convert.ToString(id)}/pvs/Schedule";
-            await PublishOnTopicAsync(messageJson, topic, cancellationToken);
-        }
+        {}
         public async Task PublishTodayScheduleAsync(int id, List<TodaySchedule> todayList, CancellationToken cancellationToken)
 

[Survived] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:398:13
         {
             SchedulePayLoad workNow = new SchedulePayLoad();
             if (varScheduleToWorkNow is true)
-            {
-                workNow.Value = true;
-                workNow.Timestamp = DateTime.UtcNow;
-
-            }
+            {}
             else
             {

[Survived] Boolean mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:399:33
             SchedulePayLoad workNow = new SchedulePayLoad();
             if (varScheduleToWorkNow is true)
             {
-                workNow.Value = true;
+                workNow.Value = false;
                 workNow.Timestamp = DateTime.UtcNow;
 

[Survived] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:404:13
 
             }
             else
-            {
-                workNow.Value = false;
-                workNow.Timestamp = DateTime.UtcNow;
-            }
+            {}
 
             string messageJson = JsonConvert.SerializeObject(workNow);

[Survived] Boolean mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:405:33
             }
             else
             {
-                workNow.Value = false;
+                workNow.Value = true;
                 workNow.Timestamp = DateTime.UtcNow;
             }

[Survived] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:411:13
 
             string messageJson = JsonConvert.SerializeObject(workNow);
             string topic = $"users/{Convert.ToString(id)}/pvs/Schedule";
-            await PublishOnTopicAsync(messageJson, topic, cancellationToken);
+            ;
         }
         public async Task PublishTodayScheduleAsync(int id, List<TodaySchedule> todayList, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:415:9
         }
         public async Task PublishTodayScheduleAsync(int id, List<TodaySchedule> todayList, CancellationToken cancellationToken)
 
-        {
-            string todaySchedule = JsonConvert.SerializeObject(todayList);
-            string topic = $"users/{Convert.ToString(id)}/pvs/Schedule/today";
-            await PublishOnTopicAsync(todaySchedule, topic, cancellationToken);
-        }
+        {}
         public async Task PublishLocationAsync(UsersEachLocation location, int officeLocationId, CancellationToken cancellationToken)
 

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:418:13
         {
             string todaySchedule = JsonConvert.SerializeObject(todayList);
             string topic = $"users/{Convert.ToString(id)}/pvs/Schedule/today";
-            await PublishOnTopicAsync(todaySchedule, topic, cancellationToken);
+            ;
         }
         public async Task PublishLocationAsync(UsersEachLocation location, int officeLocationId, CancellationToken cancellationToken)
