[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:422:9
         }
         public async Task PublishLocationAsync(UsersEachLocation location, int officeLocationId, CancellationToken cancellationToken)
 
-        {
-            List<int> payLoad = new List<int>();
-            string combinedPayLoad = "";
-
-            if (location is not null)
-            {
-                payLoad = location.UserIds;
-                combinedPayLoad = JsonConvert.SerializeObject(payLoad);
-            }
-
-            string topic = $"locations/{Convert.ToString(officeLocationId)}/pvs/mechanics";
-            await PublishOnTopicAsync(combinedPayLoad, topic, cancellationToken);
-        }
+        {}
 
         private Task PublishOnTopicAsync(string payLoad, string topic, CancellationToken cancellationToken)        

[Killed] Block removal mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:427:13
             string combinedPayLoad = "";
 
             if (location is not null)
-            {
-                payLoad = location.UserIds;
-                combinedPayLoad = JsonConvert.SerializeObject(payLoad);
-            }
+            {}
 
             string topic = $"locations/{Convert.ToString(officeLocationId)}/pvs/mechanics";

[Killed] Statement mutation
miguel-pvs/employee_api/Infrastructure/UnsService.cs:433:13
             }
 
             string topic = $"locations/{Convert.ToString(officeLocationId)}/pvs/mechanics";
-            await PublishOnTopicAsync(combinedPayLoad, topic, cancellationToken);
+            ;
         }
 
