[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:11:9
     {
 
         public override TimeSpan? Read(ref Utf8JsonReader reader, Type typeToConvert, JsonSerializerOptions options)
-        {
-            if (typeToConvert is null)
-            {
-                throw new ArgumentNullException(nameof(typeToConvert));
-            }
-
-            if (options is null)
-            {
-                throw new ArgumentNullException(nameof(options));
-            }
-
-            return TimeSpan.FromTicks(reader.GetInt64());
-        }
+        {}
 
         public override void Write(Utf8JsonWriter writer, TimeSpan? value, JsonSerializerOptions options)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:13:13
         public override TimeSpan? Read(ref Utf8JsonReader reader, Type typeToConvert, JsonSerializerOptions options)
         {
             if (typeToConvert is null)
-            {
-                throw new ArgumentNullException(nameof(typeToConvert));
-            }
+            {}
 
             if (options is null)

[NoCoverage] Statement mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:14:17
         {
             if (typeToConvert is null)
             {
-                throw new ArgumentNullException(nameof(typeToConvert));
+                ;
             }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:18:13
             }
 
             if (options is null)
-            {
-                throw new ArgumentNullException(nameof(options));
-            }
+            {}
 
             return TimeSpan.FromTicks(reader.GetInt64());

[NoCoverage] Statement mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:19:17
 
             if (options is null)
             {
-                throw new ArgumentNullException(nameof(options));
+                ;
             }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:26:9
         }
 
         public override void Write(Utf8JsonWriter writer, TimeSpan? value, JsonSerializerOptions options)
-        {
-            if (writer is null)
-            {
-                throw new ArgumentNullException(nameof(writer));
-            }
-
-            if (options is null)
-            {
-                throw new ArgumentNullException(nameof(options));
-            }
-            if (value.HasValue)
-            {
-                writer.WriteNumberValue(value.Value.Ticks);
-            }
-            else
-            {
-                writer.WriteNullValue();
-            }
-
-        }
+        {}
     }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:28:13
         public override void Write(Utf8JsonWriter writer, TimeSpan? value, JsonSerializerOptions options)
         {
             if (writer is null)
-            {
-                throw new ArgumentNullException(nameof(writer));
-            }
+            {}
 
             if (options is null)

[NoCoverage] Statement mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:29:17
         {
             if (writer is null)
             {
-                throw new ArgumentNullException(nameof(writer));
+                ;
             }
 

[NoCoverage] Negate expression
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:36:17
             {
                 throw new ArgumentNullException(nameof(options));
             }
-            if (value.HasValue)
+            if (!(value.HasValue))
             {
                 writer.WriteNumberValue(value.Value.Ticks);

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:37:13
                 throw new ArgumentNullException(nameof(options));
             }
             if (value.HasValue)
-            {
-                writer.WriteNumberValue(value.Value.Ticks);
-            }
+            {}
             else
             {

[NoCoverage] Statement mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:38:17
             }
             if (value.HasValue)
             {
-                writer.WriteNumberValue(value.Value.Ticks);
+                ;
             }
             else

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:41:13
                 writer.WriteNumberValue(value.Value.Ticks);
             }
             else
-            {
-                writer.WriteNullValue();
-            }
+            {}
 
         }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/JsonConverter/NullableTimeSpanJsonConverter.cs:42:17
             }
             else
             {
-                writer.WriteNullValue();
+                ;
             }
 
