[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/TimeSpanJsonConverter.cs:11:9
     {
 
         public override TimeSpan Read(ref Utf8JsonReader reader, Type typeToConvert, JsonSerializerOptions options)
-        {
-            if (typeToConvert is null)
-            {
-                throw new ArgumentNullException(nameof(typeToConvert));
-            }
-
-            if (options is null)
-            {
-                throw new ArgumentNullException(nameof(options));
-            }
-
-            return TimeSpan.FromTicks(reader.GetInt64());
-        }
+        {}
 
         public override void Write(Utf8JsonWriter writer, TimeSpan value, JsonSerializerOptions options)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/JsonConverter/TimeSpanJsonConverter.cs:26:9
         }
 
         public override void Write(Utf8JsonWriter writer, TimeSpan value, JsonSerializerOptions options)
-        {
-            if (writer is null)
-            {
-                throw new ArgumentNullException(nameof(writer));
-            }
-
-            if (options is null)
-            {
-                throw new ArgumentNullException(nameof(options));
-            }
-
-            writer.WriteNumberValue(value.Ticks);
-        }
+        {}
     }
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/JsonConverter/TimeSpanJsonConverter.cs:37:13
                 throw new ArgumentNullException(nameof(options));
             }
 
-            writer.WriteNumberValue(value.Ticks);
+            ;
         }
     }
