[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:12:13
     {
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.CreateTable(
-                name: "Users",
-                columns: table => new
-                {
-                    Id = table.Column<int>(type: "INTEGER", nullable: false)
-                        .Annotation("Sqlite:Autoincrement", true),
-                    FirstName = table.Column<string>(type: "TEXT", nullable: false),
-                    OfficeLocation = table.Column<int>(type: "INTEGER", nullable: false),
-                    CheckedIn = table.Column<bool>(type: "INTEGER", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Users", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:16:71
                 name: "Users",
                 columns: table => new
                 {
-                    Id = table.Column<int>(type: "INTEGER", nullable: false)
+                    Id = table.Column<int>(type: "INTEGER", nullable: true)
                         .Annotation("Sqlite:Autoincrement", true),
                     FirstName = table.Column<string>(type: "TEXT", nullable: false),

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:17:61
                 columns: table => new
                 {
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
-                        .Annotation("Sqlite:Autoincrement", true),
+                        .Annotation("Sqlite:Autoincrement", false),
                     FirstName = table.Column<string>(type: "TEXT", nullable: false),
                     OfficeLocation = table.Column<int>(type: "INTEGER", nullable: false),

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:18:78
                 {
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
                         .Annotation("Sqlite:Autoincrement", true),
-                    FirstName = table.Column<string>(type: "TEXT", nullable: false),
+                    FirstName = table.Column<string>(type: "TEXT", nullable: true),
                     OfficeLocation = table.Column<int>(type: "INTEGER", nullable: false),
                     CheckedIn = table.Column<bool>(type: "INTEGER", nullable: false)

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:18:60
                 {
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
                         .Annotation("Sqlite:Autoincrement", true),
-                    FirstName = table.Column<string>(type: "TEXT", nullable: false),
+                    FirstName = table.Column<string>(type: "", nullable: false),
                     OfficeLocation = table.Column<int>(type: "INTEGER", nullable: false),
                     CheckedIn = table.Column<bool>(type: "INTEGER", nullable: false)

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:19:83
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
                         .Annotation("Sqlite:Autoincrement", true),
                     FirstName = table.Column<string>(type: "TEXT", nullable: false),
-                    OfficeLocation = table.Column<int>(type: "INTEGER", nullable: false),
+                    OfficeLocation = table.Column<int>(type: "INTEGER", nullable: true),
                     CheckedIn = table.Column<bool>(type: "INTEGER", nullable: false)
                 },

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:20:79
                         .Annotation("Sqlite:Autoincrement", true),
                     FirstName = table.Column<string>(type: "TEXT", nullable: false),
                     OfficeLocation = table.Column<int>(type: "INTEGER", nullable: false),
-                    CheckedIn = table.Column<bool>(type: "INTEGER", nullable: false)
+                    CheckedIn = table.Column<bool>(type: "INTEGER", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:23:17
                     CheckedIn = table.Column<bool>(type: "INTEGER", nullable: false)
                 },
                 constraints: table =>
-                {
-                    table.PrimaryKey("PK_Users", x => x.Id);
-                });
+                {});
 
             migrationBuilder.CreateTable(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:24:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Users", x => x.Id);
+                    ;
                 });
 

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:24:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Users", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:27:13
                     table.PrimaryKey("PK_Users", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "WorkPattern",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "TEXT", nullable: false),
-                    UserId = table.Column<int>(type: "INTEGER", nullable: false),
-                    StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
-                    EndDate = table.Column<DateTime>(type: "TEXT", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_WorkPattern", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_WorkPattern_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:31:69
                 name: "WorkPattern",
                 columns: table => new
                 {
-                    Id = table.Column<Guid>(type: "TEXT", nullable: false),
+                    Id = table.Column<Guid>(type: "TEXT", nullable: true),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:32:75
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
-                    UserId = table.Column<int>(type: "INTEGER", nullable: false),
+                    UserId = table.Column<int>(type: "INTEGER", nullable: true),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
                     EndDate = table.Column<DateTime>(type: "TEXT", nullable: true)

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:33:80
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
-                    StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
+                    StartDate = table.Column<DateTime>(type: "TEXT", nullable: true),
                     EndDate = table.Column<DateTime>(type: "TEXT", nullable: true)
                 },

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:34:78
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
-                    EndDate = table.Column<DateTime>(type: "TEXT", nullable: true)
+                    EndDate = table.Column<DateTime>(type: "TEXT", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:37:17
                     EndDate = table.Column<DateTime>(type: "TEXT", nullable: true)
                 },
                 constraints: table =>
-                {
-                    table.PrimaryKey("PK_WorkPattern", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_WorkPattern_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+                {});
 
             migrationBuilder.CreateTable(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:38:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_WorkPattern", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_WorkPattern_Users_UserId",

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:39:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_WorkPattern", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_WorkPattern_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:40:31
                 {
                     table.PrimaryKey("PK_WorkPattern", x => x.Id);
                     table.ForeignKey(
-                        name: "FK_WorkPattern_Users_UserId",
+                        name: "",
                         column: x => x.UserId,
                         principalTable: "Users",

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:47:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Absent",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "TEXT", nullable: false),
-                    UserId = table.Column<int>(type: "INTEGER", nullable: false),
-                    workPatternId = table.Column<Guid>(type: "TEXT", nullable: true),
-                    StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
-                    EndDate = table.Column<DateTime>(type: "TEXT", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Absent", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_Absent_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                    table.ForeignKey(
-                        name: "FK_Absent_WorkPattern_workPatternId",
-                        column: x => x.workPatternId,
-                        principalTable: "WorkPattern",
-                        principalColumn: "Id");
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:48:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "Absent",
+                name: "",
                 columns: table => new
                 {

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:52:54
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
-                    UserId = table.Column<int>(type: "INTEGER", nullable: false),
+                    UserId = table.Column<int>(type: "", nullable: false),
                     workPatternId = table.Column<Guid>(type: "TEXT", nullable: true),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:53:80
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
-                    workPatternId = table.Column<Guid>(type: "TEXT", nullable: true),
+                    workPatternId = table.Column<Guid>(type: "TEXT", nullable: false),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
                     EndDate = table.Column<DateTime>(type: "TEXT", nullable: false)

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:53:62
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
-                    workPatternId = table.Column<Guid>(type: "TEXT", nullable: true),
+                    workPatternId = table.Column<Guid>(type: "", nullable: true),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
                     EndDate = table.Column<DateTime>(type: "TEXT", nullable: false)

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:54:80
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
                     workPatternId = table.Column<Guid>(type: "TEXT", nullable: true),
-                    StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
+                    StartDate = table.Column<DateTime>(type: "TEXT", nullable: true),
                     EndDate = table.Column<DateTime>(type: "TEXT", nullable: false)
                 },

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:55:78
                     UserId = table.Column<int>(type: "INTEGER", nullable: false),
                     workPatternId = table.Column<Guid>(type: "TEXT", nullable: true),
                     StartDate = table.Column<DateTime>(type: "TEXT", nullable: false),
-                    EndDate = table.Column<DateTime>(type: "TEXT", nullable: false)
+                    EndDate = table.Column<DateTime>(type: "TEXT", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:58:17
                     EndDate = table.Column<DateTime>(type: "TEXT", nullable: false)
                 },
                 constraints: table =>
-                {
-                    table.PrimaryKey("PK_Absent", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_Absent_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                    table.ForeignKey(
-                        name: "FK_Absent_WorkPattern_workPatternId",
-                        column: x => x.workPatternId,
-                        principalTable: "WorkPattern",
-                        principalColumn: "Id");
-                });
+                {});
 
             migrationBuilder.CreateTable(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:59:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Absent", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_Absent_Users_UserId",

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:60:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_Absent", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_Absent_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                     table.ForeignKey(
                         name: "FK_Absent_WorkPattern_workPatternId",

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:66:21
                         principalTable: "Users",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);
-                    table.ForeignKey(
-                        name: "FK_Absent_WorkPattern_workPatternId",
-                        column: x => x.workPatternId,
-                        principalTable: "WorkPattern",
-                        principalColumn: "Id");
+                    ;
                 });
 

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:69:41
                     table.ForeignKey(
                         name: "FK_Absent_WorkPattern_workPatternId",
                         column: x => x.workPatternId,
-                        principalTable: "WorkPattern",
+                        principalTable: "",
                         principalColumn: "Id");
                 });

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:70:42
                         name: "FK_Absent_WorkPattern_workPatternId",
                         column: x => x.workPatternId,
                         principalTable: "WorkPattern",
-                        principalColumn: "Id");
+                        principalColumn: "");
                 });
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:73:13
                         principalColumn: "Id");
                 });
 
-            migrationBuilder.CreateTable(
-                name: "WorkPatternPart",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "TEXT", nullable: false),
-                    Day = table.Column<int>(type: "INTEGER", nullable: false),
-                    StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
-                    EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
-                    WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_WorkPatternPart", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_WorkPatternPart_WorkPattern_WorkPatternId",
-                        column: x => x.WorkPatternId,
-                        principalTable: "WorkPattern",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:74:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "WorkPatternPart",
+                name: "",
                 columns: table => new
                 {

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:78:72
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
-                    Day = table.Column<int>(type: "INTEGER", nullable: false),
+                    Day = table.Column<int>(type: "INTEGER", nullable: true),
                     StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
                     EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:79:80
                 {
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     Day = table.Column<int>(type: "INTEGER", nullable: false),
-                    StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
+                    StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: true),
                     EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
                     WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: true)

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:80:78
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     Day = table.Column<int>(type: "INTEGER", nullable: false),
                     StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
-                    EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
+                    EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: true),
                     WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: true)
                 },

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:80:60
                     Id = table.Column<Guid>(type: "TEXT", nullable: false),
                     Day = table.Column<int>(type: "INTEGER", nullable: false),
                     StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
-                    EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
+                    EndTime = table.Column<TimeSpan>(type: "", nullable: false),
                     WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: true)
                 },

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:81:80
                     Day = table.Column<int>(type: "INTEGER", nullable: false),
                     StartTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
                     EndTime = table.Column<TimeSpan>(type: "TEXT", nullable: false),
-                    WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: true)
+                    WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:84:17
                     WorkPatternId = table.Column<Guid>(type: "TEXT", nullable: true)
                 },
                 constraints: table =>
-                {
-                    table.PrimaryKey("PK_WorkPatternPart", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_WorkPatternPart_WorkPattern_WorkPatternId",
-                        column: x => x.WorkPatternId,
-                        principalTable: "WorkPattern",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+                {});
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:85:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_WorkPatternPart", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_WorkPatternPart_WorkPattern_WorkPatternId",

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:86:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_WorkPatternPart", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_WorkPatternPart_WorkPattern_WorkPatternId",
-                        column: x => x.WorkPatternId,
-                        principalTable: "WorkPattern",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:89:41
                     table.ForeignKey(
                         name: "FK_WorkPatternPart_WorkPattern_WorkPatternId",
                         column: x => x.WorkPatternId,
-                        principalTable: "WorkPattern",
+                        principalTable: "",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:94:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateIndex(
-                name: "IX_Absent_UserId",
-                table: "Absent",
-                column: "UserId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:97:25
             migrationBuilder.CreateIndex(
                 name: "IX_Absent_UserId",
                 table: "Absent",
-                column: "UserId");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:99:13
                 table: "Absent",
                 column: "UserId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_Absent_workPatternId",
-                table: "Absent",
-                column: "workPatternId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:100:23
                 column: "UserId");
 
             migrationBuilder.CreateIndex(
-                name: "IX_Absent_workPatternId",
+                name: "",
                 table: "Absent",
                 column: "workPatternId");

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:102:25
             migrationBuilder.CreateIndex(
                 name: "IX_Absent_workPatternId",
                 table: "Absent",
-                column: "workPatternId");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:104:13
                 table: "Absent",
                 column: "workPatternId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_WorkPattern_UserId",
-                table: "WorkPattern",
-                column: "UserId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:105:23
                 column: "workPatternId");
 
             migrationBuilder.CreateIndex(
-                name: "IX_WorkPattern_UserId",
+                name: "",
                 table: "WorkPattern",
                 column: "UserId");

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:109:13
                 table: "WorkPattern",
                 column: "UserId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_WorkPatternPart_WorkPatternId",
-                table: "WorkPatternPart",
-                column: "WorkPatternId");
+            ;
         }
 

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:111:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_WorkPatternPart_WorkPatternId",
-                table: "WorkPatternPart",
+                table: "",
                 column: "WorkPatternId");
         }
