[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:112:25
             migrationBuilder.CreateIndex(
                 name: "IX_WorkPatternPart_WorkPatternId",
                 table: "WorkPatternPart",
-                column: "WorkPatternId");
+                column: "");
         }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:116:9
         }
 
         protected override void Down(MigrationBuilder migrationBuilder)
-        {
-            migrationBuilder.DropTable(
-                name: "Absent");
-
-            migrationBuilder.DropTable(
-                name: "WorkPatternPart");
-
-            migrationBuilder.DropTable(
-                name: "WorkPattern");
-
-            migrationBuilder.DropTable(
-                name: "Users");
-        }
+        {}
     }
 }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:117:13
 
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropTable(
-                name: "Absent");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:120:13
             migrationBuilder.DropTable(
                 name: "Absent");
 
-            migrationBuilder.DropTable(
-                name: "WorkPatternPart");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:121:23
                 name: "Absent");
 
             migrationBuilder.DropTable(
-                name: "WorkPatternPart");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:123:13
             migrationBuilder.DropTable(
                 name: "WorkPatternPart");
 
-            migrationBuilder.DropTable(
-                name: "WorkPattern");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:126:13
             migrationBuilder.DropTable(
                 name: "WorkPattern");
 
-            migrationBuilder.DropTable(
-                name: "Users");
+            ;
         }
     }

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221024082434_InitialMigration.cs:127:23
                 name: "WorkPattern");
 
             migrationBuilder.DropTable(
-                name: "Users");
+                name: "");
         }
     }
