[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:11:9
     public partial class _1111 : Migration
     {
         protected override void Up(MigrationBuilder migrationBuilder)
-        {
-            migrationBuilder.DropForeignKey(
-                name: "FK_Absent_WorkPattern_workPatternId",
-                table: "Absent");
-
-            migrationBuilder.DropIndex(
-                name: "IX_Absent_workPatternId",
-                table: "Absent");
-
-            migrationBuilder.DropColumn(
-                name: "workPatternId",
-                table: "Absent");
-        }
+        {}
 
         protected override void Down(MigrationBuilder migrationBuilder)

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:12:13
     {
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropForeignKey(
-                name: "FK_Absent_WorkPattern_workPatternId",
-                table: "Absent");
+            ;
 
             migrationBuilder.DropIndex(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:13:23
         protected override void Up(MigrationBuilder migrationBuilder)
         {
             migrationBuilder.DropForeignKey(
-                name: "FK_Absent_WorkPattern_workPatternId",
+                name: "",
                 table: "Absent");
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:16:13
                 name: "FK_Absent_WorkPattern_workPatternId",
                 table: "Absent");
 
-            migrationBuilder.DropIndex(
-                name: "IX_Absent_workPatternId",
-                table: "Absent");
+            ;
 
             migrationBuilder.DropColumn(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:20:13
                 name: "IX_Absent_workPatternId",
                 table: "Absent");
 
-            migrationBuilder.DropColumn(
-                name: "workPatternId",
-                table: "Absent");
+            ;
         }
 

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:22:24
 
             migrationBuilder.DropColumn(
                 name: "workPatternId",
-                table: "Absent");
+                table: "");
         }
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:26:9
         }
 
         protected override void Down(MigrationBuilder migrationBuilder)
-        {
-            migrationBuilder.AddColumn<Guid>(
-                name: "workPatternId",
-                table: "Absent",
-                type: "TEXT",
-                nullable: true);
-
-            migrationBuilder.CreateIndex(
-                name: "IX_Absent_workPatternId",
-                table: "Absent",
-                column: "workPatternId");
-
-            migrationBuilder.AddForeignKey(
-                name: "FK_Absent_WorkPattern_workPatternId",
-                table: "Absent",
-                column: "workPatternId",
-                principalTable: "WorkPattern",
-                principalColumn: "Id");
-        }
+        {}
     }
 }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:27:13
 
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.AddColumn<Guid>(
-                name: "workPatternId",
-                table: "Absent",
-                type: "TEXT",
-                nullable: true);
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:29:24
         {
             migrationBuilder.AddColumn<Guid>(
                 name: "workPatternId",
-                table: "Absent",
+                table: "",
                 type: "TEXT",
                 nullable: true);

[NoCoverage] Boolean mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:31:27
                 name: "workPatternId",
                 table: "Absent",
                 type: "TEXT",
-                nullable: true);
+                nullable: false);
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:38:13
                 table: "Absent",
                 column: "workPatternId");
 
-            migrationBuilder.AddForeignKey(
-                name: "FK_Absent_WorkPattern_workPatternId",
-                table: "Absent",
-                column: "workPatternId",
-                principalTable: "WorkPattern",
-                principalColumn: "Id");
+            ;
         }
     }

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:39:23
                 column: "workPatternId");
 
             migrationBuilder.AddForeignKey(
-                name: "FK_Absent_WorkPattern_workPatternId",
+                name: "",
                 table: "Absent",
                 column: "workPatternId",

[NoCoverage] String mutation
miguel-pvs/employee_api/Migrations/20221026115358_1111.cs:41:25
             migrationBuilder.AddForeignKey(
                 name: "FK_Absent_WorkPattern_workPatternId",
                 table: "Absent",
-                column: "workPatternId",
+                column: "",
                 principalTable: "WorkPattern",
                 principalColumn: "Id");
