[Killed] Block removal mutation
miguel-pvs/employee_api/Models/AbsentEachDay.cs:9:9
         public List<int> ListIds { get; set; }
 
         public AbsentEachDay(int dayOfYear, List<int> listIds)
-        {
-            DayOfYear = dayOfYear;
-            ListIds = listIds;
-        }
+        {}
 
     }
