[Survived] Block removal mutation
miguel-pvs/employee_api/Models/UsersEachLocation.cs:9:9
         public List<int> UserIds { get; set; }
 
         public UsersEachLocation(int officeLocation, List<int> userIds)
-        {
-            OfficeLocation = officeLocation;
-            UserIds = userIds;
-        }
+        {}
     }
 }
