[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:11:9
     {
         private readonly AppDbContext _context;
         public AbsentRepository(AppDbContext context)
-        {
-
-            _context = context;
-        }
+        {}
         public async Task<Absent> CreateAbsentAsync(Absent absent, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:16:9
             _context = context;
         }
         public async Task<Absent> CreateAbsentAsync(Absent absent, CancellationToken cancellationToken)
-        {
-            if (absent is null)
-            {
-                throw new ArgumentNullException(nameof(absent));
-            }
-
-            try
-            {
-                absent.Id = Guid.NewGuid();
-
-                await _context.Absent.AddAsync(absent, cancellationToken);
-                await _context.SaveChangesAsync();
-
-            }
-            catch
-            {
-                absent = null;
-            }
-            return absent;
-        }
+        {}
         public async Task<Absent> UpdateAbsentAsync(Absent absent, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:18:13
         public async Task<Absent> CreateAbsentAsync(Absent absent, CancellationToken cancellationToken)
         {
             if (absent is null)
-            {
-                throw new ArgumentNullException(nameof(absent));
-            }
+            {}
 
             try

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:19:17
         {
             if (absent is null)
             {
-                throw new ArgumentNullException(nameof(absent));
+                ;
             }
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:23:13
             }
 
             try
-            {
-                absent.Id = Guid.NewGuid();
-
-                await _context.Absent.AddAsync(absent, cancellationToken);
-                await _context.SaveChangesAsync();
-
-            }
+            {}
             catch
             {

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:26:17
             {
                 absent.Id = Guid.NewGuid();
 
-                await _context.Absent.AddAsync(absent, cancellationToken);
+                ;
                 await _context.SaveChangesAsync();
 

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:27:17
                 absent.Id = Guid.NewGuid();
 
                 await _context.Absent.AddAsync(absent, cancellationToken);
-                await _context.SaveChangesAsync();
+                ;
 
             }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:31:13
 
             }
             catch
-            {
-                absent = null;
-            }
+            {}
             return absent;
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:37:9
             return absent;
         }
         public async Task<Absent> UpdateAbsentAsync(Absent absent, CancellationToken cancellationToken)
-        {
-            if (absent is null)
-            {
-                throw new ArgumentNullException(nameof(absent));
-            }
-
-            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == absent.Id, cancellationToken);
-            if (result == null)
-            {
-                return result;
-            }
-            else
-            {
-                result.StartDate = absent.StartDate;
-                result.EndDate = absent.EndDate;
-                return result;
-            }
-        }
+        {}
         public async Task<Absent> GetAbsentAsync(Guid id, CancellationToken cancellationToken)
         {

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:43:73
                 throw new ArgumentNullException(nameof(absent));
             }
 
-            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == absent.Id, cancellationToken);
+            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id != absent.Id, cancellationToken);
             if (result == null)
             {

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:44:17
             }
 
             var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == absent.Id, cancellationToken);
-            if (result == null)
+            if (result != null)
             {
                 return result;

[Survived] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:45:13
 
             var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == absent.Id, cancellationToken);
             if (result == null)
-            {
-                return result;
-            }
+            {}
             else
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:49:13
                 return result;
             }
             else
-            {
-                result.StartDate = absent.StartDate;
-                result.EndDate = absent.EndDate;
-                return result;
-            }
+            {}
         }
         public async Task<Absent> GetAbsentAsync(Guid id, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:56:9
             }
         }
         public async Task<Absent> GetAbsentAsync(Guid id, CancellationToken cancellationToken)
-        {
-
-            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            return result;
-
-        }
+        {}
         public async Task<List<Absent>> GetAllAbsentAsync(CancellationToken cancellationToken)
         {

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:58:73
         public async Task<Absent> GetAbsentAsync(Guid id, CancellationToken cancellationToken)
         {
 
-            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             return result;
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:63:9
 
         }
         public async Task<List<Absent>> GetAllAbsentAsync(CancellationToken cancellationToken)
-        {
-
-            var result = await _context.Absent.ToListAsync(cancellationToken);
-            return result;
-
-        }
+        {}
 
         public async Task<List<Absent>> GetAbsentByIdAsync(int userId, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:71:9
         }
 
         public async Task<List<Absent>> GetAbsentByIdAsync(int userId, CancellationToken cancellationToken)
-        {
-
-            var result = await _context.Absent.Where(x => x.UserId == userId).ToListAsync();
-            return result;
-
-        }
+        {}
         public async Task<Absent> DeleteAbsentAsync(Guid id, CancellationToken cancellationToken)
         {

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:73:59
         public async Task<List<Absent>> GetAbsentByIdAsync(int userId, CancellationToken cancellationToken)
         {
 
-            var result = await _context.Absent.Where(x => x.UserId == userId).ToListAsync();
+            var result = await _context.Absent.Where(x => x.UserId != userId).ToListAsync();
             return result;
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:78:9
 
         }
         public async Task<Absent> DeleteAbsentAsync(Guid id, CancellationToken cancellationToken)
-        {
-            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            await _context.SaveChangesAsync();
-            try
-            {
-                _context.Absent.Remove(result);
-                _context.SaveChanges();
-            }
-            catch
-            {
-
-            }
-            return result;
-        }
+        {}
     }
 

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:79:73
         }
         public async Task<Absent> DeleteAbsentAsync(Guid id, CancellationToken cancellationToken)
         {
-            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             await _context.SaveChangesAsync();
             try

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:80:13
         public async Task<Absent> DeleteAbsentAsync(Guid id, CancellationToken cancellationToken)
         {
             var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            await _context.SaveChangesAsync();
+            ;
             try
             {

[Survived] Block removal mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:82:13
             var result = await _context.Absent.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             await _context.SaveChangesAsync();
             try
-            {
-                _context.Absent.Remove(result);
-                _context.SaveChanges();
-            }
+            {}
             catch
             {

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:83:17
             await _context.SaveChangesAsync();
             try
             {
-                _context.Absent.Remove(result);
+                ;
                 _context.SaveChanges();
             }

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/AbsentRepositoy.cs:84:17
             try
             {
                 _context.Absent.Remove(result);
-                _context.SaveChanges();
+                ;
             }
             catch
