[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:11:9
     {
         private readonly AppDbContext _context;
         public ApplicationUserRepository(AppDbContext context)
-        {
-            _context = context;
-        }
+        {}
 
         public async Task<ApplicationUser> CreateApplicationUserAsync(ApplicationUser user, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:16:9
         }
 
         public async Task<ApplicationUser> CreateApplicationUserAsync(ApplicationUser user, CancellationToken cancellationToken)
-        {
-
-            if (user is null)
-            {
-                throw new ArgumentNullException(nameof(user));
-            }
-
-            try
-            {
-                await _context.Users.AddAsync(user, cancellationToken);
-                await _context.SaveChangesAsync(cancellationToken);
-            }
-            catch
-            {
-                user = null;
-            }
-            return user;
-        }
+        {}
 
         public async Task<ApplicationUser> UpdateApplicationUserAsync(ApplicationUser user, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:19:13
         {
 
             if (user is null)
-            {
-                throw new ArgumentNullException(nameof(user));
-            }
+            {}
 
             try

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:20:17
 
             if (user is null)
             {
-                throw new ArgumentNullException(nameof(user));
+                ;
             }
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:24:13
             }
 
             try
-            {
-                await _context.Users.AddAsync(user, cancellationToken);
-                await _context.SaveChangesAsync(cancellationToken);
-            }
+            {}
             catch
             {

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:25:17
 
             try
             {
-                await _context.Users.AddAsync(user, cancellationToken);
+                ;
                 await _context.SaveChangesAsync(cancellationToken);
             }

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:26:17
             try
             {
                 await _context.Users.AddAsync(user, cancellationToken);
-                await _context.SaveChangesAsync(cancellationToken);
+                ;
             }
             catch

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:29:13
                 await _context.SaveChangesAsync(cancellationToken);
             }
             catch
-            {
-                user = null;
-            }
+            {}
             return user;
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:36:9
         }
 
         public async Task<ApplicationUser> UpdateApplicationUserAsync(ApplicationUser user, CancellationToken cancellationToken)
-        {
-            if (user is null)
-            {
-                throw new ArgumentNullException(nameof(user));
-            }
-
-            var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == user.Id, cancellationToken);
-
-            if (userInDb == null)
-            {
-                return userInDb;
-            }
-            else
-            {
-                userInDb.FirstName = user.FirstName;
-                userInDb.OfficeLocation = user.OfficeLocation;
-                userInDb.CheckedIn = user.CheckedIn;
-
-                await _context.SaveChangesAsync();
-                return userInDb;
-            }
-        }
+        {}
 
         public Task<ApplicationUser> GetApplicationUserAsync(int id, CancellationToken cancellationToken) => GetApplicationUserAsync(id, true, cancellationToken);

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:42:129
                 throw new ArgumentNullException(nameof(user));
             }
 
-            var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == user.Id, cancellationToken);
+            var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id != user.Id, cancellationToken);
 
             if (userInDb == null)

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:44:17
 
             var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == user.Id, cancellationToken);
 
-            if (userInDb == null)
+            if (userInDb != null)
             {
                 return userInDb;

[Survived] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:45:13
             var userInDb = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == user.Id, cancellationToken);
 
             if (userInDb == null)
-            {
-                return userInDb;
-            }
+            {}
             else
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:49:13
                 return userInDb;
             }
             else
-            {
-                userInDb.FirstName = user.FirstName;
-                userInDb.OfficeLocation = user.OfficeLocation;
-                userInDb.CheckedIn = user.CheckedIn;
-
-                await _context.SaveChangesAsync();
-                return userInDb;
-            }
+            {}
         }
 

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:54:17
                 userInDb.OfficeLocation = user.OfficeLocation;
                 userInDb.CheckedIn = user.CheckedIn;
 
-                await _context.SaveChangesAsync();
+                ;
                 return userInDb;
             }

[Survived] Boolean mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:59:138
             }
         }
 
-        public Task<ApplicationUser> GetApplicationUserAsync(int id, CancellationToken cancellationToken) => GetApplicationUserAsync(id, true, cancellationToken);
+        public Task<ApplicationUser> GetApplicationUserAsync(int id, CancellationToken cancellationToken) => GetApplicationUserAsync(id, false, cancellationToken);
         public async Task<ApplicationUser> GetApplicationUserAsync(int id, bool track, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:61:9
 
         public Task<ApplicationUser> GetApplicationUserAsync(int id, CancellationToken cancellationToken) => GetApplicationUserAsync(id, true, cancellationToken);
         public async Task<ApplicationUser> GetApplicationUserAsync(int id, bool track, CancellationToken cancellationToken)
-        {
-            ApplicationUser user = new ApplicationUser();
-
-            IQueryable<ApplicationUser> query =  _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts);
-            if (!track)
-            {
-                query = query.AsNoTracking();
-            }
-            user = await  query.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            return user;
-
-        }
+        {}
 
         public async Task<List<ApplicationUser>> GetAllApplicationUserAsync(CancellationToken cancellationToken)

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:65:17
             ApplicationUser user = new ApplicationUser();
 
             IQueryable<ApplicationUser> query =  _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts);
-            if (!track)
+            if (track)
             {
                 query = query.AsNoTracking();

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:66:13
 
             IQueryable<ApplicationUser> query =  _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts);
             if (!track)
-            {
-                query = query.AsNoTracking();
-            }
+            {}
             user = await  query.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             return user;

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:69:58
             {
                 query = query.AsNoTracking();
             }
-            user = await  query.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            user = await  query.FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             return user;
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:75:9
         }
 
         public async Task<List<ApplicationUser>> GetAllApplicationUserAsync(CancellationToken cancellationToken)
-        {
-
-            var result = await _context.Users.ToListAsync(cancellationToken);
-            return result;
-
-        }
+        {}
 
         public async Task<ApplicationUser> DeleteApplicationUserAsync(int id, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:83:9
         }
 
         public async Task<ApplicationUser> DeleteApplicationUserAsync(int id, CancellationToken cancellationToken)
-        {
-            var result = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            try
-            {
-                _context.Users.Remove(result);
-                await _context.SaveChangesAsync();
-            }
-            catch(Exception ex)
-            {
-                result = null;
-            }
-
-            return result;
-        }
+        {}
 
         public async Task<ApplicationUser> CheckInApplicationUserAsync(int id, CancellationToken cancellationToken)

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:84:127
 
         public async Task<ApplicationUser> DeleteApplicationUserAsync(int id, CancellationToken cancellationToken)
         {
-            var result = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            var result = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             try
             {

[Survived] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:86:13
         {
             var result = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             try
-            {
-                _context.Users.Remove(result);
-                await _context.SaveChangesAsync();
-            }
+            {}
             catch(Exception ex)
             {

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:87:17
             var result = await _context.Users.Include(x => x.WorkPatterns).ThenInclude(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             try
             {
-                _context.Users.Remove(result);
+                ;
                 await _context.SaveChangesAsync();
             }

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:88:17
             try
             {
                 _context.Users.Remove(result);
-                await _context.SaveChangesAsync();
+                ;
             }
             catch(Exception ex)

[Survived] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:91:13
                 await _context.SaveChangesAsync();
             }
             catch(Exception ex)
-            {
-                result = null;
-            }
+            {}
 
             return result;

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:99:9
         }
 
         public async Task<ApplicationUser> CheckInApplicationUserAsync(int id, CancellationToken cancellationToken)
-        {
-            var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            try
-            {
-                userInDb.CheckedIn = true;
-                await _context.SaveChangesAsync();
-                return userInDb;
-            }
-            catch
-            {
-                userInDb = null;
-                return userInDb;
-            }
-
-        }
+        {}
         public async Task<ApplicationUser> CheckOutApplicationUserAsync(int id, CancellationToken cancellationToken)
 

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:100:74
 
         public async Task<ApplicationUser> CheckInApplicationUserAsync(int id, CancellationToken cancellationToken)
         {
-            var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             try
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:102:13
         {
             var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             try
-            {
-                userInDb.CheckedIn = true;
-                await _context.SaveChangesAsync();
-                return userInDb;
-            }
+            {}
             catch
             {

[Killed] Boolean mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:103:38
             var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             try
             {
-                userInDb.CheckedIn = true;
+                userInDb.CheckedIn = false;
                 await _context.SaveChangesAsync();
                 return userInDb;

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:104:17
             try
             {
                 userInDb.CheckedIn = true;
-                await _context.SaveChangesAsync();
+                ;
                 return userInDb;
             }

[Survived] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:108:13
                 return userInDb;
             }
             catch
-            {
-                userInDb = null;
-                return userInDb;
-            }
+            {}
 
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:116:9
         }
         public async Task<ApplicationUser> CheckOutApplicationUserAsync(int id, CancellationToken cancellationToken)
 
-        {
-
-            var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            try
-            {
-                userInDb.CheckedIn = false;
-                await _context.SaveChangesAsync();
-                return userInDb;
-            }
-            catch
-            {
-                userInDb = null;
-                return userInDb;
-            }
-
-        }
+        {}
         public async Task<List<UsersEachLocation>> GetAllLocationsAsync(CancellationToken cancellationToken)
 

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:118:74
 
         {
 
-            var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             try
             {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:120:13
 
             var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             try
-            {
-                userInDb.CheckedIn = false;
-                await _context.SaveChangesAsync();
-                return userInDb;
-            }
+            {}
             catch
             {

[Killed] Boolean mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:121:38
             var userInDb = await _context.Users.FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             try
             {
-                userInDb.CheckedIn = false;
+                userInDb.CheckedIn = true;
                 await _context.SaveChangesAsync();
                 return userInDb;

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:122:17
             try
             {
                 userInDb.CheckedIn = false;
-                await _context.SaveChangesAsync();
+                ;
                 return userInDb;
             }

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:134:9
         }
         public async Task<List<UsersEachLocation>> GetAllLocationsAsync(CancellationToken cancellationToken)
 
-        {
-            List<UsersEachLocation> usersOffice = await _context.Users
-                   .GroupBy(p => p.OfficeLocation)
-                   .Select(g => new UsersEachLocation(g.Key, g.Select(x => x.Id).ToList()))
-                   .ToListAsync(cancellationToken);
-            return usersOffice;
-        }
+        {}
 
         public async Task<UsersEachLocation> GetLocationAsync(int officeLocation, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:143:9
         }
 
         public async Task<UsersEachLocation> GetLocationAsync(int officeLocation, CancellationToken cancellationToken)
-        {
-            var user = await _context.Users.Where(x => x.OfficeLocation == officeLocation).ToListAsync(cancellationToken);
-        
-            UsersEachLocation userOffice = user
-                   .GroupBy(p => p.OfficeLocation)
-                   .Select(g => new UsersEachLocation(g.Key, g.Select(x => x.Id).ToList()))
-                   .FirstOrDefault();
-
-            return userOffice;
-        }
+        {}
     }
 }

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:144:56
 
         public async Task<UsersEachLocation> GetLocationAsync(int officeLocation, CancellationToken cancellationToken)
         {
-            var user = await _context.Users.Where(x => x.OfficeLocation == officeLocation).ToListAsync(cancellationToken);
+            var user = await _context.Users.Where(x => x.OfficeLocation != officeLocation).ToListAsync(cancellationToken);
         
             UsersEachLocation userOffice = user

[Killed] Linq method mutation (FirstOrDefault() to First())
miguel-pvs/employee_api/Persistance/ApplicationUserRepository.cs:146:44
         {
             var user = await _context.Users.Where(x => x.OfficeLocation == officeLocation).ToListAsync(cancellationToken);
         
-            UsersEachLocation userOffice = user
-                   .GroupBy(p => p.OfficeLocation)
-                   .Select(g => new UsersEachLocation(g.Key, g.Select(x => x.Id).ToList()))
-                   .FirstOrDefault();
+            UsersEachLocation userOffice = user
+                   .GroupBy(p => p.OfficeLocation)
+                   .Select(g => new UsersEachLocation(g.Key, g.Select(x => x.Id).ToList()))
+                   .First();
 
             return userOffice;
