[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:16:9
     {
         private readonly AppDbContext _context;
         public WorkPatternRepository(AppDbContext context)
-        {
-            _context = context;
-        }
+        {}
         public async Task<WorkPattern> CreateWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:20:9
             _context = context;
         }
         public async Task<WorkPattern> CreateWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
-        {
-            if (workPattern is null)
-            {
-                throw new ArgumentNullException(nameof(workPattern));
-            }
-
-            try
-            {
-                workPattern.Id = Guid.NewGuid();
-
-                foreach (var workPatternPart in workPattern.Parts)
-                    workPatternPart.Id = Guid.NewGuid();
-
-                await _context.WorkPattern.AddAsync(workPattern, cancellationToken);
-                await _context.SaveChangesAsync();
-
-            }
-            catch
-            {
-                workPattern = null;
-            }
-            return workPattern;
-        }
+        {}
         public async Task<WorkPattern> UpdateWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
         {

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:22:13
         public async Task<WorkPattern> CreateWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
         {
             if (workPattern is null)
-            {
-                throw new ArgumentNullException(nameof(workPattern));
-            }
+            {}
 
             try

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:23:17
         {
             if (workPattern is null)
             {
-                throw new ArgumentNullException(nameof(workPattern));
+                ;
             }
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:27:13
             }
 
             try
-            {
-                workPattern.Id = Guid.NewGuid();
-
-                foreach (var workPatternPart in workPattern.Parts)
-                    workPatternPart.Id = Guid.NewGuid();
-
-                await _context.WorkPattern.AddAsync(workPattern, cancellationToken);
-                await _context.SaveChangesAsync();
-
-            }
+            {}
             catch
             {

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:33:17
                 foreach (var workPatternPart in workPattern.Parts)
                     workPatternPart.Id = Guid.NewGuid();
 
-                await _context.WorkPattern.AddAsync(workPattern, cancellationToken);
+                ;
                 await _context.SaveChangesAsync();
 

[Killed] Statement mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:34:17
                     workPatternPart.Id = Guid.NewGuid();
 
                 await _context.WorkPattern.AddAsync(workPattern, cancellationToken);
-                await _context.SaveChangesAsync();
+                ;
 
             }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:38:13
 
             }
             catch
-            {
-                workPattern = null;
-            }
+            {}
             return workPattern;
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:44:9
             return workPattern;
         }
         public async Task<WorkPattern> UpdateWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
-        {
-            if (workPattern is null)
-            {
-                throw new ArgumentNullException(nameof(workPattern));
-            }
-
-            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == workPattern.Id, cancellationToken);
-            if (result == null)
-            {
-                return result;
-            }
-            else
-            {
-                result.StartDate = workPattern.StartDate;
-                result.EndDate = workPattern.EndDate;
-                result.Parts = workPattern.Parts;
-                return result;
-            }
-        }
+        {}
         public async Task<WorkPattern> GetWorkPatternAsync(Guid id, CancellationToken cancellationToken)
         {

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:50:100
                 throw new ArgumentNullException(nameof(workPattern));
             }
 
-            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == workPattern.Id, cancellationToken);
+            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id != workPattern.Id, cancellationToken);
             if (result == null)
             {

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:51:17
             }
 
             var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == workPattern.Id, cancellationToken);
-            if (result == null)
+            if (result != null)
             {
                 return result;

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:56:13
                 return result;
             }
             else
-            {
-                result.StartDate = workPattern.StartDate;
-                result.EndDate = workPattern.EndDate;
-                result.Parts = workPattern.Parts;
-                return result;
-            }
+            {}
         }
         public async Task<WorkPattern> GetWorkPatternAsync(Guid id, CancellationToken cancellationToken)

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:64:9
             }
         }
         public async Task<WorkPattern> GetWorkPatternAsync(Guid id, CancellationToken cancellationToken)
-        {
-
-            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            return result;
-
-        }
+        {}
         public async Task<List<WorkPattern>> GetAllWorkPatternsAsync(CancellationToken cancellationToken)
         {

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:66:100
         public async Task<WorkPattern> GetWorkPatternAsync(Guid id, CancellationToken cancellationToken)
         {
 
-            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             return result;
 

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:71:9
 
         }
         public async Task<List<WorkPattern>> GetAllWorkPatternsAsync(CancellationToken cancellationToken)
-        {
-
-            var result = await _context.WorkPattern.Include(x => x.Parts).ToListAsync(cancellationToken);
-            return result;
-
-        }
+        {}
         public async Task<WorkPattern> DeleteWorkPatternAsync(Guid id, CancellationToken cancellationToken)
         {         

[Killed] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:78:9
 
         }
         public async Task<WorkPattern> DeleteWorkPatternAsync(Guid id, CancellationToken cancellationToken)
-        {         
-            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            await _context.SaveChangesAsync();
-            try
-            {
-                _context.WorkPattern.Remove(result);
-                _context.SaveChanges();
-            }
-            catch
-            {
-
-            }
-            return result;
-        }
+        {}
     }
 

[Killed] Equality mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:79:100
         }
         public async Task<WorkPattern> DeleteWorkPatternAsync(Guid id, CancellationToken cancellationToken)
         {         
-            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
+            var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id != id, cancellationToken);
             await _context.SaveChangesAsync();
             try

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:80:13
         public async Task<WorkPattern> DeleteWorkPatternAsync(Guid id, CancellationToken cancellationToken)
         {         
             var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
-            await _context.SaveChangesAsync();
+            ;
             try
             {

[Survived] Block removal mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:82:13
             var result = await _context.WorkPattern.Include(x => x.Parts).FirstOrDefaultAsync(x => x.Id == id, cancellationToken);
             await _context.SaveChangesAsync();
             try
-            {
-                _context.WorkPattern.Remove(result);
-                _context.SaveChanges();
-            }
+            {}
             catch
             {

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:83:17
             await _context.SaveChangesAsync();
             try
             {
-                _context.WorkPattern.Remove(result);
+                ;
                 _context.SaveChanges();
             }

[Survived] Statement mutation
miguel-pvs/employee_api/Persistance/WorkPatternRepository.cs:84:17
             try
             {
                 _context.WorkPattern.Remove(result);
-                _context.SaveChanges();
+                ;
             }
             catch
