[NoCoverage] Block removal mutation
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:12:9
         private readonly ILogger _logger;
 
         public RequestValidationBehaviour(IEnumerable<IValidator<TRequest>> validators, ILogger<TRequest> logger)
-        {
-            _validators = validators;
-            _logger = logger;
-        }
+        {}
 
         public Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:18:9
         }
 
         public Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)
-        {
-            var context = new ValidationContext<TRequest>(request);
-
-            var failures = _validators
-                .Select(v => v.Validate(context))
-                .SelectMany(result => result.Errors)
-                .Where(f => f != null)
-                .ToList();
-
-            if (failures.Count > 0)
-            {
-                failures.ForEach(f =>
-                    _logger.LogInformation($"Validation for {typeof(TRequest).Name} failed because {f.ErrorMessage}")
-                );
-                throw new Application.Exceptions.ValidationException(failures);
-            }
-            return next();
-        }
+        {}
     }
 }

[NoCoverage] Equality mutation
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:24:29
             var failures = _validators
                 .Select(v => v.Validate(context))
                 .SelectMany(result => result.Errors)
-                .Where(f => f != null)
+                .Where(f => f == null)
                 .ToList();
 

[NoCoverage] Negate expression
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:27:17
                 .Where(f => f != null)
                 .ToList();
 
-            if (failures.Count > 0)
+            if (!(failures.Count > 0))
             {
                 failures.ForEach(f =>

[NoCoverage] Equality mutation
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:27:17
                 .Where(f => f != null)
                 .ToList();
 
-            if (failures.Count > 0)
+            if (failures.Count < 0)
             {
                 failures.ForEach(f =>

[NoCoverage] Block removal mutation
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:28:13
                 .ToList();
 
             if (failures.Count > 0)
-            {
-                failures.ForEach(f =>
-                    _logger.LogInformation($"Validation for {typeof(TRequest).Name} failed because {f.ErrorMessage}")
-                );
-                throw new Application.Exceptions.ValidationException(failures);
-            }
+            {}
             return next();
         }

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:29:17
 
             if (failures.Count > 0)
             {
-                failures.ForEach(f =>
-                    _logger.LogInformation($"Validation for {typeof(TRequest).Name} failed because {f.ErrorMessage}")
-                );
+                ;
                 throw new Application.Exceptions.ValidationException(failures);
             }

[NoCoverage] Statement mutation
repos/miguel-pvs/employee_api/RequestValidationBehaviour.cs:32:17
                 failures.ForEach(f =>
                     _logger.LogInformation($"Validation for {typeof(TRequest).Name} failed because {f.ErrorMessage}")
                 );
-                throw new Application.Exceptions.ValidationException(failures);
+                ;
             }
             return next();
