[Survived] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:31:9
         public TimerService(IMediator mediator,
             IUnsService unsService,
             IServiceProvider serviceProvider)
-        {
-            _mediator = mediator;
-            _unsService = unsService;
-            _serviceProvider = serviceProvider;
-        }
+        {}
 
         public async Task SetAbsentsAsync(List<Absent> listAllAbsents,CancellationToken cancellationToken)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:38:9
         }
 
         public async Task SetAbsentsAsync(List<Absent> listAllAbsents,CancellationToken cancellationToken)
-        {
-            while (!cancellationToken.IsCancellationRequested)
-            {
-                _listAllAbsents = listAllAbsents;
-                await _unsService.CheckTodayAbsentsAsync(listAllAbsents,cancellationToken);
-                TimeSpan midnight = DateTime.UtcNow.Date.TimeOfDay;
-                TimeSpan hourNow = DateTime.UtcNow.TimeOfDay;
-                TimeSpan hoursDay = TimeSpan.FromDays(1);
-
-                if (hourNow != midnight)
-                {
-                    await Task.Delay(hoursDay - hourNow, cancellationToken);
-                }
-                else
-                {
-                    await Task.Delay(hoursDay, cancellationToken);
-                }
-            }
-
-        }
+        {}
         public async Task SetInitialTimerAsync(List<ApplicationUser> applicationUsers, CancellationToken cancellationToken)
         {

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
miguel-pvs/employee_api/Timers/TimerService.cs:39:20
 
         public async Task SetAbsentsAsync(List<Absent> listAllAbsents,CancellationToken cancellationToken)
         {
-            while (!cancellationToken.IsCancellationRequested)
+            while (cancellationToken.IsCancellationRequested)
             {
                 _listAllAbsents = listAllAbsents;

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:40:13
         public async Task SetAbsentsAsync(List<Absent> listAllAbsents,CancellationToken cancellationToken)
         {
             while (!cancellationToken.IsCancellationRequested)
-            {
-                _listAllAbsents = listAllAbsents;
-                await _unsService.CheckTodayAbsentsAsync(listAllAbsents,cancellationToken);
-                TimeSpan midnight = DateTime.UtcNow.Date.TimeOfDay;
-                TimeSpan hourNow = DateTime.UtcNow.TimeOfDay;
-                TimeSpan hoursDay = TimeSpan.FromDays(1);
-
-                if (hourNow != midnight)
-                {
-                    await Task.Delay(hoursDay - hourNow, cancellationToken);
-                }
-                else
-                {
-                    await Task.Delay(hoursDay, cancellationToken);
-                }
-            }
+            {}
 
         }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:42:17
             while (!cancellationToken.IsCancellationRequested)
             {
                 _listAllAbsents = listAllAbsents;
-                await _unsService.CheckTodayAbsentsAsync(listAllAbsents,cancellationToken);
+                ;
                 TimeSpan midnight = DateTime.UtcNow.Date.TimeOfDay;
                 TimeSpan hourNow = DateTime.UtcNow.TimeOfDay;

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:47:21
                 TimeSpan hourNow = DateTime.UtcNow.TimeOfDay;
                 TimeSpan hoursDay = TimeSpan.FromDays(1);
 
-                if (hourNow != midnight)
+                if (hourNow == midnight)
                 {
                     await Task.Delay(hoursDay - hourNow, cancellationToken);

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:48:17
                 TimeSpan hoursDay = TimeSpan.FromDays(1);
 
                 if (hourNow != midnight)
-                {
-                    await Task.Delay(hoursDay - hourNow, cancellationToken);
-                }
+                {}
                 else
                 {

[NoCoverage] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:49:38
 
                 if (hourNow != midnight)
                 {
-                    await Task.Delay(hoursDay - hourNow, cancellationToken);
+                    await Task.Delay(hoursDay + hourNow, cancellationToken);
                 }
                 else

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:49:21
 
                 if (hourNow != midnight)
                 {
-                    await Task.Delay(hoursDay - hourNow, cancellationToken);
+                    ;
                 }
                 else

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:52:17
                     await Task.Delay(hoursDay - hourNow, cancellationToken);
                 }
                 else
-                {
-                    await Task.Delay(hoursDay, cancellationToken);
-                }
+                {}
             }
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:53:21
                 }
                 else
                 {
-                    await Task.Delay(hoursDay, cancellationToken);
+                    ;
                 }
             }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:59:9
 
         }
         public async Task SetInitialTimerAsync(List<ApplicationUser> applicationUsers, CancellationToken cancellationToken)
-        {
-            var token = _cancellationTokenSource.Token;
-            foreach (var applicationUser in applicationUsers)
-            {
-                _lastUpdatedUser = applicationUser;
-                await CalculateDelayWithoutSettingTaskAsync(applicationUser.Id, token);
-            }
-            _task = WaitForNextShiftAsync(token);
-            
-        }
+        {}
         public async Task CalculateDelayWithoutSettingTaskAsync(int userId, CancellationToken token)
         {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:62:13
         {
             var token = _cancellationTokenSource.Token;
             foreach (var applicationUser in applicationUsers)
-            {
-                _lastUpdatedUser = applicationUser;
-                await CalculateDelayWithoutSettingTaskAsync(applicationUser.Id, token);
-            }
+            {}
             _task = WaitForNextShiftAsync(token);
             

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:64:17
             foreach (var applicationUser in applicationUsers)
             {
                 _lastUpdatedUser = applicationUser;
-                await CalculateDelayWithoutSettingTaskAsync(applicationUser.Id, token);
+                ;
             }
             _task = WaitForNextShiftAsync(token);

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:70:9
             
         }
         public async Task CalculateDelayWithoutSettingTaskAsync(int userId, CancellationToken token)
-        {
-
-            List<WorkPattern> listWorkPatterns = _lastUpdatedUser.WorkPatterns;
-            try
-            {
-
-                DateTime now = DateTime.UtcNow;
-                TimeSpan lowestDelay = await FindLowestDelayAsync(listWorkPatterns, now, token);
-                DateTime nextUserShiftDateTime = now + lowestDelay;
-
-                if (_usersWithNextUpdateTime.ContainsKey(userId))
-                {
-                    _usersWithNextUpdateTime[userId] = nextUserShiftDateTime;
-                }
-                else
-                {
-                    _usersWithNextUpdateTime.Add(userId, nextUserShiftDateTime);
-                }
-            }
-            catch
-            {
-            }
-
-        }
+        {}
         public async Task CalculateDelayAsync(ApplicationUser applicationUser, CancellationToken token)
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:74:13
 
             List<WorkPattern> listWorkPatterns = _lastUpdatedUser.WorkPatterns;
             try
-            {
-
-                DateTime now = DateTime.UtcNow;
-                TimeSpan lowestDelay = await FindLowestDelayAsync(listWorkPatterns, now, token);
-                DateTime nextUserShiftDateTime = now + lowestDelay;
-
-                if (_usersWithNextUpdateTime.ContainsKey(userId))
-                {
-                    _usersWithNextUpdateTime[userId] = nextUserShiftDateTime;
-                }
-                else
-                {
-                    _usersWithNextUpdateTime.Add(userId, nextUserShiftDateTime);
-                }
-            }
+            {}
             catch
             {

[NoCoverage] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:78:50
 
                 DateTime now = DateTime.UtcNow;
                 TimeSpan lowestDelay = await FindLowestDelayAsync(listWorkPatterns, now, token);
-                DateTime nextUserShiftDateTime = now + lowestDelay;
+                DateTime nextUserShiftDateTime = now - lowestDelay;
 
                 if (_usersWithNextUpdateTime.ContainsKey(userId))

[NoCoverage] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:80:21
                 TimeSpan lowestDelay = await FindLowestDelayAsync(listWorkPatterns, now, token);
                 DateTime nextUserShiftDateTime = now + lowestDelay;
 
-                if (_usersWithNextUpdateTime.ContainsKey(userId))
+                if (!(_usersWithNextUpdateTime.ContainsKey(userId)))
                 {
                     _usersWithNextUpdateTime[userId] = nextUserShiftDateTime;

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:81:17
                 DateTime nextUserShiftDateTime = now + lowestDelay;
 
                 if (_usersWithNextUpdateTime.ContainsKey(userId))
-                {
-                    _usersWithNextUpdateTime[userId] = nextUserShiftDateTime;
-                }
+                {}
                 else
                 {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:85:17
                     _usersWithNextUpdateTime[userId] = nextUserShiftDateTime;
                 }
                 else
-                {
-                    _usersWithNextUpdateTime.Add(userId, nextUserShiftDateTime);
-                }
+                {}
             }
             catch

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:86:21
                 }
                 else
                 {
-                    _usersWithNextUpdateTime.Add(userId, nextUserShiftDateTime);
+                    ;
                 }
             }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:101:13
             List<WorkPattern> listWorkPatterns = applicationUser.WorkPatterns;
             List<WorkPattern> newListWorkPattern = listWorkPatterns;
             try
-            {
-                DateTime now = DateTime.UtcNow;
-                TimeSpan lowestDelay = await FindLowestDelayAsync(listWorkPatterns,now, token);
-                DateTime nextUserShiftDateTime = now + lowestDelay;
-
-                if (_usersWithNextUpdateTime.ContainsKey(applicationUser.Id))
-                {
-                    _usersWithNextUpdateTime[applicationUser.Id] = nextUserShiftDateTime;
-                }
-                else
-                {
-                    _usersWithNextUpdateTime.Add(applicationUser.Id, nextUserShiftDateTime);
-                }
-                var eventPublishWorkPattern = new PublishWorkPatternEvent(applicationUser);
-                await _mediator.Publish(eventPublishWorkPattern, token);
-                _task = WaitForNextShiftAsync(token);
-            }
+            {}
             catch
             {

[NoCoverage] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:106:21
                 TimeSpan lowestDelay = await FindLowestDelayAsync(listWorkPatterns,now, token);
                 DateTime nextUserShiftDateTime = now + lowestDelay;
 
-                if (_usersWithNextUpdateTime.ContainsKey(applicationUser.Id))
+                if (!(_usersWithNextUpdateTime.ContainsKey(applicationUser.Id)))
                 {
                     _usersWithNextUpdateTime[applicationUser.Id] = nextUserShiftDateTime;

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:107:17
                 DateTime nextUserShiftDateTime = now + lowestDelay;
 
                 if (_usersWithNextUpdateTime.ContainsKey(applicationUser.Id))
-                {
-                    _usersWithNextUpdateTime[applicationUser.Id] = nextUserShiftDateTime;
-                }
+                {}
                 else
                 {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:111:17
                     _usersWithNextUpdateTime[applicationUser.Id] = nextUserShiftDateTime;
                 }
                 else
-                {
-                    _usersWithNextUpdateTime.Add(applicationUser.Id, nextUserShiftDateTime);
-                }
+                {}
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(applicationUser);
                 await _mediator.Publish(eventPublishWorkPattern, token);

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:112:21
                 }
                 else
                 {
-                    _usersWithNextUpdateTime.Add(applicationUser.Id, nextUserShiftDateTime);
+                    ;
                 }
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(applicationUser);

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:115:17
                     _usersWithNextUpdateTime.Add(applicationUser.Id, nextUserShiftDateTime);
                 }
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(applicationUser);
-                await _mediator.Publish(eventPublishWorkPattern, token);
+                ;
                 _task = WaitForNextShiftAsync(token);
             }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:124:9
 
         }
         public async Task WaitForNextShiftAsync(CancellationToken token)
-        {
-            while(!token.IsCancellationRequested)
-            {
-                DateTime now = DateTime.UtcNow;
-                DateTime nextShiftDateTime = _usersWithNextUpdateTime.Min(x => x.Value);
-                var applicationUserInDic = _usersWithNextUpdateTime.FirstOrDefault(x => x.Value == nextShiftDateTime);
-
-                int idApplicationUserNextShift = applicationUserInDic.Key;
-                TimeSpan delayTask = nextShiftDateTime - now;
-
-                using var scope = _serviceProvider.CreateScope();
-                var applicationUsersRepository = scope.ServiceProvider.GetRequiredService<IApplicationUsersRepository>();
-                var user = await applicationUsersRepository.GetApplicationUserAsync(idApplicationUserNextShift,token);
-                var eventPublishWorkPattern = new PublishWorkPatternEvent(user);
-                await _mediator.Publish(eventPublishWorkPattern, token);
-
-                if(delayTask < TimeSpan.Zero)
-                {
-                    delayTask = TimeSpan.FromSeconds(1);
-                };
-
-                await Task.Delay(delayTask, token);
-                await CalculateDelayWithoutSettingTaskAsync(idApplicationUserNextShift, token);
-            }
-        }
+        {}
         public async Task ReinitializeTimersAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)
         {

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
miguel-pvs/employee_api/Timers/TimerService.cs:125:19
         }
         public async Task WaitForNextShiftAsync(CancellationToken token)
         {
-            while(!token.IsCancellationRequested)
+            while(token.IsCancellationRequested)
             {
                 DateTime now = DateTime.UtcNow;

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:126:13
         public async Task WaitForNextShiftAsync(CancellationToken token)
         {
             while(!token.IsCancellationRequested)
-            {
-                DateTime now = DateTime.UtcNow;
-                DateTime nextShiftDateTime = _usersWithNextUpdateTime.Min(x => x.Value);
-                var applicationUserInDic = _usersWithNextUpdateTime.FirstOrDefault(x => x.Value == nextShiftDateTime);
-
-                int idApplicationUserNextShift = applicationUserInDic.Key;
-                TimeSpan delayTask = nextShiftDateTime - now;
-
-                using var scope = _serviceProvider.CreateScope();
-                var applicationUsersRepository = scope.ServiceProvider.GetRequiredService<IApplicationUsersRepository>();
-                var user = await applicationUsersRepository.GetApplicationUserAsync(idApplicationUserNextShift,token);
-                var eventPublishWorkPattern = new PublishWorkPatternEvent(user);
-                await _mediator.Publish(eventPublishWorkPattern, token);
-
-                if(delayTask < TimeSpan.Zero)
-                {
-                    delayTask = TimeSpan.FromSeconds(1);
-                };
-
-                await Task.Delay(delayTask, token);
-                await CalculateDelayWithoutSettingTaskAsync(idApplicationUserNextShift, token);
-            }
+            {}
         }
         public async Task ReinitializeTimersAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)

[NoCoverage] Linq method mutation (Min() to Max())
miguel-pvs/employee_api/Timers/TimerService.cs:128:46
             while(!token.IsCancellationRequested)
             {
                 DateTime now = DateTime.UtcNow;
-                DateTime nextShiftDateTime = _usersWithNextUpdateTime.Min(x => x.Value);
+                DateTime nextShiftDateTime = _usersWithNextUpdateTime.Max(x => x.Value);
                 var applicationUserInDic = _usersWithNextUpdateTime.FirstOrDefault(x => x.Value == nextShiftDateTime);
 

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:129:89
             {
                 DateTime now = DateTime.UtcNow;
                 DateTime nextShiftDateTime = _usersWithNextUpdateTime.Min(x => x.Value);
-                var applicationUserInDic = _usersWithNextUpdateTime.FirstOrDefault(x => x.Value == nextShiftDateTime);
+                var applicationUserInDic = _usersWithNextUpdateTime.FirstOrDefault(x => x.Value != nextShiftDateTime);
 
                 int idApplicationUserNextShift = applicationUserInDic.Key;

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
miguel-pvs/employee_api/Timers/TimerService.cs:129:44
             {
                 DateTime now = DateTime.UtcNow;
                 DateTime nextShiftDateTime = _usersWithNextUpdateTime.Min(x => x.Value);
-                var applicationUserInDic = _usersWithNextUpdateTime.FirstOrDefault(x => x.Value == nextShiftDateTime);
+                var applicationUserInDic = _usersWithNextUpdateTime.First(x => x.Value == nextShiftDateTime);
 
                 int idApplicationUserNextShift = applicationUserInDic.Key;

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:138:17
                 var applicationUsersRepository = scope.ServiceProvider.GetRequiredService<IApplicationUsersRepository>();
                 var user = await applicationUsersRepository.GetApplicationUserAsync(idApplicationUserNextShift,token);
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(user);
-                await _mediator.Publish(eventPublishWorkPattern, token);
+                ;
 
                 if(delayTask < TimeSpan.Zero)

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:140:20
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(user);
                 await _mediator.Publish(eventPublishWorkPattern, token);
 
-                if(delayTask < TimeSpan.Zero)
+                if(delayTask <= TimeSpan.Zero)
                 {
                     delayTask = TimeSpan.FromSeconds(1);

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:140:20
                 var eventPublishWorkPattern = new PublishWorkPatternEvent(user);
                 await _mediator.Publish(eventPublishWorkPattern, token);
 
-                if(delayTask < TimeSpan.Zero)
+                if(delayTask > TimeSpan.Zero)
                 {
                     delayTask = TimeSpan.FromSeconds(1);

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:141:17
                 await _mediator.Publish(eventPublishWorkPattern, token);
 
                 if(delayTask < TimeSpan.Zero)
-                {
-                    delayTask = TimeSpan.FromSeconds(1);
-                };
+                {};
 
                 await Task.Delay(delayTask, token);

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:145:17
                     delayTask = TimeSpan.FromSeconds(1);
                 };
 
-                await Task.Delay(delayTask, token);
+                ;
                 await CalculateDelayWithoutSettingTaskAsync(idApplicationUserNextShift, token);
             }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:146:17
                 };
 
                 await Task.Delay(delayTask, token);
-                await CalculateDelayWithoutSettingTaskAsync(idApplicationUserNextShift, token);
+                ;
             }
         }

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:150:9
             }
         }
         public async Task ReinitializeTimersAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)
-        {
-            _cancellationTokenSource.Cancel();
-            try
-            {
-                await _task;
-            }
-            catch (TaskCanceledException) { }
-            _cancellationTokenSource.Dispose();
-            _cancellationTokenSource = new CancellationTokenSource();
-
-
-            var token = _cancellationTokenSource.Token;
-            _task = CalculateDelayAsync(applicationUser, token);
-        }
+        {}
         public async Task RemoveTimersAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)
         {

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:151:13
         }
         public async Task ReinitializeTimersAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)
         {
-            _cancellationTokenSource.Cancel();
+            ;
             try
             {

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:153:13
         {
             _cancellationTokenSource.Cancel();
             try
-            {
-                await _task;
-            }
+            {}
             catch (TaskCanceledException) { }
             _cancellationTokenSource.Dispose();

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:154:17
             _cancellationTokenSource.Cancel();
             try
             {
-                await _task;
+                ;
             }
             catch (TaskCanceledException) { }

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:157:13
                 await _task;
             }
             catch (TaskCanceledException) { }
-            _cancellationTokenSource.Dispose();
+            ;
             _cancellationTokenSource = new CancellationTokenSource();
 

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:165:9
             _task = CalculateDelayAsync(applicationUser, token);
         }
         public async Task RemoveTimersAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)
-        {
-            _cancellationTokenSource.Cancel();
-            _cancellationTokenSource.Dispose();
-            _cancellationTokenSource = new CancellationTokenSource();
-
-            var token = _cancellationTokenSource.Token;
-            await RemoveDelayAsync(applicationUser, token);
-        }
+        {}
         public async Task RemoveDelayAsync(ApplicationUser applicationUser, CancellationToken token)
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:167:13
         public async Task RemoveTimersAsync(ApplicationUser applicationUser, CancellationToken cancellationToken)
         {
             _cancellationTokenSource.Cancel();
-            _cancellationTokenSource.Dispose();
+            ;
             _cancellationTokenSource = new CancellationTokenSource();
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:171:13
             _cancellationTokenSource = new CancellationTokenSource();
 
             var token = _cancellationTokenSource.Token;
-            await RemoveDelayAsync(applicationUser, token);
+            ;
         }
         public async Task RemoveDelayAsync(ApplicationUser applicationUser, CancellationToken token)

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:175:9
         }
         public async Task RemoveDelayAsync(ApplicationUser applicationUser, CancellationToken token)
 
-        {
-            _usersWithNextUpdateTime.Remove(applicationUser.Id);
-            _task = WaitForNextShiftAsync(token);
-
-        }
+        {}
         public async Task<TimeSpan> FindLowestDelayAsync(List<WorkPattern> listWorkPatterns,DateTime now, CancellationToken cancellationToken)
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:176:13
         public async Task RemoveDelayAsync(ApplicationUser applicationUser, CancellationToken token)
 
         {
-            _usersWithNextUpdateTime.Remove(applicationUser.Id);
+            ;
             _task = WaitForNextShiftAsync(token);
 

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:190:25
                 {
                     int userId = listWorkPatterns[0].UserId;
                     bool insideWorkPattern = await CheckIfInsideWorkPatternAsync(workPattern, cancellationToken);
-                    if (insideWorkPattern)
+                    if (!(insideWorkPattern))
                     {
                         List<WorkPatternPart> listWorkPatternParts = workPattern.Parts;

[Killed] PostIncrementExpression to PostDecrementExpression mutation
miguel-pvs/employee_api/Timers/TimerService.cs:196:61
 
                         DayOfWeek dayNextShift = new DayOfWeek();
 
-                        for(int dayIndex = 0; dayIndex < 8; dayIndex++)
+                        for(int dayIndex = 0; dayIndex < 8; dayIndex--)
                         {
                             dayNextShift = now.AddDays(dayIndex).DayOfWeek;

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:196:47
 
                         DayOfWeek dayNextShift = new DayOfWeek();
 
-                        for(int dayIndex = 0; dayIndex < 8; dayIndex++)
+                        for(int dayIndex = 0; dayIndex > 8; dayIndex++)
                         {
                             dayNextShift = now.AddDays(dayIndex).DayOfWeek;

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:199:83
                         for(int dayIndex = 0; dayIndex < 8; dayIndex++)
                         {
                             dayNextShift = now.AddDays(dayIndex).DayOfWeek;
-                            var nextListParts = listWorkPatternParts.FindAll(y => y.Day == dayNextShift);
+                            var nextListParts = listWorkPatternParts.FindAll(y => y.Day != dayNextShift);
                             if (nextListParts.Any())
                             {

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:200:33
                         {
                             dayNextShift = now.AddDays(dayIndex).DayOfWeek;
                             var nextListParts = listWorkPatternParts.FindAll(y => y.Day == dayNextShift);
-                            if (nextListParts.Any())
+                            if (!(nextListParts.Any()))
                             {
                                 List<Absent> listAbsentPerDay = _listAllAbsents

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:203:45
                             if (nextListParts.Any())
                             {
                                 List<Absent> listAbsentPerDay = _listAllAbsents
-                                .Where(x => x.StartDate.Date == now.Date.AddDays(dayIndex))
+                                .Where(x => x.StartDate.Date != now.Date.AddDays(dayIndex))
                                 .Where(x => x.UserId == userId)
                                 .ToList();

[NoCoverage] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:204:45
                             {
                                 List<Absent> listAbsentPerDay = _listAllAbsents
                                 .Where(x => x.StartDate.Date == now.Date.AddDays(dayIndex))
-                                .Where(x => x.UserId == userId)
+                                .Where(x => x.UserId != userId)
                                 .ToList();
 
