[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:217:41
                                     TimeSpan start = part.StartTime;
                                     TimeSpan end = part.EndTime;
 
-                                    if (dayIndex ==  0)
+                                    if (dayIndex !=  0)
                                     {
                                         if ((nowTimeOfDay <= start))

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:218:37
                                     TimeSpan end = part.EndTime;
 
                                     if (dayIndex ==  0)
-                                    {
-                                        if ((nowTimeOfDay <= start))
-                                        {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
-                                        }
-                                        else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
-                                        {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
-                                        }
-                                        else if ((nowTimeOfDay >= end))
-                                        {
-                                            TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                            delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
-                                        }
-                                    }
+                                    {}
                                     else
                                     {

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:219:46
 
                                     if (dayIndex ==  0)
                                     {
-                                        if ((nowTimeOfDay <= start))
+                                        if ((nowTimeOfDay > start))
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:219:45
 
                                     if (dayIndex ==  0)
                                     {
-                                        if ((nowTimeOfDay <= start))
+                                        if (!((nowTimeOfDay <= start)))
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:220:41
                                     if (dayIndex ==  0)
                                     {
                                         if ((nowTimeOfDay <= start))
-                                        {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
-                                        }
+                                        {}
                                         else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
                                         {

[Killed] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:221:45
                                     {
                                         if ((nowTimeOfDay <= start))
                                         {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
+                                            ;
                                         }
                                         else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))

[Killed] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:221:56
                                     {
                                         if ((nowTimeOfDay <= start))
                                         {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
+                                            delays.Add(TimeSpan.FromDays(dayIndex) - start - nowTimeOfDay);
                                         }
                                         else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:223:74
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
                                         }
-                                        else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
+                                        else if ((nowTimeOfDay < end) & (nowTimeOfDay < start))
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);

[Killed] Bitwise mutation
miguel-pvs/employee_api/Timers/TimerService.cs:223:50
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
                                         }
-                                        else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
+                                        else if ((nowTimeOfDay < end) | (nowTimeOfDay >= start))
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:224:41
                                             delays.Add(TimeSpan.FromDays(dayIndex) + start - nowTimeOfDay);
                                         }
                                         else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
-                                        {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
-                                        }
+                                        {}
                                         else if ((nowTimeOfDay >= end))
                                         {

[Killed] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:225:45
                                         }
                                         else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
                                         {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
+                                            ;
                                         }
                                         else if ((nowTimeOfDay >= end))

[Killed] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:225:56
                                         }
                                         else if ((nowTimeOfDay < end) & (nowTimeOfDay >= start))
                                         {
-                                            delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
+                                            delays.Add(TimeSpan.FromDays(dayIndex) - end - nowTimeOfDay);
                                         }
                                         else if ((nowTimeOfDay >= end))

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:227:51
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
                                         }
-                                        else if ((nowTimeOfDay >= end))
+                                        else if ((nowTimeOfDay > end))
                                         {
                                             TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:227:50
                                         {
                                             delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
                                         }
-                                        else if ((nowTimeOfDay >= end))
+                                        else if (!((nowTimeOfDay >= end)))
                                         {
                                             TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:228:41
                                             delays.Add(TimeSpan.FromDays(dayIndex) + end - nowTimeOfDay);
                                         }
                                         else if ((nowTimeOfDay >= end))
-                                        {
-                                            TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                            delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
-                                        }
+                                        {}
                                     }
                                     else

[Killed] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:230:56
                                         else if ((nowTimeOfDay >= end))
                                         {
                                             TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                            delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
+                                            delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay - beginNextShift);
                                         }
                                     }

[Killed] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:230:45
                                         else if ((nowTimeOfDay >= end))
                                         {
                                             TimeSpan beginNextShift = await FindNextPartJumpOneDayAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                            delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
+                                            ;
                                         }
                                     }

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:234:37
                                         }
                                     }
                                     else
-                                    {
-                                        TimeSpan beginNextShift = await FindNextPartAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                        delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
-                                    }
+                                    {}
                                 }
                                 break;

[Killed] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:236:52
                                     else
                                     {
                                         TimeSpan beginNextShift = await FindNextPartAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                        delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
+                                        delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay - beginNextShift);
                                     }
                                 }

[Killed] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:236:41
                                     else
                                     {
                                         TimeSpan beginNextShift = await FindNextPartAsync(dayIndex, listWorkPatternParts, now, cancellationToken);
-                                        delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
+                                        ;
                                     }
                                 }

[Survived] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:239:33
                                         delays.Add(TimeSpan.FromHours(24) - nowTimeOfDay + beginNextShift);
                                     }
                                 }
-                                break;
+                                ;
                             }
                         }

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:249:36
             {
             }
 
-            TimeSpan lowestDelay = delays.Any() ? delays.Min() : TimeSpan.FromSeconds(999999999);
+            TimeSpan lowestDelay = !(delays.Any() ) ? delays.Min() : TimeSpan.FromSeconds(999999999);
 
             return lowestDelay;

[Killed] Linq method mutation (Min() to Max())
miguel-pvs/employee_api/Timers/TimerService.cs:249:51
             {
             }
 
-            TimeSpan lowestDelay = delays.Any() ? delays.Min() : TimeSpan.FromSeconds(999999999);
+            TimeSpan lowestDelay = delays.Any() ? delays.Max() : TimeSpan.FromSeconds(999999999);
 
             return lowestDelay;

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:258:36
             TimeSpan lowestStart = TimeSpan.FromHours(24);
             DayOfWeek dayNextNextShift = new DayOfWeek();
             int index = 0;
-            for (index = dayIndex; index < 8; index++)
+            for (index = dayIndex; index > 8; index++)
             {
                 dayNextNextShift = now.AddDays(index).DayOfWeek;

[Survived] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:258:36
             TimeSpan lowestStart = TimeSpan.FromHours(24);
             DayOfWeek dayNextNextShift = new DayOfWeek();
             int index = 0;
-            for (index = dayIndex; index < 8; index++)
+            for (index = dayIndex; index <= 8; index++)
             {
                 dayNextNextShift = now.AddDays(index).DayOfWeek;

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:259:13
             DayOfWeek dayNextNextShift = new DayOfWeek();
             int index = 0;
             for (index = dayIndex; index < 8; index++)
-            {
-                dayNextNextShift = now.AddDays(index).DayOfWeek;
-                var nextNextListParts = listWorkPatternParts.FindAll(x => x.Day == dayNextNextShift);
-                if (nextNextListParts.Any())
-                {
-                    foreach (var part in nextNextListParts)
-                    {
-                        TimeSpan nowTimeOfDay = now.TimeOfDay;
-                        TimeSpan start = part.StartTime;
-                        TimeSpan end = part.EndTime;
-
-                        if (start < lowestStart)
-                        {
-                            lowestStart = start;
-                        }
-                    }
-                    break;                 
-                }
-            }
+            {}
             return (lowestStart + TimeSpan.FromDays(index-1));
         }

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:261:75
             for (index = dayIndex; index < 8; index++)
             {
                 dayNextNextShift = now.AddDays(index).DayOfWeek;
-                var nextNextListParts = listWorkPatternParts.FindAll(x => x.Day == dayNextNextShift);
+                var nextNextListParts = listWorkPatternParts.FindAll(x => x.Day != dayNextNextShift);
                 if (nextNextListParts.Any())
                 {

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:262:21
             {
                 dayNextNextShift = now.AddDays(index).DayOfWeek;
                 var nextNextListParts = listWorkPatternParts.FindAll(x => x.Day == dayNextNextShift);
-                if (nextNextListParts.Any())
+                if (!(nextNextListParts.Any()))
                 {
                     foreach (var part in nextNextListParts)

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:263:17
                 dayNextNextShift = now.AddDays(index).DayOfWeek;
                 var nextNextListParts = listWorkPatternParts.FindAll(x => x.Day == dayNextNextShift);
                 if (nextNextListParts.Any())
-                {
-                    foreach (var part in nextNextListParts)
-                    {
-                        TimeSpan nowTimeOfDay = now.TimeOfDay;
-                        TimeSpan start = part.StartTime;
-                        TimeSpan end = part.EndTime;
-
-                        if (start < lowestStart)
-                        {
-                            lowestStart = start;
-                        }
-                    }
-                    break;                 
-                }
+                {}
             }
             return (lowestStart + TimeSpan.FromDays(index-1));

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:265:21
                 if (nextNextListParts.Any())
                 {
                     foreach (var part in nextNextListParts)
-                    {
-                        TimeSpan nowTimeOfDay = now.TimeOfDay;
-                        TimeSpan start = part.StartTime;
-                        TimeSpan end = part.EndTime;
-
-                        if (start < lowestStart)
-                        {
-                            lowestStart = start;
-                        }
-                    }
+                    {}
                     break;                 
                 }

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:270:29
                         TimeSpan start = part.StartTime;
                         TimeSpan end = part.EndTime;
 
-                        if (start < lowestStart)
+                        if (!(start < lowestStart))
                         {
                             lowestStart = start;

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:270:29
                         TimeSpan start = part.StartTime;
                         TimeSpan end = part.EndTime;
 
-                        if (start < lowestStart)
+                        if (start > lowestStart)
                         {
                             lowestStart = start;

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:271:25
                         TimeSpan end = part.EndTime;
 
                         if (start < lowestStart)
-                        {
-                            lowestStart = start;
-                        }
+                        {}
                     }
                     break;                 

[Killed] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:278:53
                     break;                 
                 }
             }
-            return (lowestStart + TimeSpan.FromDays(index-1));
+            return (lowestStart + TimeSpan.FromDays(index+1));
         }
         private async Task<TimeSpan> FindNextPartJumpOneDayAsync(int dayIndex, List<WorkPatternPart> listWorkPatternParts, DateTime now, CancellationToken cancellationToken)

[Killed] Arithmetic mutation
miguel-pvs/employee_api/Timers/TimerService.cs:278:21
                     break;                 
                 }
             }
-            return (lowestStart + TimeSpan.FromDays(index-1));
+            return (lowestStart - TimeSpan.FromDays(index-1));
         }
         private async Task<TimeSpan> FindNextPartJumpOneDayAsync(int dayIndex, List<WorkPatternPart> listWorkPatternParts, DateTime now, CancellationToken cancellationToken)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
miguel-pvs/employee_api/Timers/TimerService.cs:285:49
             TimeSpan lowestStart = TimeSpan.FromHours(24);
             DayOfWeek dayNextNextShift = new DayOfWeek();
             int index = 0;
-            for (index = dayIndex+1; index < 8; index++)
+            for (index = dayIndex+1; index < 8; index--)
             {
                 dayNextNextShift = now.AddDays(index).DayOfWeek;

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:285:38
             TimeSpan lowestStart = TimeSpan.FromHours(24);
             DayOfWeek dayNextNextShift = new DayOfWeek();
             int index = 0;
-            for (index = dayIndex+1; index < 8; index++)
+            for (index = dayIndex+1; index > 8; index++)
             {
                 dayNextNextShift = now.AddDays(index).DayOfWeek;

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:286:13
             DayOfWeek dayNextNextShift = new DayOfWeek();
             int index = 0;
             for (index = dayIndex+1; index < 8; index++)
-            {
-                dayNextNextShift = now.AddDays(index).DayOfWeek;
-                var nextNextListParts = listWorkPatternParts.FindAll(x => x.Day == dayNextNextShift);
-                if (nextNextListParts.Any())
-                {
-                    foreach (var part in nextNextListParts)
-                    {
-                        TimeSpan nowTimeOfDay = now.TimeOfDay;
-                        TimeSpan start = part.StartTime;
-                        TimeSpan end = part.EndTime;
-
-                        if (start < lowestStart)
-                        {
-                            lowestStart = start;
-                        }
-                    }
-                    break;
-                }
-            }
+            {}
             return (lowestStart + TimeSpan.FromDays(index - 1));
         }

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:308:9
             return (lowestStart + TimeSpan.FromDays(index - 1));
         }
         public async Task<bool> CheckIfInsideWorkPatternAsync(WorkPattern workPattern, CancellationToken cancellationToken)
-        {
-            DateTime today = DateTime.Today.Date;
-            DateTime beginWorkPattern = workPattern.StartDate.Date;
-            DateTime? endWorkPattern = workPattern.EndDate;
-            bool insideWorkPattern = false;
-
-            if (today >= beginWorkPattern & today <= endWorkPattern)
-            {
-                insideWorkPattern = true;
-            }
-
-            return insideWorkPattern;
-        }
+        {}
         {

[Killed] Boolean mutation
miguel-pvs/employee_api/Timers/TimerService.cs:312:38
             DateTime today = DateTime.Today.Date;
             DateTime beginWorkPattern = workPattern.StartDate.Date;
             DateTime? endWorkPattern = workPattern.EndDate;
-            bool insideWorkPattern = false;
+            bool insideWorkPattern = true;
 
             if (today >= beginWorkPattern & today <= endWorkPattern)

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:314:45
             DateTime? endWorkPattern = workPattern.EndDate;
             bool insideWorkPattern = false;
 
-            if (today >= beginWorkPattern & today <= endWorkPattern)
+            if (today >= beginWorkPattern & today > endWorkPattern)
             {
                 insideWorkPattern = true;

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:315:13
             bool insideWorkPattern = false;
 
             if (today >= beginWorkPattern & today <= endWorkPattern)
-            {
-                insideWorkPattern = true;
-            }
+            {}
 
             return insideWorkPattern;

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:322:9
             return insideWorkPattern;
         }
-        {
-            listWorkPatternParts = listWorkPatternParts.OrderBy(x => x.EndTime).ToList();
-            listWorkPatternParts = listWorkPatternParts.OrderBy(x => x.StartTime).ToList();
-            List<WorkPatternPart> newListTodayToAdd = new List<WorkPatternPart>();
-            WorkPatternPart previousPart = null;
-
-            if (listAbsentPerDay.Any())
-            {
-                nextListParts = await CheckIfPartSplitAsync(listWorkPatternParts, listAbsentPerDay, userId, cancellationToken);
-            }
-
-            nextListParts = nextListParts.OrderBy(x => x.EndTime).ToList();
-            nextListParts = nextListParts.OrderBy(x => x.StartTime).ToList();
-
-            foreach (var part in nextListParts)
-            {
-                (newListTodayToAdd, previousPart) = await OverLapTodayScheduleAsync(part, previousPart, newListTodayToAdd, cancellationToken);
-            }
-
-            return newListTodayToAdd;
-        }
+        {}
         {

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Timers/TimerService.cs:323:36
         }
         {
-            listWorkPatternParts = listWorkPatternParts.OrderBy(x => x.EndTime).ToList();
+            listWorkPatternParts = listWorkPatternParts.OrderByDescending(x => x.EndTime).ToList();
             listWorkPatternParts = listWorkPatternParts.OrderBy(x => x.StartTime).ToList();
             List<WorkPatternPart> newListTodayToAdd = new List<WorkPatternPart>();

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Timers/TimerService.cs:324:36
         {
             listWorkPatternParts = listWorkPatternParts.OrderBy(x => x.EndTime).ToList();
-            listWorkPatternParts = listWorkPatternParts.OrderBy(x => x.StartTime).ToList();
+            listWorkPatternParts = listWorkPatternParts.OrderByDescending(x => x.StartTime).ToList();
             List<WorkPatternPart> newListTodayToAdd = new List<WorkPatternPart>();
             WorkPatternPart previousPart = null;

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:328:17
             List<WorkPatternPart> newListTodayToAdd = new List<WorkPatternPart>();
             WorkPatternPart previousPart = null;
 
-            if (listAbsentPerDay.Any())
+            if (!(listAbsentPerDay.Any()))
             {
                 nextListParts = await CheckIfPartSplitAsync(listWorkPatternParts, listAbsentPerDay, userId, cancellationToken);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:329:13
             WorkPatternPart previousPart = null;
 
             if (listAbsentPerDay.Any())
-            {
-                nextListParts = await CheckIfPartSplitAsync(listWorkPatternParts, listAbsentPerDay, userId, cancellationToken);
-            }
+            {}
 
             nextListParts = nextListParts.OrderBy(x => x.EndTime).ToList();

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Timers/TimerService.cs:333:29
                 nextListParts = await CheckIfPartSplitAsync(listWorkPatternParts, listAbsentPerDay, userId, cancellationToken);
             }
 
-            nextListParts = nextListParts.OrderBy(x => x.EndTime).ToList();
+            nextListParts = nextListParts.OrderByDescending(x => x.EndTime).ToList();
             nextListParts = nextListParts.OrderBy(x => x.StartTime).ToList();
 

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Timers/TimerService.cs:334:29
             }
 
             nextListParts = nextListParts.OrderBy(x => x.EndTime).ToList();
-            nextListParts = nextListParts.OrderBy(x => x.StartTime).ToList();
+            nextListParts = nextListParts.OrderByDescending(x => x.StartTime).ToList();
 
             foreach (var part in nextListParts)

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:337:13
             nextListParts = nextListParts.OrderBy(x => x.StartTime).ToList();
 
             foreach (var part in nextListParts)
-            {
-                (newListTodayToAdd, previousPart) = await OverLapTodayScheduleAsync(part, previousPart, newListTodayToAdd, cancellationToken);
-            }
+            {}
 
             return newListTodayToAdd;

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:349:13
             var endTime = part.EndTime;
 
             if (!newListTodayToAdd.Any())
-            {
-                newListTodayToAdd.Add(part);
-                previousPart = part;
-                return (newListTodayToAdd, previousPart);
-            }
+            {}
 
             var startPrevious = previousPart.StartTime;

[Killed] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:350:17
 
             if (!newListTodayToAdd.Any())
             {
-                newListTodayToAdd.Add(part);
+                ;
                 previousPart = part;
                 return (newListTodayToAdd, previousPart);

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Timers/TimerService.cs:358:33
             var startPrevious = previousPart.StartTime;
             var endPrevious = previousPart.EndTime;
 
-            newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.StartTime).ToList();
+            newListTodayToAdd = newListTodayToAdd.OrderByDescending(x => x.StartTime).ToList();
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.EndTime).ToList();
 
