[Survived] Linq method mutation (OrderBy() to OrderByDescending())
miguel-pvs/employee_api/Timers/TimerService.cs:359:33
             var endPrevious = previousPart.EndTime;
 
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.StartTime).ToList();
-            newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.EndTime).ToList();
+            newListTodayToAdd = newListTodayToAdd.OrderByDescending(x => x.EndTime).ToList();
 
 

[Killed] Bitwise mutation
miguel-pvs/employee_api/Timers/TimerService.cs:362:17
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.EndTime).ToList();
 
 
-            if (startTime <= endPrevious & endTime >= startPrevious & endTime >= endPrevious)
+            if (startTime <= endPrevious | endTime >= startPrevious & endTime >= endPrevious)
             {
                 newListTodayToAdd.Remove(previousPart);

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:362:44
             newListTodayToAdd = newListTodayToAdd.OrderBy(x => x.EndTime).ToList();
 
 
-            if (startTime <= endPrevious & endTime >= startPrevious & endTime >= endPrevious)
+            if (startTime <= endPrevious & endTime < startPrevious & endTime >= endPrevious)
             {
                 newListTodayToAdd.Remove(previousPart);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:363:13
 
 
             if (startTime <= endPrevious & endTime >= startPrevious & endTime >= endPrevious)
-            {
-                newListTodayToAdd.Remove(previousPart);
-                previousPart.StartTime = startPrevious;
-                previousPart.EndTime = endTime;
-                newListTodayToAdd.Add(previousPart);
-            }
+            {}
             else if (endTime <= endPrevious)
             {

[Killed] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:364:17
 
             if (startTime <= endPrevious & endTime >= startPrevious & endTime >= endPrevious)
             {
-                newListTodayToAdd.Remove(previousPart);
+                ;
                 previousPart.StartTime = startPrevious;
                 previousPart.EndTime = endTime;

[Killed] Statement mutation
miguel-pvs/employee_api/Timers/TimerService.cs:367:17
                 newListTodayToAdd.Remove(previousPart);
                 previousPart.StartTime = startPrevious;
                 previousPart.EndTime = endTime;
-                newListTodayToAdd.Add(previousPart);
+                ;
             }
             else if (endTime <= endPrevious)

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:369:22
                 previousPart.EndTime = endTime;
                 newListTodayToAdd.Add(previousPart);
             }
-            else if (endTime <= endPrevious)
+            else if (!(endTime <= endPrevious))
             {
             }

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:369:22
                 previousPart.EndTime = endTime;
                 newListTodayToAdd.Add(previousPart);
             }
-            else if (endTime <= endPrevious)
+            else if (endTime > endPrevious)
             {
             }

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:373:13
             {
             }
             else
-            {
-                newListTodayToAdd.Add(part);
-                previousPart = part;
-            }
+            {}
 
             return (newListTodayToAdd, previousPart);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:382:9
 
         }
         public async Task<List<WorkPatternPart>> CheckIfPartSplitAsync(List<WorkPatternPart> listWorkPatternParts, List<Absent> listAbsentPerDay, int userId, CancellationToken cancellationToken)
-        {
-            DateTime today = DateTime.Today.Date;
-            var newListWorkPatternPartsToAdd = new List<WorkPatternPart>();
-            var newListWorkPatternPartsFOR = new List<WorkPatternPart>();
-            var finalListWorkPatternParts = new List<WorkPatternPart>();
-
-            foreach (var workPatternPart in listWorkPatternParts)
-            {
-                var workPatternPartToAdd = new WorkPatternPart
-                {
-                    Id = workPatternPart.Id,
-                    Day = workPatternPart.Day,
-                    StartTime = workPatternPart.StartTime,
-                    EndTime = workPatternPart.EndTime,
-                };
-                newListWorkPatternPartsToAdd.Add(workPatternPartToAdd);
-                newListWorkPatternPartsFOR.Add(workPatternPartToAdd);
-
-                    int indexAbsent = 0;
-                    finalListWorkPatternParts = await BreakWorkPatternAsync(listAbsentPerDay, newListWorkPatternPartsToAdd, newListWorkPatternPartsFOR, indexAbsent, cancellationToken);
-            }
-            return finalListWorkPatternParts;
-        }
+        {}
         {

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:389:13
             var finalListWorkPatternParts = new List<WorkPatternPart>();
 
             foreach (var workPatternPart in listWorkPatternParts)
-            {
-                var workPatternPartToAdd = new WorkPatternPart
-                {
-                    Id = workPatternPart.Id,
-                    Day = workPatternPart.Day,
-                    StartTime = workPatternPart.StartTime,
-                    EndTime = workPatternPart.EndTime,
-                };
-                newListWorkPatternPartsToAdd.Add(workPatternPartToAdd);
-                newListWorkPatternPartsFOR.Add(workPatternPartToAdd);
-
-                    int indexAbsent = 0;
-                    finalListWorkPatternParts = await BreakWorkPatternAsync(listAbsentPerDay, newListWorkPatternPartsToAdd, newListWorkPatternPartsFOR, indexAbsent, cancellationToken);
-            }
+            {}
             return finalListWorkPatternParts;
         }

[Killed] Object initializer mutation
miguel-pvs/employee_api/Timers/TimerService.cs:390:44
 
             foreach (var workPatternPart in listWorkPatternParts)
             {
-                var workPatternPartToAdd = new WorkPatternPart
-                {
-                    Id = workPatternPart.Id,
-                    Day = workPatternPart.Day,
-                    StartTime = workPatternPart.StartTime,
-                    EndTime = workPatternPart.EndTime,
-                };
+                var workPatternPartToAdd = new WorkPatternPart
+{};
                 newListWorkPatternPartsToAdd.Add(workPatternPartToAdd);
                 newListWorkPatternPartsFOR.Add(workPatternPartToAdd);

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:428:75
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart > endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:428:75
                 TimeSpan startPart = part.StartTime;
                 TimeSpan endPart = part.EndTime;
 
-                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart < endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:429:17
                 TimeSpan endPart = part.EndTime;
 
                 if ((startPart >= startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
-                {
-                    newListWorkPatternPartToAdd.Remove(part);
-                    part.StartTime = endAbsent;
-                    newListWorkPatternPartToAdd.Add(part);
-                }
+                {}
                 else if ((startPart < startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
                 {

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:434:55
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                else if ((startPart < startAbsent) & (endPart > endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Bitwise mutation
miguel-pvs/employee_api/Timers/TimerService.cs:434:26
                     part.StartTime = endAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
+                else if ((startPart < startAbsent) | (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:435:17
                     newListWorkPatternPartToAdd.Add(part);
                 }
                 else if ((startPart < startAbsent) & (endPart <= endAbsent) & (startPart <= endAbsent) & (endPart >= startAbsent))
-                {
-                    newListWorkPatternPartToAdd.Remove(part);
-                    part.EndTime = startAbsent;
-                    newListWorkPatternPartToAdd.Add(part);
-                }
+                {}
                 else if ((startPart < startAbsent) & (endPart > endAbsent))
                 {

[Killed] Negate expression
miguel-pvs/employee_api/Timers/TimerService.cs:440:26
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart > endAbsent))
+                else if (!((startPart < startAbsent) & (endPart > endAbsent)))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Bitwise mutation
miguel-pvs/employee_api/Timers/TimerService.cs:440:26
                     part.EndTime = startAbsent;
                     newListWorkPatternPartToAdd.Add(part);
                 }
-                else if ((startPart < startAbsent) & (endPart > endAbsent))
+                else if ((startPart < startAbsent) | (endPart > endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[Killed] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:441:17
                     newListWorkPatternPartToAdd.Add(part);
                 }
                 else if ((startPart < startAbsent) & (endPart > endAbsent))
-                {
-                    newListWorkPatternPartToAdd.Remove(part);
-
-                    var partSplit1 = new WorkPatternPart
-                    {
-                        Id = new Guid(),
-                        Day = part.Day,
-                        StartTime = startPart,
-                        EndTime = startAbsent,
-                    };
-
-                    var partSplit2 = new WorkPatternPart
-                    {
-                        Id = new Guid(),
-                        Day = part.Day,
-                        StartTime = endAbsent,
-                        EndTime = endPart,
-                    };
-                    newListWorkPatternPartToAdd.Add(partSplit1);
-                    newListWorkPatternPartToAdd.Add(partSplit2);
-                }
+                {}
                 else if ((startPart >= startAbsent) & (startPart <= endAbsent))
                 {

[Killed] Equality mutation
miguel-pvs/employee_api/Timers/TimerService.cs:462:27
                     newListWorkPatternPartToAdd.Add(partSplit1);
                     newListWorkPatternPartToAdd.Add(partSplit2);
                 }
-                else if ((startPart >= startAbsent) & (startPart <= endAbsent))
+                else if ((startPart > startAbsent) & (startPart <= endAbsent))
                 {
                     newListWorkPatternPartToAdd.Remove(part);

[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Timers/TimerService.cs:485:9
             }
         }
         public void Dispose()
-        {
-            _cancellationTokenSource.Cancel();
-            _cancellationTokenSource.Dispose();
-        }
+        {}
     }
 }
