[NoCoverage] Block removal mutation
miguel-pvs/employee_api/Workers/UnsWorker.cs:17:9
             IServiceProvider serviceProvider,
             ITimerService timerService)
 
-        {
-            _unsService = unsService;
-            _serviceProvider = serviceProvider;
-            _timerService = timerService;
-        }
+        {}
 
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Workers/UnsWorker.cs:43:13
 
             var updateAbsentsTask = _timerService.SetAbsentsAsync(absent, stoppingToken);
             var updateWorkPatternsTask = _timerService.SetInitialTimerAsync(users, stoppingToken);
-            await _unsService.CallEachCheckInAsync(users,now , stoppingToken);
+            ;
             await _unsService.CallEachWorkPatternAsync(wP, stoppingToken);
             await _unsService.PostAllLocationAsync(location, stoppingToken);

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Workers/UnsWorker.cs:44:13
             var updateAbsentsTask = _timerService.SetAbsentsAsync(absent, stoppingToken);
             var updateWorkPatternsTask = _timerService.SetInitialTimerAsync(users, stoppingToken);
             await _unsService.CallEachCheckInAsync(users,now , stoppingToken);
-            await _unsService.CallEachWorkPatternAsync(wP, stoppingToken);
+            ;
             await _unsService.PostAllLocationAsync(location, stoppingToken);
             await _unsService.CallEachApplicationUserAsync(users, stoppingToken);

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Workers/UnsWorker.cs:45:13
             var updateWorkPatternsTask = _timerService.SetInitialTimerAsync(users, stoppingToken);
             await _unsService.CallEachCheckInAsync(users,now , stoppingToken);
             await _unsService.CallEachWorkPatternAsync(wP, stoppingToken);
-            await _unsService.PostAllLocationAsync(location, stoppingToken);
+            ;
             await _unsService.CallEachApplicationUserAsync(users, stoppingToken);
 

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Workers/UnsWorker.cs:46:13
             await _unsService.CallEachCheckInAsync(users,now , stoppingToken);
             await _unsService.CallEachWorkPatternAsync(wP, stoppingToken);
             await _unsService.PostAllLocationAsync(location, stoppingToken);
-            await _unsService.CallEachApplicationUserAsync(users, stoppingToken);
+            ;
 
            

[NoCoverage] Statement mutation
miguel-pvs/employee_api/Workers/UnsWorker.cs:50:13
 
            
 
-            await Task.WhenAll(updateAbsentsTask, updateWorkPatternsTask);
+            ;
 
 
